

List<String> texts5 = [

'ፍች በንግግር ወይም በፅሁፍ ካለሆነ የሚፀና አይሆንም። እሷን ለመፍታት በቀልቡ '
'በመነየቱና ከራሱ ጋር እንደፈታት በማሰቡ ብቻ ፍቺው አይፀናም ፣ ምክንያቱም ነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) እንዲህ ብለዋልና:—\n\n '
'\" አላህ ለኔ ከኡመቴ እስካልተናገሩትና እስካልተገበሩት ድረስ ከራሳቸው ጋር ያወሩትን ' 
'(በቀልባቸው ያሰቡትን) ይቅር ብሎልኛል።\" በሲሒሕነቱ ተስማምተውበታል።',


'ሴት ልጅ ከባሏ ጋርም ይሁን አጂነቢ ከማይሆኗት ወንዶች ጋር በምትሰግድበት '
'ወቅት መሆን ያለባት ከኋላ እንጂ ከጎን (ቀኝም ሆነ ግራ) መሆን የለባትም። '
'በላጩ ይህ ቢሆንም ግን ከጎንም ብትሰግድ ሶላቷ ይበቃል። በዚህ ጊዜ በቀኝ በኩል ነው የምትሆነው። '
'በሚሰግዱበት ጊዜ የሚፈጠር የአካል_መነካካት አውቀውና አስበውበት እስካልሆነ '
'ድረስና በጨርቅ ጀርባ እስከሆነ ድረስ ሶላቱ ላይ የሚያመጣው ጉዳት የለም። \n\n'
'በመካከላቸው ለሚኖረው ክፍተት ደግሞ በሸሪዓችን ለወንድ የተደነገገ ነገር ሴትን '
'እንደማያካትትና ለወንድ ብቻ እንደሆነ እስካልተገለፀ ድረስ የወንድም የሴትም '
'አንድ ነው። እሱም ልክ ወንድ ከጎን ሲሆን እንደሚቀርበው ያክል ሴቷም የዛው አይነት ሁኔታ ነው የሚኖራት።',




'በመጀመሪያ ደረጃ በዚህ ዙሪያ ላይ በኡለሞች መካከል የተያየ አቋም ቢኖርም አመዛኙና በላጩ ግን ባል ሚስቱን '
'ሚስት ባሏን ቢነካኩ በስሜትም ይሁን ያለ ስሜት ውዱ አያስፈታም። ለዚህም በሀዲስ እንደመጣው '
'ነብዩ (ሶለሏሁ ኣለይሂ ወሰለም) ሚስቶቻቸውን ስመው ውዱእ ሳያደርጉ ሶላት የሰገዱባቸው አጋጣሚዎች እንዳሉ ተጠቅሷል። \n\n'

'በቁርአን ላይ አላህ በሱረቱ ኒሳእ ያለው \"...ወይም ሴትን ከነካችሁ '
'(ውዱእ አድርጉ)\" የሚለው አንቀፅ ደግሞ ኢብኑ አባስን ጨምሮ አብዛኛው '
'ኡለሞች ያሉትና ትክክለኛውም ትርጉም ከሴት ጋር ግንኙነት ካረጋችሁ እንጂ '
'በአካል ከተነካካችሁ ማለት እንዳለሆነ ተናግረዋል። ስለዚህ በባለትዳሮች መካከል የሚኖር የአካል መነካካት ውዱእ አያስፈታም።',




'አላህ ባሎችን በተለያዩ አጋጣሚዎች ሚስቶቻቸውን በሂጃብ እንዲያዟቸው ሚስቶችም ባሎቻቸውን '
'እንዲታዘዟቸው ትእዛዝ አስተላልፏል። ነገር ግን ይህ ሳይሆን ቀርቶ እርሷ በእምቢተኝነት '
'ከቀጠለች ባሏንም ባለመታዘዟም ሂጃብም ባለመልበሷ ድርድርብ ወንጀል ቢኖርባትም '
'አሁንም ቢሆን ሸሪዓው በፈቀደው መልኩ የተለያዩ ደረጃዎችን ይጠቀም። '
'እነሱም በመጀመሪያ ምንም ሳይሰለች በሚገባት ንግግርና በርህራሄ ይምከራት፣ '
'ከዛም እምቢ ካለች ያኩርፋት፣ አሁንም በዛው ለቀጠለች ትንሽ መታ ያርጋት፣ '
'አሁንም ከቀጠለች ለቤተሰቦቿ እንዲመክሯትና እንዲያስተካክሏት መልእክት ይላክ፣ ከዛም '
'ከቀጠለ ወጪ ይከልክላት ይህን ሁሉ አርጎ አሁንም እምቢ ካለችና በአመጷ ከቆየች ግን '
'የራሱ ምርጫ ነው አሁንም ቢሆን አበሮ መቂየቱ ተፅእኖ ይፈጥርና ልትስተካከል ትችል '
'ይሆናል ካለ አብረው ይቆዪ ካልሆነ ግን በዚህ ሁኔታ አብሮ መኖሩ ከባድ ነው።',




'በመጀመሪያ ደረጃ ሴት ልጅ ያለ መህረም (ማግባት የማትችላቸው የቅርብ ዘመዶች) ጋር '
'ካለሆነ በስተቀር ሩቅ ጉዞ መጓዝ አይፈቀድላትም። በቻለችው አቅም በዙሪያዋ ከሚገኙት '
'ወንዶች ከባሏ ጀምሮ አብሮ የሚወስዳት ቅርብ ዘመድ (ወንድም፣ አባት፣ ልጅ ...) '
'ሊኖር ይገባል። ይህ ሳይሆን ቀርቶ ብቻዋን ከሄደች ሀራም ተግባርን ፈፅማለች ማለት ነው። '
'ሲቀጥል ከመህረም ጋር አብራም ብትሄድ የባሏን ፍቃድ ማግኘት አለባት።'
'ገር ግን ከሄደች በኋላ ሀላል የሆነና ከወንዶች ጋር መቀላቀል የሌለበት ስራ '
'እስከሰራች ድረስ ያለ መህረም ሩቅ ሀገር መቆየቷ ችግር የለውም። የተከለከለው ያለ መህረም መጓዟ ነው።',





'የእህት ባል መህረም/ማግባት የማይቻል የቅርብ ዘመድ አይደለም። ለሚስቱ እህት '
'አጂነቢ ነው። ምክንያቱም ለጊዜው የሚስቱን እህት ማግባት ባይቻልለትም፣ ሚስቱን '
'ከፈታት ወይም ከሞተች የሷን እህት ማግባት ይፈቀድለታልና። ለዚህም ሲባል '
'ከሷ ጋር የሚኖረው ግንኙነት ልክ እንደማንኛውም አጂነቢ ወንድ ነው።',



'በመጀመሪያ ደረጃ ፍቺ በንግግር የሚፈፀም ተግባር ቢሆንም አንዳንዴ የባልዩው ኒያ '
'ከግምት ውስጥ ሊገባ ይገባል። እሱም አንቺ እንዳለሺው \"እኔና አንቺ ተፋተናል ማለት ይቻላል\" '
'ማለቱ አንዳንድ ኡለሞች እነ ሸህ ኢብኑ ባዝን ጨምሮ ግልፅ የሆነ የፍች ቃል ነውና ፍቺው '
'ይፀድቃል ያሉ አሉ ፣ ሌሎች ኡለሞች ደግሞ ይህ ቃል አሽሙር እንጂ ባልዩው ፍችን '
'መፈለጉን በቀጥታ የሚያመላክት ቃል አይደለምና ፍቺው አልፀደቀም ይላሉ። '
'ብቻ ግን በጥቅሉ የሁሉኑም ስንጨምቀው የባልዩው ኒያና ፍላጎት ነው የሚወስነው፣ ስለዚህ '
'መደረግ ያለበት ባልዩው ይህንን ስትል ምን ለማለት ፈልገህ ነው ተብሎ '
'ይጠየቃል፣ ማለትም ይህን ቃል ስትናገር ለመፍታት ፈልገህ ነበር ወይስ ዝም ብለህ ነው ይባላል፣ የዛኔ ያስታውቃል። '

'መፋታት አለብን፣ መሄድ አለብሽ ምናምን እነዚህም ዛቻና ግልፅ ያለሆነ '
'ንግግር ነው፣ ፍቺ ደግሞ በዛቻ አይፀናም፣ የግድ ግልፅ የሆነ አሻሚ ያልሆነ ንግግር መናገር አለበት።',







'ኡለማዎች የምትታጭ ሴትን ለመመልከት መስፈርቶችን አስቀምጠዋል። ከነዛም ውስጥ;– '

'የሚያጨው ሰው በማጨቱ ላይ ቁርጠኛ '
'      ሊሆን ይገባዋል፣ '
'በሀሳቡ ተቀባይነትን ሊያመዝን ይገባዋል፣ '
'ሲመለከት በኸልዋ (ብቻ ለብቻ) መሆን '
'      የለበትም‼️ '
'እሷን ሲመለከት አላማው ለማረጋገጥ ያክል '
'     እንጂ በእይታ ለመርካት ሊሆን አይገባውም። '
'ፊት፣ እጅና ብዙውን ጊዜ ግልፅ የሚሆኑ '
'      አካላቶችን ብቻ ነው መመልከት ያለበት። '
'የምትታጨው ልጅ የተገላለጠችና ሽቶ '
'      የተቀባች መሆን የለባትም። '
'በመጀመሪያው ምልከታ የማይብቃቃ ከሆነ '
'     ሁለተኛ መድገም ይችላል።በመጀመሪያው '
'     ከተብቃቃ ግን ሁለተኛ ጊዜ ማየት '
'     አይቻልለትም። '
'በእጅ ሰላምታን መለዋወጥ፣ መንካትም '
'      ይሁን ብቻ ለብቻ መሆን አይቻልም። '
'     ምክንያቱም ኒካህ እስካላደረጉ ድረስ '
'      አጂነቢ ከመሆን አትወገድምና። '
'ሌላ ወንድሙ ያጫትን #በጎን ማጨት '
'      አይቻልም። '
'ምክንያቱም ነብያችን صلى الله عليه وسلم እንዲህ ስላሉ: '

'\"ያጫት ሰው ቀድሞ እስካልተወ ወይም #እስካልፈቀደለት ድረስ አንድ ሰው ወንድሙ ያጫት ላይ አይጭበት።\" '
'ቡኻሪ፣ 5146 '
' እና ሌሎችም አሉ።',








'ኡለማዎች የምትታጭ ሴትን ለመመልከት መስፈርቶችን አስቀምጠዋል። ከነዛም ውስጥ;– '

'የሚያጨው ሰው በማጨቱ ላይ ቁርጠኛ '
'      ሊሆን ይገባዋል፣ '
'በሀሳቡ ተቀባይነትን ሊያመዝን ይገባዋል፣ '
'ሲመለከት በኸልዋ (ብቻ ለብቻ) መሆን '
'      የለበትም‼️ '
'እሷን ሲመለከት አላማው ለማረጋገጥ ያክል '
'     እንጂ በእይታ ለመርካት ሊሆን አይገባውም። '
'ፊት፣ እጅና ብዙውን ጊዜ ግልፅ የሚሆኑ '
'      አካላቶችን ብቻ ነው መመልከት ያለበት። '
'የምትታጨው ልጅ የተገላለጠችና ሽቶ '
'      የተቀባች መሆን የለባትም። '
'በመጀመሪያው ምልከታ የማይብቃቃ ከሆነ '
'     ሁለተኛ መድገም ይችላል።በመጀመሪያው '
'     ከተብቃቃ ግን ሁለተኛ ጊዜ ማየት '
'     አይቻልለትም። '
'በእጅ ሰላምታን መለዋወጥ፣ መንካትም '
'      ይሁን ብቻ ለብቻ መሆን አይቻልም። '
'     ምክንያቱም ኒካህ እስካላደረጉ ድረስ '
'      አጂነቢ ከመሆን አትወገድምና። '
'ሌላ ወንድሙ ያጫትን #በጎን ማጨት '
'      አይቻልም። '
'ምክንያቱም ነብያችን صلى الله عليه وسلم እንዲህ ስላሉ: '

'\"ያጫት ሰው ቀድሞ እስካልተወ ወይም #እስካልፈቀደለት ድረስ አንድ ሰው ወንድሙ ያጫት ላይ አይጭበት።\" '
'ቡኻሪ፣ 5146 '
' እና ሌሎችም አሉ።',







'በሸሪዓችንም በእርግዝና ወቅት ግኑኝነትን የሚከለክል ቁርአናውም ሆነ '
'ሀዲሳዊ ጥቅስ የለም። ስለዚህ ፅንሱ ይጎዳል ተብሎ እስካልታሰበ ድረስ ግኑኝነት ማድረግ ይቻላል።',





'ወንድ ልጅ አጂነቢ የሚሆነው ስለሴት ማሰብ ፣ ስለ ሀፍረት ገላ '
'ማወቅ ሲጀመር ፣ ወደ ሴቶች አተኩሮ መመልከት ሲጀምርና ስለሴቶች '
'ማውራት ሲያበዛ የዚህን ጊዜ ደርሷል ማለት ነው ለሱ አጂነቢ '
'የሆነች ሴት እሱ ፊት መገለጥ አይፈቀድላትም። '
'ነገር ግን ይህ በእድሜ ብንቀይረው እንደየሰው ይላያያል፣ አንዳንዱ '
'ቶሎ ይበስላል፣ አንዳንዱ ደግሞ ይዘገያል። በሀገራችን ብዙዎቹ '
'ልጆች እዚህ ደረጃ የሚደርሱት ከ13 እስከ 15 ባለው እድሜ ክልል አካባቢ ነው። ',





'በመጀመሪያ አንዳንድ ዶክተሮች እንደሚሉት የወሊድ መቆጣጠሪያ ጉዳት አለው '
'የሚባለው ነገር እውነት_ከሆነ መጠቀሙ ሀራም ነው። ምክንያቱም በሸሪዓችን ጉዳት ያለውን ነገር መጠቀም አይፈቀድምና።'
'ነገር ግን ጉዳት ከሌለውና በጣም አስፈላጊና አስገዳጅ ሁኔታ ከተፈጠረ '
'ለምሳሌ እናት ታማሚ ከሆነች ፣ የምታጠባ ሁና ካረገዘች ጉዳት ያጋጥማታል '
'ተብሎ የሚሰጋ ከሆነ ፣ የተወለደው ልጅ እሷ በማርገዟ የሚጎዳ ከሆነ ፣ '
'ወይም እርግዝናዋን የሚጎዳ በሽታ ካለባትና እነዚህንም ነገራቶች ዶክተሮች ካረጋገጡ መቆጣጠሪያውን መጠቀም ይቻላል። '

'ከዛ ውጭ ግን ጥሩ ኑሮ ለመኖር ብላ ወይም ሪዝቅንና_ማሰደጊያውን ፈርታ ከሆነ መጠቀሙ በጭራሽ አይፈቀድም‼️',





'የተገደደው በምን መልኩ ነው። ለምሳሌ ግዴታነቱ ከባድ ከሆነ '
'ኒካሁ አይፈርስም። ይህም ማለት ሲያስገድዱት ይህን ባያደርግ እንደሚገሉት '
'ወይ እንደሚያስሩት ወይም ብቻ እሷን ባይፈታ በአካሉም ይሁን በንብረቱ '
'ላይ ከባድ ጉዳት እንደሚደርስበት እርግጠኛ ሆኖ ከሆነ ኒካሁ አልወረደም፣ አልተፋቱም። '
'ነገር ግን ቀለል ያለ መገደድ ከሆነ ማለትም ዝም በሎ ዛቻና እሷን ባይፈታ '
'ምንም የማይደርስበት አይነት መገደድ ከሆነ ይህ ፍቺው ተረጋግጧል ተፋተዋል። '
'ምክንያቱም ቀለል ያለ መገደድ በምርጫው እንዳደረገው ነው የሚቆጠረው።',





'ባል ሚስቱ ላይ ካሉት ሀቆችና መብቶች መካከል ወደ አልጋ ሲጠራት ምክንያታዊ ችግርና '
'ኡዝር ካላጋጠማት በስተቀር ልትታዘዘው ይገባል። ለዚህም ነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) '
'አቡ ሁረይራ ባወሩት ሀዲስ እንዲህ ብለዋል:— '

' \"ባል ሚስቱን ወደ አልጋ ጠርቷት እምቢ ካለች ሌሊቱ እስኪነጋ ድረስ መላኢካዎች ይረግሟታል።\" '
 'ቡኻሪና ሙስሊም ዘግበውታል '

'ስለዚህ ያለ ምንም ምክንያት እምቢ ማለቷ የባሏን ሀቅ ካለመወጣታም ጭምር '
'አላህን አስቆጥታለች፣ መላኢካዎችም ይረግሟታልና ከዚህ ድርጊቷ ልትቆጠብ ይገባል።',




'ባል ሚስቱን መፍታቱን ሚስቱ ፊት መናገርና ለሷ ማሳወቅ ግዴታም ሆነ መስፈርት አይደለም። '
'ሚስት ትወቅም አትወቅም መፍታቱ ከተረጋገጠ ፍቺው ተረጋግጧል። ባሏ እሷን መፍታቱን '
'ያወቀችው ሶስት ጊዜ ሀይድ አይታ ከጠራች በኃላ እንኳን ቢሆን ያው ኢዳዋ የሚጀምረው '
'እሱ ከፈታበት ቀን ጀምሮ እንጂ እሷ ከሰማችበት ቀን ጀምሮ ስላልሆነ ዒዳዋን ጨርሳለች ማለት ነው።',





'በእናትም በአባትም ይሁን በአንድኛው እህትማማች የሆኑትን በአንድ ጊዜም ይሁን '
'በተለያየ ጊዜ ማግባት አይፈቀድም። መጀመሪያ ያገባት ወይ ፈቷት ወይም '
'ከሞተች በኃላ ካልሆነ ማግባት አይፈቀድለትም። ለዚህኝ አላህ እንዲህ ይላል:— '

'\" ድሮ (ባለፈው ባገባችሁት) ካልሆነ በስተቀር ሁለት እህትማማቾችን በአንድ ላይ መሰብሰብ (ማግባት) አይፈቀድላችሁም።\" '
'ሱረቱ ኒሳእ ፣ 23',




'ባል ቃል ለመግባት ፈቃደኛ እስከሆነ ድረስ ይቻላል። አንዳንድ ኡለሞች ይህ ባል አላህ '
'የፈቀደለትን ነገር መከልከል ነው ቢሉም ግን ባልኮ በቃልኪዳኑ መስማማት ግዴታ '
'የለበትም። ከፈለገ አለመቀበል ይችላል ስለዚህ ሚስት ባሏ ሁለተኛ ሚስት እንዳያግባ '
'ቃል ማስገባት ትችላለች። ባልም ቃል ከገባ ቃሉን የመሙላት ግዴታ አለበት ፣ '
'አለያ ግን ባል ቃሉን ካላከበረ ሚስት ኒካሁን የማፍረስ መብት አላት።',





'ሚስት ባሏን ፍች መጠየቅ የምትችልባቸው ሁኔታዎች የሚከተሉት ናቸው:— '
'በድህነቱ ምክንያት ሚስቱንና ልጆቹን '
'      ማስተዳደር ካልቻለ ፣ '
'በህይወት ይኑር ይሙት '
'      እስከማይታወቅ ድረስ ከሚስቱ ርቆ '
'      ሌላ ሀገር ከቆየ ፣ '
'እሱን ከማግባቷ በፊት የማታውቀው '
'      የሆነ ተፈጥሮአዊ ነውር ካገኘችበት '
'      ለምሳሌ ስንፈተ ወሲብ ፣ '
'አካላዊ ጉዳትና ስሜታዊ ጉዳት (ያለ '
'      ምንም ምክንያት አብሮ መተኛትን '
'      መተው ፣ እሷንም ሆነ ቤተሰቦቿን '
'      መስደቡ)  እና ሌሎች ጉዳቶችን '
'      ካስከተለ ፣ '
'እሷን ከመምከር እየራቀና በማኩረፍ '
'      የማያናግራት ከሆነ ፣ '
'ባል ለጉዞ ወጥቶ ከስድስት ወር '
'      በላይ ከቆየና ሚስትም እሱ በመራቁ '
'      ምክንያት የምትጎዳ ከሆነች ፣ '
'ልጆቿን ከማየት የሚከለክላት ከሆነች እና'
'ሚስቱን ከጠላትና የሚያርቃት ከሆነ '

'እነዚህ ምክንያቶች በመጀመሪያ ደረጃ በምክክርና በውይይት መፈታት '
'የማይችሉ ከሆነ ሚስት ከባሏ ፍች የመጠየቅ መብት አላት። '
'ወደ ጥያቄው ስንመለስ ባል ሌላ ሚስት ካንቺ በፊትም ይሁን '
'ካንቺ በኃላ ማግባቱም ሆነ አለመናገሩ ብቻ ፍችን ለመጠየቅ በቂ ምክንያት አይሆንም።',





'የልጆቹ ወላጆች (የባልም ሚስትም) ሙሉ ፈቃደኝነት እስካለ ድረስ '
'አስፈላጊ ይሁንም አይሁን ልጅን ከእናቱ ውጭ ካለች እናት ጡት '
'እንዲጠባ ማድረግ የሚፈቀድ ተግባር ነው። ለዚህም አላህ እንዲህ ይላል:— '

'\"ልጆቻችሁን ሌሎች እንዲያጠቡላችሁ ብትፈልጉም በእናንተ ላይ ችግር የለባችሁም።\" '
'ሱረቱል በቀራህ ፣ 233 ',




'በመጀምሪያ ደረጃ ሴት ልጅን ወልይ ሆኖ ኒካህ የማሳሰሩን ጉዳይ ሀላፊነት የሚወስደው መጀመሪያ '
'አባቷ ነው ከዛም ወደ ላይ አያቷ እያለ ይቀጥላል ፣ ይህ ካልተገኘ ደግሞ '
'ልጇ ነው ከዛም ወደ ታች የልጅ ልጇ እያለ ይቀጥላል። ከዛም በዚህ ከሌለ ደግሞ ቀጣይ ወንድሟ ነው። '

'ስለዚህ ከአባቷ ውክልና ካልተሰጠው በስተቀር አባት እያለ ልጅ ኒካህ ማድረግ አይችልም።',




'በመጀመሪያ ደረጃ እሱ እንዲሰልም ያለሽ ጉጉት በጣም የሚበረታታና '
'ማሻአሏህ ነው አላህ ይጨምርልሽ። በመቀጠል አንዲት ሙስሊም ሴት '
'ካፊር_ወንድን ቀድሞ ሰልሞ ካልሆነ በስተቀር ማግባት በጭራሽ አይፈቀድላትም። ለዚህም አላህ እንዲህ ይላል:— '

'\"ለሙሽሪኮች (አጋሪዎችን) በአላህ እስኪያምኑ ድረስ አትዳሩላቸው፣ ሙሽሪኩ ቢደንቃችሁም ሙእሚን ባሪያ በላጭ ነው።\"'
'ሱረቱል በቀራህ ፣ 221 '

'በመቀጠል እንደምታገቢው ቃል ስለገባሽለት አንቺን ከማግባቱ በፊት '
'ቀድሞ የሚሰልም ከሆነና አንቺም ለሱ መስለም ምክንያት መሆንሽ በጣም የሚበረታታና '
'በላጭ ተግባር ነው።ከዛ በፊት ግን የሚሰልመው አንቺን ለማግባት '
'ብሎ ነው ወይስ በኢስላም ተማርኮ የሚለው መጣራቱ በላጭ ነው። '
'ምክንያቱም አንዳንድ ካፊር_ወንዶች ከገባሽኝ እሰልማለሁ እያሉ ብዙ ሴቶችን '
'በመቅጠፍ ሂወታቸውን ያበላሹ እንደነበረ ይታወቃልና ካገባሽ በኃላ ሌላ '
'ችግር እንዳይፈጠር የተለያዩ መፈተኛ ነገራቶችን በመጠቀም መስለሙ ካንቺ ጋር '
'ለምን እንደተያያዘና ለምን ካገባሽ በኃላ መስለም እንደፈለገ ሊጣራ ይገባዋል።',




'በአባት ስም መጠራት እና ወደ እርሱ ራስን በስያሜ ማስጠጋት ግዴታ ነው። ለዚህም አላህ እንዲህ ይላል:— '

'\"ወደ አባቶቻቸው (አስጠግታችሁ) ጥሯቸው ፣ ይህ አላህ ዘንድ ትክክለኛው ነው።\" ሱረቱል አህዛብ ፣ 5 '
'ከአባት ውጭ ባለ አካል የፈለገ ቢያሳድግ የአባትነትን ስያሜ መተካት አይችልም። '
'ወደ እርሱም ራስን አስጠግቶ መሰየምና መጠራት ዘርምን ከማዛባትም '
'በተጨማሪ በሀዲስ እንደመጣው የአላህ እርግማን ያለበት የተከለከለ ተግባር ነው። '

'\"አንድ ሰው እያወቀ ከአባቱ ስም ውጭ ቢጠራ ይከፍራል።\" '
'ቡኻሪና (3508) ሙስሊም (61) ዘግበውታል',




'እንደተባለው የተፋቱት ፆታዊ ግኑኝነት ከማድረጋቸውና በአካልም ሳይገናኙ '
'በፊት ከሆነ የመህሩ ግማሽ ለሚስት ነው የሚሰጠው ፣ ግማሹ ደግሞ ለባል። '
'ነገር ግን በላጩ ከሁለቱ አንዱ ግማሹን አውፍ ቢል ይወደዳል። ወይ '
'ባል አውፍ ብሎ ሙሉውን ቢሰጣት ፣ ወይም ሚስት አውፍ ብላ ሙሉውን ብተውለት የተወደደ ነው። '
'ከዚህም በተጨማሪ እንደሌላዋ የተፈታች ሴት ኢዳ አትቆጥርም ። '
'ቀጥታ ሌላ ማግባት ትችላለች። ነገር ግን ከመፋታታቸው በፊት ግኑኝነት አርገው ቢሆን ኖሮ  ሙሉው መህር ትወስድ ነበር።',




'በኒካህ ወይም በማጨት ወቅት ቀለበት ማድረግ ከካፊሮች የመጣ ተግባርና እነሱ '
'የሚታወቁበት ስለሆነ በሸሪዓችን በጣም ብናቀለው የተጠላ አለያ የተከለከለ ተግባር ነው። '
'በተለይ ይህ ቀለበት እስካልወለቀ ድረስ ፍቅርን ያጠነክራል ልዩነት አይኖርም ተብሎ '
'የሚታሰብ ከሆነ ደግሞ ሽርክ ነውና የሚሆነው ወደ ሽርክ ከሚያመሩ መንገዶችም አንዱ ሊሆን ይችላልና የተከለከለ ይሆናል።',





'ፍችን በፅሁፍ መግለፅ የሚቻለው በሁለት መልኩ ነው። እነሱም:— '
'1 ማነጋገር የማይችል ዲዳ የሆነ ሰው ከሆነ ፣ '
'2 ፍችን አስቦበት የፃፈው ከሆነ ብቻ ነው። '

'ምክንያቱም ፍችን ሳያስብበት ዝም ብሎ በስልኩ እየተጫወተ እያለ ወይም በስልኩ '
'ሌላ ነገር እፅፋለሁ እያለ ሳያስበው ሊፅፈው ይችላልና ይህን መልእክት ሲልክ በምን_መልኩ '
'እንደሆነ ይጠየቃል። ለምሳሌ ይህን ፅሁፍ ሲልክ በሰአቱ ፍችን አስቦበት ነው ወይስ '
'አይደለም የሚለውን ከተጠየቀ በኃላ ነው ፍርድ የሚሰጠው።',




'በዚህ መልኩ ሚስቱን ሲጠራ ለማቆላመጥና ለመቀለድ ብሎ ከሆነ ችግር የለውም። '
'ነገር ግን እያመረረ እና እየተቆጣ ከሆነ ይህን ያለው ወደ ሌላ ሊወስድበት ይችላልና አይፈቀድም።',



];


List<String> appTitless5 = [


  'ሚስቱን በቃል ሳይናገር በቀልቡ (በሀሳቡ) ቢፈታት',


  'የሚስት እና የባል አሰጋገድ',


  'ባልናሚስት ቢነካኩ ኡዱ ይፈታሉ',


  'ሚስቴ ሒጃብ አለብስም አለችኝ',


  'ሚስት ብቻዋን ሩቅ ሀገር ለስራ መሄዷ',



  'የእህት ባል አጂነቢ ነውን',


  'እኔና አንቺ ተፋተናል ማለት ይቻላል',


  'ሚስትን ለማጨት ብሎ መመልከት',



  'ሚስትን ለማጨት ብሎ መመልከት',



  'በእርግዝና ወቅት ግኑኝነት ማድረግ',


  'የወንድ ልጅ የአጂነቢነት እድሜ መጀመሪያ',



  'የወሊድ መቆጣጠሪያ መጠቀም',



  'ሚስትን በፍርድ ቤት ተገዶ መፍታት',



  'ባሏ ለግኑኝነት ሲጠራት እምቢ ማለቷ',



  'ፈታሁሽ ሲለኝ አልሰማሁትም',



  'እህትማማቾችን አንድ ላይ ማግባት',



  'ባል 2ኛ ሚስት እንዳያገባ ቃል ማስገባት',



  'ባሏን ፍታኝ ማለት የምትችልባቸው ሁኔታ',



  'ለመዛመድ ተብሎ ሌላ ልጅ ማጥባት',




  'ልጅ ለእናቱ ወልይ ሆኖ ኒካህ ማሳሰሩ',



  'ካገባሽኝ እሰልማለሁ አለኝ',



  'ከአባት ውጭ ባለ አካል መጠራት',



  'ከፆታዊ ግኑኝነት በፊት ፍች ቢከሰት',



  'የቀለበት ፕሮግራም',



  'ፍችን በፅሁፍና በሜሴጅ መግለፅ',



  'ሚስትን ማማ ፣ እናት ብሎ መጥራት',




];



List<String> sources5 = [



  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ',


  'ሸይኽ ኢብኑ ባዝ ረሂመሁሏህ',



  'ሸይኽ ኢብን ባዝ ረሂመሁሏህ',



  'ኢብኑ ዑሰይሚን',



  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',




  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም ',


  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',



  'ኢብኑ ኡሰይሚን፣ ኺጥበቱን ኒካህ',



  'ኢብኑ ኡሰይሚን፣ ኺጥበቱን ኒካህ',



  'የሳዑዲ የዑልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 19/353',




  'ኢብኑ ቁዳማ – ሙግኒ',


  'ኢብኑ ዑሰይሚን ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',



  'ሸይኹል ኢስላም ኢብኑ ተይሚያ ፣ ኪታብ አል ኢኽቲያራቱል ፊቅህያ',


  'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ ፈትዋ ቁጥር 13865',



  'ኢብኑ ኡሰይሚን ፣ ፈትዋ፣ 2/804',



  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',



'ኢብኑ ኡሰይሚን ፣ ሸርህ ሙምቲዕ ፣ 5/243 ፣ \n'
'ኢብኑ ቁዳማ ፣ ኪታብ ሙግኒ ፣ 9/483 ፣ \n'
'ሸይኽ ፈውዛን ፣ ኪታብ ሙለኸሱል ፊቅህ ፣ 2/345,346',


'ኢብኑ ኡሰይሚን ፣ ሊቃኡል መፍቱህ ፣ 6/54',




'ተፍሲሩል ቁርጡቢ ፣ 124',



'ኢብኑ ቁዳማ ፣ ኪታብ ሙግኒ ፣ 7/14,22 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ ሸርህ ሙምቲዕ ፣ 12/45',



'ተፍሲር አድወኡል በያን ፣ 164–168',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ '
'ሸይኽ ሰርኸሲይ ፣ ኪታቡል መብሱጥ ፣ 27/158',



'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 12/293 ፣ \n'
'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣7/191',



'ኢብኑ ኡሰይሚን ፣ ሊቃኡል ሸይርይ ፣ 1/46 ፣ \n'
'መጅሙኡል ፈታዊ ፣ 18/112',



'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 7/373 ፣ \n'
'ሸይኽ ሙሀመድ ኢብኑ ኢብራሒም ፣ ፈትዋ ቁጥር 11/3050, 3051',




'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 6/8 ፣ \n'
'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 20/274',



];



List<String> questions5 = [


  'ሚስቱን በቃል ሳይናገር በቀልቡ (በሀሳቡ) ቢፈታት ወይም ለማንም ሳይናገር ከራሱ '
'ጋር ልክ እንደፈታት ሁኖ ቢያስብ በትክክል እንደፈታት ነው የሚቆጠረው ወይስ እንዴት ነው?',



  'ሴት ከባለቤቷ ጋር ስትሰግድ እንዴት ነው?\n '
'በመቀራረብ ይቻላል በመሀላቸው ምን ያህል ርቀት መኖር አለበት?\n'
'በየትኛው በኩል ነው መሆን ያለባት በስተቀኝ በግራ ወይስ በሱ ትክክል ከኃላ?\n'
'የእሷ እራስ እና የሱ እግር መነካካትስ እንዴት ይታያል?\n',



  'ባልናሚስት ቢነካኩ ኡዱ ይፈታሉ?',



  'አንድ ሰው ሚስቱ የማትሸፈን ከሆነች? እድትሸፈን በሲነግራትም እምቢ ካለች ምድነው ማድረግ ያለበት? '
'ባልዮውስ በሱ አስተዳደር ስር ስለሆነች በማትሸፈነው አላህ ዘንድ ተጠያቂ ይሆናል?',



  'በድህነት ምክንያት ሚስት ከባሏ ውጪ ለብቻዋ ለስራ ወደ ውጪ አገር መሄዷ እንዴት ይታያል?',



  'አንዲት ሙተነቂብ የሆነች ሴት የእህቷ_ባል ፊት ፊቷን መግለጥ ትችላለችን?',



  'ባሌ ጋር በጣም እየተጨቃጨቅን በጣም ተናዶ ስለነበር "በቃ እኔና አንቺኮ ተፋተናል '
'ማለት ይቻላል" አለኝ፣ ታዲያ ፍቺው ተገኝቷል ወይስ፣ መፋታት አለብን ፣ '
'ወደ ቤተሰቦችሽ መሄድ አለብሽ እና ተመሳሳይ ቃላቶችስ እንዴት ናቸው?',



  'ሚስትን ለማጨት ብሎ መመልከት',



  'ሚስትን ለማጨት ብሎ መመልከት',



  'በእርግዝና ወቅት ግኑኝነት መፈፀም ይቻላልን? ዶክተሮች እስከ 7 ወር ድረስ ችግር የለውም ይላሉ?',



  'ወንድ ልጅ አጂነቢ የሚሆነውና ሴትም እሱ ፊት ከመገለጥ የምትከለከው ከስንት እድሜው ጀምሮ ነው?',



  'የወሊድ መቆጣጠሪያን ቶሎ ቶሎ ላለመውለድና ከኑሮውም አንፃር መጠቀም እንዴት ይታያል?',



  'አንዲት እህታችን ፍች የተፈታችው በፍርድ_ቤት ነው ፣ ይህም የሆነበት '
'ምክንያት ልጁ አልፈታም ብሏት በፖሊስ በግድ እንዲፈታ ተደረገ ፣ ታዲያ ይህ ፍች ትክክል ነውን?',



  'ሚስት ባሏ ለግኑኝነት ሲጠራት እምቢ ማለቷ ወንጀለኛ ያረጋታልን ፣ ካልተመቻትስ?',



  'ባሌ ሲፈታኝ በራሱ አንደበት አልሰማሁትም፣ ከዚህ በፊት '
'እንደፈታኝ ይናገራል ፣ታዲያ እኔ ሳልሰማው ቢፈታኝ ፍቺው ይፀናልነዴ?',



  'ሁለት እህትማማቾችን በአንድ ጊዜ ማግባት እንዴት ይታያል?',



  'አንዲት ሴት ከማግባቷ በፊት ሌላም ሚስት እንዳታገባብኝ ብላ '
  'የሚያገባትን ልጅ ቃል ማስገባት ትችላለችን?',



  'ከባሌ ከኔ በፊት ሌላ ሚስት ማግባቱን ከደረስኩበት በኃላ እንዲፈታኝ '
'እየጨቀጨኩት ነው ፣ እሱ ደግሞ አልፈታም እያለ ነው ፣ ምን ላድርግ?',



  'ወንድማማች እንዲሆኑ አስቦ የወንድምን ሆነ የእህትን ልጅ ማጥባት እንዴት ይታያል?',



  'ልጅ ለእናቱ ወልይ ሆኖ ኒካሕ ማሳሰር ይቺላል ወይ? እነማን '
'ሳይኖሩ ነው ወልይ መሆኑን የምናውቀው? የቅርብ ወራሽ ሲጠፋ ወይስ ቃዲ ሲታጣ?',



  'አንድ ልጅ ነበር ካገባሽኝ እሰልማለሁ እያለ ብዙ ጊዜ ይለምነኛል ፣ '
'ምን ላርግ ባንድ በኩልም የሂድያው ሰበብ ብሆን እላለሁ?',



  'ያደኩት አክስቴ ቤት ነውና ከልጅነቴ ጀምሮ የምጠራውም በአክስቴ_ባል ስም ነው ፣ ይህ እንዴት ይታያል?',



  'እሷ ውጭ እያለች ኒካህ አድርገው ነገር ግን ምንም ግኑኝነት ሳያደርጉ '
'ተጣሉ እና ፈታሁሽ አላት ፣ ታዲያ እሷ  መህሩን ሙሉውን መጠየቅ ትችላለች?',



  'ቀለበት በኢስላም እንዴት ነው ኒካህ ሲደረግ ቀለበት ማድረግ '
'ሱና ነው?  በየትኛው እጅ ነው ሚደረገው ለወንድና ለሴት ልዩነት አለው?',



  'በሜሴጅ ወይም በፅሁፍ ፈታሁሽ ብሎ ቢልክላት ፍቺው ይፀድቃል?',



  'አንድ ሰው ሚስቱን እናት ፣ ማማ እያለ ቢጠራት ምን ችግር አለው?',




];

