

List<String> texts5 = [

'ፍች በንግግር ወይም በፅሁፍ ካለሆነ የሚፀና አይሆንም። እሷን ለመፍታት በቀልቡ '
'በመነየቱና ከራሱ ጋር እንደፈታት በማሰቡ ብቻ ፍቺው አይፀናም ፣ ምክንያቱም ነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) እንዲህ ብለዋልና:—\n\n '
'\" አላህ ለኔ ከኡመቴ እስካልተናገሩትና እስካልተገበሩት ድረስ ከራሳቸው ጋር ያወሩትን ' 
'(በቀልባቸው ያሰቡትን) ይቅር ብሎልኛል።\" በሲሒሕነቱ ተስማምተውበታል።',


'ሴት ልጅ ከባሏ ጋርም ይሁን አጂነቢ ከማይሆኗት ወንዶች ጋር በምትሰግድበት '
'ወቅት መሆን ያለባት ከኋላ እንጂ ከጎን (ቀኝም ሆነ ግራ) መሆን የለባትም። '
'በላጩ ይህ ቢሆንም ግን ከጎንም ብትሰግድ ሶላቷ ይበቃል። በዚህ ጊዜ በቀኝ በኩል ነው የምትሆነው። '
'በሚሰግዱበት ጊዜ የሚፈጠር የአካል_መነካካት አውቀውና አስበውበት እስካልሆነ '
'ድረስና በጨርቅ ጀርባ እስከሆነ ድረስ ሶላቱ ላይ የሚያመጣው ጉዳት የለም። \n\n'
'በመካከላቸው ለሚኖረው ክፍተት ደግሞ በሸሪዓችን ለወንድ የተደነገገ ነገር ሴትን '
'እንደማያካትትና ለወንድ ብቻ እንደሆነ እስካልተገለፀ ድረስ የወንድም የሴትም '
'አንድ ነው። እሱም ልክ ወንድ ከጎን ሲሆን እንደሚቀርበው ያክል ሴቷም የዛው አይነት ሁኔታ ነው የሚኖራት።',




'በመጀመሪያ ደረጃ በዚህ ዙሪያ ላይ በኡለሞች መካከል የተያየ አቋም ቢኖርም አመዛኙና በላጩ ግን ባል ሚስቱን '
'ሚስት ባሏን ቢነካኩ በስሜትም ይሁን ያለ ስሜት ውዱ አያስፈታም። ለዚህም በሀዲስ እንደመጣው '
'ነብዩ (ሶለሏሁ ኣለይሂ ወሰለም) ሚስቶቻቸውን ስመው ውዱእ ሳያደርጉ ሶላት የሰገዱባቸው አጋጣሚዎች እንዳሉ ተጠቅሷል። \n\n'

'በቁርአን ላይ አላህ በሱረቱ ኒሳእ ያለው \"...ወይም ሴትን ከነካችሁ '
'(ውዱእ አድርጉ)\" የሚለው አንቀፅ ደግሞ ኢብኑ አባስን ጨምሮ አብዛኛው '
'ኡለሞች ያሉትና ትክክለኛውም ትርጉም ከሴት ጋር ግንኙነት ካረጋችሁ እንጂ '
'በአካል ከተነካካችሁ ማለት እንዳለሆነ ተናግረዋል። ስለዚህ በባለትዳሮች መካከል የሚኖር የአካል መነካካት ውዱእ አያስፈታም።',




'አላህ ባሎችን በተለያዩ አጋጣሚዎች ሚስቶቻቸውን በሂጃብ እንዲያዟቸው ሚስቶችም ባሎቻቸውን '
'እንዲታዘዟቸው ትእዛዝ አስተላልፏል። ነገር ግን ይህ ሳይሆን ቀርቶ እርሷ በእምቢተኝነት '
'ከቀጠለች ባሏንም ባለመታዘዟም ሂጃብም ባለመልበሷ ድርድርብ ወንጀል ቢኖርባትም '
'አሁንም ቢሆን ሸሪዓው በፈቀደው መልኩ የተለያዩ ደረጃዎችን ይጠቀም። '
'እነሱም በመጀመሪያ ምንም ሳይሰለች በሚገባት ንግግርና በርህራሄ ይምከራት፣ '
'ከዛም እምቢ ካለች ያኩርፋት፣ አሁንም በዛው ለቀጠለች ትንሽ መታ ያርጋት፣ '
'አሁንም ከቀጠለች ለቤተሰቦቿ እንዲመክሯትና እንዲያስተካክሏት መልእክት ይላክ፣ ከዛም '
'ከቀጠለ ወጪ ይከልክላት ይህን ሁሉ አርጎ አሁንም እምቢ ካለችና በአመጷ ከቆየች ግን '
'የራሱ ምርጫ ነው አሁንም ቢሆን አበሮ መቂየቱ ተፅእኖ ይፈጥርና ልትስተካከል ትችል '
'ይሆናል ካለ አብረው ይቆዪ ካልሆነ ግን በዚህ ሁኔታ አብሮ መኖሩ ከባድ ነው።',




'በመጀመሪያ ደረጃ ሴት ልጅ ያለ መህረም (ማግባት የማትችላቸው የቅርብ ዘመዶች) ጋር '
'ካለሆነ በስተቀር ሩቅ ጉዞ መጓዝ አይፈቀድላትም። በቻለችው አቅም በዙሪያዋ ከሚገኙት '
'ወንዶች ከባሏ ጀምሮ አብሮ የሚወስዳት ቅርብ ዘመድ (ወንድም፣ አባት፣ ልጅ ...) '
'ሊኖር ይገባል። ይህ ሳይሆን ቀርቶ ብቻዋን ከሄደች ሀራም ተግባርን ፈፅማለች ማለት ነው። '
'ሲቀጥል ከመህረም ጋር አብራም ብትሄድ የባሏን ፍቃድ ማግኘት አለባት።'
'ገር ግን ከሄደች በኋላ ሀላል የሆነና ከወንዶች ጋር መቀላቀል የሌለበት ስራ '
'እስከሰራች ድረስ ያለ መህረም ሩቅ ሀገር መቆየቷ ችግር የለውም። የተከለከለው ያለ መህረም መጓዟ ነው።',





'የእህት ባል መህረም/ማግባት የማይቻል የቅርብ ዘመድ አይደለም። ለሚስቱ እህት '
'አጂነቢ ነው። ምክንያቱም ለጊዜው የሚስቱን እህት ማግባት ባይቻልለትም፣ ሚስቱን '
'ከፈታት ወይም ከሞተች የሷን እህት ማግባት ይፈቀድለታልና። ለዚህም ሲባል '
'ከሷ ጋር የሚኖረው ግንኙነት ልክ እንደማንኛውም አጂነቢ ወንድ ነው።',



'በመጀመሪያ ደረጃ ፍቺ በንግግር የሚፈፀም ተግባር ቢሆንም አንዳንዴ የባልዩው ኒያ '
'ከግምት ውስጥ ሊገባ ይገባል። እሱም አንቺ እንዳለሺው \"እኔና አንቺ ተፋተናል ማለት ይቻላል\" '
'ማለቱ አንዳንድ ኡለሞች እነ ሸህ ኢብኑ ባዝን ጨምሮ ግልፅ የሆነ የፍች ቃል ነውና ፍቺው '
'ይፀድቃል ያሉ አሉ ፣ ሌሎች ኡለሞች ደግሞ ይህ ቃል አሽሙር እንጂ ባልዩው ፍችን '
'መፈለጉን በቀጥታ የሚያመላክት ቃል አይደለምና ፍቺው አልፀደቀም ይላሉ። '
'ብቻ ግን በጥቅሉ የሁሉኑም ስንጨምቀው የባልዩው ኒያና ፍላጎት ነው የሚወስነው፣ ስለዚህ '
'መደረግ ያለበት ባልዩው ይህንን ስትል ምን ለማለት ፈልገህ ነው ተብሎ '
'ይጠየቃል፣ ማለትም ይህን ቃል ስትናገር ለመፍታት ፈልገህ ነበር ወይስ ዝም ብለህ ነው ይባላል፣ የዛኔ ያስታውቃል። '

'መፋታት አለብን፣ መሄድ አለብሽ ምናምን እነዚህም ዛቻና ግልፅ ያለሆነ '
'ንግግር ነው፣ ፍቺ ደግሞ በዛቻ አይፀናም፣ የግድ ግልፅ የሆነ አሻሚ ያልሆነ ንግግር መናገር አለበት።',







'ኡለማዎች የምትታጭ ሴትን ለመመልከት መስፈርቶችን አስቀምጠዋል። ከነዛም ውስጥ;–\n\n '

'የሚያጨው ሰው በማጨቱ ላይ ቁርጠኛ ሊሆን ይገባዋል፣\n'
'በሀሳቡ ተቀባይነትን ሊያመዝን ይገባዋል፣\n'
'ሲመለከት በኸልዋ (ብቻ ለብቻ) መሆን የለበትም‼️\n'
'እሷን ሲመለከት አላማው ለማረጋገጥ ያክል እንጂ በእይታ ለመርካት ሊሆን አይገባውም። \n'
'ፊት፣ እጅና ብዙውን ጊዜ ግልፅ የሚሆኑ አካላቶችን ብቻ ነው መመልከት ያለበት። \n'
'የምትታጨው ልጅ የተገላለጠችና ሽቶ የተቀባች መሆን የለባትም። \n'
'በመጀመሪያው ምልከታ የማይብቃቃ ከሆነ ሁለተኛ መድገም ይችላል። በመጀመሪያው ከተብቃቃ ግን ሁለተኛ ጊዜ ማየት አይቻልለትም። \n'
'በእጅ ሰላምታን መለዋወጥ፣ መንካትም ይሁን ብቻ ለብቻ መሆን አይቻልም, ምክንያቱም ኒካህ እስካላደረጉ ድረስ አጂነቢ ከመሆን አትወገድምና።\n'
'ሌላ ወንድሙ ያጫትን በጎን ማጨት አይቻልም, ምክንያቱም ነብያችን صلى الله عليه وسلم እንዲህ ስላሉ: \n\n'

'\"ያጫት ሰው ቀድሞ እስካልተወ ወይም #እስካልፈቀደለት ድረስ አንድ ሰው ወንድሙ ያጫት ላይ አይጭበት።\"\n\n'
'ቡኻሪ፣ 5146 '
' እና ሌሎችም አሉ።',








'ኡለማዎች የምትታጭ ሴትን ለመመልከት መስፈርቶችን አስቀምጠዋል። ከነዛም ውስጥ;– '

'የሚያጨው ሰው በማጨቱ ላይ ቁርጠኛ '
'      ሊሆን ይገባዋል፣ '
'በሀሳቡ ተቀባይነትን ሊያመዝን ይገባዋል፣ '
'ሲመለከት በኸልዋ (ብቻ ለብቻ) መሆን '
'      የለበትም‼️ '
'እሷን ሲመለከት አላማው ለማረጋገጥ ያክል '
'     እንጂ በእይታ ለመርካት ሊሆን አይገባውም። '
'ፊት፣ እጅና ብዙውን ጊዜ ግልፅ የሚሆኑ '
'      አካላቶችን ብቻ ነው መመልከት ያለበት። '
'የምትታጨው ልጅ የተገላለጠችና ሽቶ '
'      የተቀባች መሆን የለባትም። '
'በመጀመሪያው ምልከታ የማይብቃቃ ከሆነ '
'     ሁለተኛ መድገም ይችላል።በመጀመሪያው '
'     ከተብቃቃ ግን ሁለተኛ ጊዜ ማየት '
'     አይቻልለትም። '
'በእጅ ሰላምታን መለዋወጥ፣ መንካትም '
'      ይሁን ብቻ ለብቻ መሆን አይቻልም። '
'     ምክንያቱም ኒካህ እስካላደረጉ ድረስ '
'      አጂነቢ ከመሆን አትወገድምና። '
'ሌላ ወንድሙ ያጫትን #በጎን ማጨት '
'      አይቻልም። '
'ምክንያቱም ነብያችን صلى الله عليه وسلم እንዲህ ስላሉ: '

'\"ያጫት ሰው ቀድሞ እስካልተወ ወይም #እስካልፈቀደለት ድረስ አንድ ሰው ወንድሙ ያጫት ላይ አይጭበት።\" '
'ቡኻሪ፣ 5146 '
' እና ሌሎችም አሉ።',







'በሸሪዓችንም በእርግዝና ወቅት ግኑኝነትን የሚከለክል ቁርአናውም ሆነ '
'ሀዲሳዊ ጥቅስ የለም። ስለዚህ ፅንሱ ይጎዳል ተብሎ እስካልታሰበ ድረስ ግኑኝነት ማድረግ ይቻላል።',





'ወንድ ልጅ አጂነቢ የሚሆነው ስለሴት ማሰብ ፣ ስለ ሀፍረት ገላ '
'ማወቅ ሲጀመር ፣ ወደ ሴቶች አተኩሮ መመልከት ሲጀምርና ስለሴቶች '
'ማውራት ሲያበዛ የዚህን ጊዜ ደርሷል ማለት ነው ለሱ አጂነቢ '
'የሆነች ሴት እሱ ፊት መገለጥ አይፈቀድላትም። '
'ነገር ግን ይህ በእድሜ ብንቀይረው እንደየሰው ይላያያል፣ አንዳንዱ '
'ቶሎ ይበስላል፣ አንዳንዱ ደግሞ ይዘገያል። በሀገራችን ብዙዎቹ '
'ልጆች እዚህ ደረጃ የሚደርሱት ከ13 እስከ 15 ባለው እድሜ ክልል አካባቢ ነው። ',





'በመጀመሪያ አንዳንድ ዶክተሮች እንደሚሉት የወሊድ መቆጣጠሪያ ጉዳት አለው '
'የሚባለው ነገር እውነት_ከሆነ መጠቀሙ ሀራም ነው። ምክንያቱም በሸሪዓችን ጉዳት ያለውን ነገር መጠቀም አይፈቀድምና።'
'ነገር ግን ጉዳት ከሌለውና በጣም አስፈላጊና አስገዳጅ ሁኔታ ከተፈጠረ '
'ለምሳሌ እናት ታማሚ ከሆነች ፣ የምታጠባ ሁና ካረገዘች ጉዳት ያጋጥማታል '
'ተብሎ የሚሰጋ ከሆነ ፣ የተወለደው ልጅ እሷ በማርገዟ የሚጎዳ ከሆነ ፣ '
'ወይም እርግዝናዋን የሚጎዳ በሽታ ካለባትና እነዚህንም ነገራቶች ዶክተሮች ካረጋገጡ መቆጣጠሪያውን መጠቀም ይቻላል። '

'ከዛ ውጭ ግን ጥሩ ኑሮ ለመኖር ብላ ወይም ሪዝቅንና_ማሰደጊያውን ፈርታ ከሆነ መጠቀሙ በጭራሽ አይፈቀድም‼️',





'የተገደደው በምን መልኩ ነው። ለምሳሌ ግዴታነቱ ከባድ ከሆነ '
'ኒካሁ አይፈርስም። ይህም ማለት ሲያስገድዱት ይህን ባያደርግ እንደሚገሉት '
'ወይ እንደሚያስሩት ወይም ብቻ እሷን ባይፈታ በአካሉም ይሁን በንብረቱ '
'ላይ ከባድ ጉዳት እንደሚደርስበት እርግጠኛ ሆኖ ከሆነ ኒካሁ አልወረደም፣ አልተፋቱም። '
'ነገር ግን ቀለል ያለ መገደድ ከሆነ ማለትም ዝም በሎ ዛቻና እሷን ባይፈታ '
'ምንም የማይደርስበት አይነት መገደድ ከሆነ ይህ ፍቺው ተረጋግጧል ተፋተዋል። '
'ምክንያቱም ቀለል ያለ መገደድ በምርጫው እንዳደረገው ነው የሚቆጠረው።',





'ባል ሚስቱ ላይ ካሉት ሀቆችና መብቶች መካከል ወደ አልጋ ሲጠራት ምክንያታዊ ችግርና '
'ኡዝር ካላጋጠማት በስተቀር ልትታዘዘው ይገባል። ለዚህም ነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) '
'አቡ ሁረይራ ባወሩት ሀዲስ እንዲህ ብለዋል:— '

' \"ባል ሚስቱን ወደ አልጋ ጠርቷት እምቢ ካለች ሌሊቱ እስኪነጋ ድረስ መላኢካዎች ይረግሟታል።\" '
 'ቡኻሪና ሙስሊም ዘግበውታል '

'ስለዚህ ያለ ምንም ምክንያት እምቢ ማለቷ የባሏን ሀቅ ካለመወጣታም ጭምር '
'አላህን አስቆጥታለች፣ መላኢካዎችም ይረግሟታልና ከዚህ ድርጊቷ ልትቆጠብ ይገባል።',




'ባል ሚስቱን መፍታቱን ሚስቱ ፊት መናገርና ለሷ ማሳወቅ ግዴታም ሆነ መስፈርት አይደለም። '
'ሚስት ትወቅም አትወቅም መፍታቱ ከተረጋገጠ ፍቺው ተረጋግጧል። ባሏ እሷን መፍታቱን '
'ያወቀችው ሶስት ጊዜ ሀይድ አይታ ከጠራች በኃላ እንኳን ቢሆን ያው ኢዳዋ የሚጀምረው '
'እሱ ከፈታበት ቀን ጀምሮ እንጂ እሷ ከሰማችበት ቀን ጀምሮ ስላልሆነ ዒዳዋን ጨርሳለች ማለት ነው።',





'በእናትም በአባትም ይሁን በአንድኛው እህትማማች የሆኑትን በአንድ ጊዜም ይሁን '
'በተለያየ ጊዜ ማግባት አይፈቀድም። መጀመሪያ ያገባት ወይ ፈቷት ወይም '
'ከሞተች በኃላ ካልሆነ ማግባት አይፈቀድለትም። ለዚህኝ አላህ እንዲህ ይላል:— '

'\" ድሮ (ባለፈው ባገባችሁት) ካልሆነ በስተቀር ሁለት እህትማማቾችን በአንድ ላይ መሰብሰብ (ማግባት) አይፈቀድላችሁም።\" '
'ሱረቱ ኒሳእ ፣ 23',




'ባል ቃል ለመግባት ፈቃደኛ እስከሆነ ድረስ ይቻላል። አንዳንድ ኡለሞች ይህ ባል አላህ '
'የፈቀደለትን ነገር መከልከል ነው ቢሉም ግን ባልኮ በቃልኪዳኑ መስማማት ግዴታ '
'የለበትም። ከፈለገ አለመቀበል ይችላል ስለዚህ ሚስት ባሏ ሁለተኛ ሚስት እንዳያግባ '
'ቃል ማስገባት ትችላለች። ባልም ቃል ከገባ ቃሉን የመሙላት ግዴታ አለበት ፣ '
'አለያ ግን ባል ቃሉን ካላከበረ ሚስት ኒካሁን የማፍረስ መብት አላት።',





'ሚስት ባሏን ፍች መጠየቅ የምትችልባቸው ሁኔታዎች የሚከተሉት ናቸው:— \n\n'
'በድህነቱ ምክንያት ሚስቱንና ልጆቹን ማስተዳደር ካልቻለ ፣\n'
'በህይወት ይኑር ይሙት እስከማይታወቅ ድረስ ከሚስቱ ርቆ ሌላ ሀገር ከቆየ ፣\n'
'እሱን ከማግባቷ በፊት የማታውቀው የሆነ ተፈጥሮአዊ ነውር ካገኘችበት \n'
'ለምሳሌ ስንፈተ ወሲብ ፣\n'
'አካላዊ ጉዳትና ስሜታዊ ጉዳት (ያለ ምንም ምክንያት አብሮ መተኛትን መተው ፣ እሷንም ሆነ ቤተሰቦቿን መስደቡ)  እና ሌሎች ጉዳቶችን ካስከተለ ፣\n'
'እሷን ከመምከር እየራቀና በማኩረፍ የማያናግራት ከሆነ ፣\n'
'ባል ለጉዞ ወጥቶ ከስድስት ወር በላይ ከቆየና ሚስትም እሱ በመራቁ ምክንያት የምትጎዳ ከሆነች ፣\n'
'ልጆቿን ከማየት የሚከለክላት ከሆነች እና\n'
'ሚስቱን ከጠላትና የሚያርቃት ከሆነ\n\n'

'እነዚህ ምክንያቶች በመጀመሪያ ደረጃ በምክክርና በውይይት መፈታት '
'የማይችሉ ከሆነ ሚስት ከባሏ ፍች የመጠየቅ መብት አላት። '
'ወደ ጥያቄው ስንመለስ ባል ሌላ ሚስት ካንቺ በፊትም ይሁን '
'ካንቺ በኃላ ማግባቱም ሆነ አለመናገሩ ብቻ ፍችን ለመጠየቅ በቂ ምክንያት አይሆንም።',





'የልጆቹ ወላጆች (የባልም ሚስትም) ሙሉ ፈቃደኝነት እስካለ ድረስ '
'አስፈላጊ ይሁንም አይሁን ልጅን ከእናቱ ውጭ ካለች እናት ጡት '
'እንዲጠባ ማድረግ የሚፈቀድ ተግባር ነው። ለዚህም አላህ እንዲህ ይላል:— '

'\"ልጆቻችሁን ሌሎች እንዲያጠቡላችሁ ብትፈልጉም በእናንተ ላይ ችግር የለባችሁም።\" '
'ሱረቱል በቀራህ ፣ 233 ',




'በመጀምሪያ ደረጃ ሴት ልጅን ወልይ ሆኖ ኒካህ የማሳሰሩን ጉዳይ ሀላፊነት የሚወስደው መጀመሪያ '
'አባቷ ነው ከዛም ወደ ላይ አያቷ እያለ ይቀጥላል ፣ ይህ ካልተገኘ ደግሞ '
'ልጇ ነው ከዛም ወደ ታች የልጅ ልጇ እያለ ይቀጥላል። ከዛም በዚህ ከሌለ ደግሞ ቀጣይ ወንድሟ ነው። '

'ስለዚህ ከአባቷ ውክልና ካልተሰጠው በስተቀር አባት እያለ ልጅ ኒካህ ማድረግ አይችልም።',




'በመጀመሪያ ደረጃ እሱ እንዲሰልም ያለሽ ጉጉት በጣም የሚበረታታና '
'ማሻአሏህ ነው አላህ ይጨምርልሽ። በመቀጠል አንዲት ሙስሊም ሴት '
'ካፊር_ወንድን ቀድሞ ሰልሞ ካልሆነ በስተቀር ማግባት በጭራሽ አይፈቀድላትም። ለዚህም አላህ እንዲህ ይላል:— '

'\"ለሙሽሪኮች (አጋሪዎችን) በአላህ እስኪያምኑ ድረስ አትዳሩላቸው፣ ሙሽሪኩ ቢደንቃችሁም ሙእሚን ባሪያ በላጭ ነው።\"'
'ሱረቱል በቀራህ ፣ 221 '

'በመቀጠል እንደምታገቢው ቃል ስለገባሽለት አንቺን ከማግባቱ በፊት '
'ቀድሞ የሚሰልም ከሆነና አንቺም ለሱ መስለም ምክንያት መሆንሽ በጣም የሚበረታታና '
'በላጭ ተግባር ነው።ከዛ በፊት ግን የሚሰልመው አንቺን ለማግባት '
'ብሎ ነው ወይስ በኢስላም ተማርኮ የሚለው መጣራቱ በላጭ ነው። '
'ምክንያቱም አንዳንድ ካፊር_ወንዶች ከገባሽኝ እሰልማለሁ እያሉ ብዙ ሴቶችን '
'በመቅጠፍ ሂወታቸውን ያበላሹ እንደነበረ ይታወቃልና ካገባሽ በኃላ ሌላ '
'ችግር እንዳይፈጠር የተለያዩ መፈተኛ ነገራቶችን በመጠቀም መስለሙ ካንቺ ጋር '
'ለምን እንደተያያዘና ለምን ካገባሽ በኃላ መስለም እንደፈለገ ሊጣራ ይገባዋል።',




'በአባት ስም መጠራት እና ወደ እርሱ ራስን በስያሜ ማስጠጋት ግዴታ ነው። ለዚህም አላህ እንዲህ ይላል:— '

'\"ወደ አባቶቻቸው (አስጠግታችሁ) ጥሯቸው ፣ ይህ አላህ ዘንድ ትክክለኛው ነው።\" ሱረቱል አህዛብ ፣ 5 '
'ከአባት ውጭ ባለ አካል የፈለገ ቢያሳድግ የአባትነትን ስያሜ መተካት አይችልም። '
'ወደ እርሱም ራስን አስጠግቶ መሰየምና መጠራት ዘርምን ከማዛባትም '
'በተጨማሪ በሀዲስ እንደመጣው የአላህ እርግማን ያለበት የተከለከለ ተግባር ነው። '

'\"አንድ ሰው እያወቀ ከአባቱ ስም ውጭ ቢጠራ ይከፍራል።\" '
'ቡኻሪና (3508) ሙስሊም (61) ዘግበውታል',




'እንደተባለው የተፋቱት ፆታዊ ግኑኝነት ከማድረጋቸውና በአካልም ሳይገናኙ '
'በፊት ከሆነ የመህሩ ግማሽ ለሚስት ነው የሚሰጠው ፣ ግማሹ ደግሞ ለባል። '
'ነገር ግን በላጩ ከሁለቱ አንዱ ግማሹን አውፍ ቢል ይወደዳል። ወይ '
'ባል አውፍ ብሎ ሙሉውን ቢሰጣት ፣ ወይም ሚስት አውፍ ብላ ሙሉውን ብተውለት የተወደደ ነው። '
'ከዚህም በተጨማሪ እንደሌላዋ የተፈታች ሴት ኢዳ አትቆጥርም ። '
'ቀጥታ ሌላ ማግባት ትችላለች። ነገር ግን ከመፋታታቸው በፊት ግኑኝነት አርገው ቢሆን ኖሮ  ሙሉው መህር ትወስድ ነበር።',




'በኒካህ ወይም በማጨት ወቅት ቀለበት ማድረግ ከካፊሮች የመጣ ተግባርና እነሱ '
'የሚታወቁበት ስለሆነ በሸሪዓችን በጣም ብናቀለው የተጠላ አለያ የተከለከለ ተግባር ነው። '
'በተለይ ይህ ቀለበት እስካልወለቀ ድረስ ፍቅርን ያጠነክራል ልዩነት አይኖርም ተብሎ '
'የሚታሰብ ከሆነ ደግሞ ሽርክ ነውና የሚሆነው ወደ ሽርክ ከሚያመሩ መንገዶችም አንዱ ሊሆን ይችላልና የተከለከለ ይሆናል።',





'ፍችን በፅሁፍ መግለፅ የሚቻለው በሁለት መልኩ ነው። እነሱም:— '
'1 ማነጋገር የማይችል ዲዳ የሆነ ሰው ከሆነ ፣ '
'2 ፍችን አስቦበት የፃፈው ከሆነ ብቻ ነው። '

'ምክንያቱም ፍችን ሳያስብበት ዝም ብሎ በስልኩ እየተጫወተ እያለ ወይም በስልኩ '
'ሌላ ነገር እፅፋለሁ እያለ ሳያስበው ሊፅፈው ይችላልና ይህን መልእክት ሲልክ በምን_መልኩ '
'እንደሆነ ይጠየቃል። ለምሳሌ ይህን ፅሁፍ ሲልክ በሰአቱ ፍችን አስቦበት ነው ወይስ '
'አይደለም የሚለውን ከተጠየቀ በኃላ ነው ፍርድ የሚሰጠው።',




'በዚህ መልኩ ሚስቱን ሲጠራ ለማቆላመጥና ለመቀለድ ብሎ ከሆነ ችግር የለውም። '
'ነገር ግን እያመረረ እና እየተቆጣ ከሆነ ይህን ያለው ወደ ሌላ ሊወስድበት ይችላልና አይፈቀድም።',

//part two

'አቂቃ ሲጀመር ሱና እንጅ ግዴታ አይደለም። ሲቀጥል በብር ቀይሮ መስጠት አያብቃቃም። '
'በሀዲስ የመጣው ማረድ ነው። ኡለሞችም ሱና ስለሆነ ወደ  ብር መቀየር አይቻልም ይላሉ።' 
'ምክንያቱም አቂቃ አላማው እርድ በማረድ ወደ አላህ መቃረብ ነውና በብር ሊተካ አይችልም።',



'ለኢማምነት ብቁ እስከሆነ ድረስ በዚና (ዝሙት) የተወለደ ልጅን ኢማም '
'ማድረግና ከኃላው መስገድ እንደማይቻል ምንም ማስረጃ ስላልመጣ ሶላቱ '
'አንደማንኛውም ኢማም ትክክል ነው። ባይሆን አንዳንድ ኡለሞች እሱ ኢማም '
'በመሆኑ በሰዎች መካከል ቅሬታን የሚያስነሳ ፣ የሚያስደብራቸውና ጭቅጭቅ '
'መነሻ ከሆነ ሌላ በዲኑ ኢስቲቃማና ጥንካሬ ያለው ሰው ቢያሰግድ በላጭ ነው ይላሉ። '
'በጥቅሉ ግን በሀዲስ እንደመጣው ማንኛውም ለኢማምነት ብቁ የሆነ ሰው '
'ከዝሙት ይወለድም አይወለድም ማሰገድ ይችላል። በዛ ላይ ይህ ሰው '
'ወላጆቹ በሰሩትና እሱ ባልሰራው ወንጀል ምክንያት ሊንቋሸሽና ከማህበረሰቡ ሊራቅ አይገባውም።' 
'ለዚህም አላህ በቁርአኑ እንዲህ ይላል:— '
'\"ወንጀል ተሸካሚ የሌላን ወንጀል አትሸከምም።'
'ሱረቱል ፋጢር ፣ 18',



'ባሏ የሞተባት ሴት አራት ወር ከ10 ቀኑ እስኪያልቅ ድረስ አምስት ነገር ማድረግ አይፈቀድላትም:—'

'1 ባሏ ከሞተበት ቤት መውጣት አትችልም፣'
'2 የመዋቢያ ልብሶቸን መልበስ አይፈቀድላትም፣'
'3 ወርቅ ፣ብርና ሌሎች የመዋቢያ ጌጦችን መጠቀም አትችልም፣'
'4 ሽቶም መቀባት አትችልም ፣'
'5 እና ኩልም መቀባት  አይፈቀድላትም።',



'ማስተርቤሽን (ሴጋ) ወይም ራስን በራስ ማርካት በሸሪዓችን የተከለከለና የተወገዘ ተግባር ለመሆኑ' 
'በርካታ ኡለሞች በየአጋጣሚው ይናገራሉ። ለዚህ አቋማቸውም ይህን የአላህ ንግግር እንደመረጃ ይጠቀማሉ ፣ '

'\" እነዚያ (ሙእሚኖች) ብልቶቻቸውን ጠባቂዎች የሆኑት ናቸው ፣ በሚስቶቻቸው ወይም በባሪያዎቻቸው ላይ '
'ሲቀር እነሱ የማይወቀሱ ናቸው። ከዚህ ውጭ ሌላን የፈለጉ ሰዎች እነዚያ ወሰን አላፊዎች ናቸው።\"'
'ሱረቱል ሙእሚኒን ፣ 5 - 7'

'ይህ የቁርአን አንቀፅ ከሚስቶች ውጭ ባለ ነገር ስሜትን መወጣትና ራስን '
'ማርካት የሙእሚኖች ባህሪ እንዳልሆነና ይህንን የሚያደርግ ደግሞ የሚወቀስ '
'መሆኑን ያመለክተናል። ከዚህም በተጨማሪም በጤንነት እና በሰውነት አካል ላይ '
'የጎንዬሽ ጉዳት እንዳለው የዘርፉ ባለሙያ የሆኑ ዶክተሮችም ይናገራሉ።',




'ሴት ልጅ አንድ ዲኑን ፣ ስነምግባሩን ፣ እውቀቱን የወደድችለትን ወንድ ለትዳር' 
'እንደምትፈልገውና ብታገባው ፍላጎቷ እንደሆነ መግለፅ ትችላለች።'

'ለዚህም ቡኻሪ (4828) ላይ እንደተዘገበው አንድ ጊዜ አንዲት ሴት ራሷ ልታገባቸው እንደምትፈልግና' 
'ራሷን ለነብዩ ሶለሏሁ_አለይሂ_ወሰለም ለማቅረብ መጣችና: \"ትፈልገኛለህን?\"' 
'ብላ መጠየቋና ነብዩም መጠየቋን አለማጥላላታቸው የሚፈቀድ መሆኑን ያመለክተናል።\n\n'

'ነገር ግን አብዛኛው ኡለሞች እንደሚናገሩት እርሷ ቀጥታ በአካል ሂዳም ይሁን በስልክ ደውላ ሀሳቧን '
'ከምትገልፅ ይልቅ ፊትናን ከመከላከል እንፃርና ብዙ ወንዶችም ከሴቶች ይህ '
'ጥያቄ ሲመጣ የመኩራትና_የማጉላላት ስሜት ስለሚያሳዩ በላጩ በቤተሰቦቿ በኩል እንዲገለፅ ማድረጓ ነው።'

'በተጨማሪም ጥያቄውን ካቀረበች በኃላ መልሱ እሽታ ከሆነ ቀጥታ ወደ ኒካህ '
'መሄድ እንጅ መደዋወልና ሌላ ግኑኝነት መፍጠት ተገቢ አይደለም። መልሱ እምቢ '
'ከሆነ ደግሞ ቀጥታ ያለውን ግኑኝነት ማቋረጥ እንጅ እሱን በማሰብና_በመለመን' 
'ጊዜዋን መፍጀትና ወደ ሀራም ነገራቶች የሚያስኬደውን መንገድ ማመቻቸት የለባትም።',




'በሸሪዓችን የሚስት ፍቃደኝነት እስካለ ድረስ በግኑኝነት ወቅት የዘር ፈሳሽን '
'ውጭ ላይ ማፍሰስም ሆነ ኮንዶም መጠቀም የሚጠላ ተግባር '
'ከመሆኑ ጋር ግን ይፈቀዳል። ለዚህም ጃቢር ኢብኑ አብደሏህ እንዲህ ይላሉ:' 

'\"በነብዩ (ሶለሏሁ አለይሂ ወሰለም) ዘመን (የዘር ፈሳሽን) ውጭ '
'ላይ እናፈስ ነበርና ይህ ጉዳይ ነብዩን ደርሷቸው ነበር ነገር ግን አልከለከሉንም።\"'
'ቡኻሪና (250) ሙስሊም (160) ዘግበውታል\n\n'

'ነገር ግን ከላይ እንደተጠቀሰው የሚጠላ ተግባር ለመሆኑ ደግሞ ነብዩ (ሶለሏሁ አለይሂ ወሰለም)' 
'አንድ ጊዜ የዘር ፈሳሽን ውጭ ላይ ስለማፍሰስ ሲጠየቁ "ይህ ድብቁ ልጅን ከነ ህይወት መቅበር ነው።\" ብለዋል።'
'ሙስሊም ዘግበውታል (1442)'

'በጥቅሉ በላጩ ማንኛውም ሙስሊም ሚስቱ እርግዝናን ለመሸከም' 
'የሚያስቸግራት አይነት በሽታ ካለባትና ብታረግዝ ትጎዳለች ተብሎ የሚታሰብ እስካልሆነ ድረስ ይህን ከማድረግ መቆጠብ ይኖርበታል።',





'በሸሪዓችን የአክስትና የአጎት ልጅ አጂነቢ ስለሆኑ እነሱን ማግባት ይፈቀዳል። ለዚህም አሏህ እንዲህ ይላል:—'

'\"... እነዚያንም ከአንተ ጋር የተሰደዱትን የአጎትህን ሴቶች ልጆች ... ፈቅደንልሀል።\"'
'ሱረቱል አህዛብ ፣ 50',




'ከዝሙትም ይሁን ያለ ዝሙት ያረገዘች ሴትን ከፅንሱ ሳትፀዳና ሳትወልድ ማግባት የተከለከለ ነው።' 
'ለዚህም አሏህ እንዲህ ይላል: "የእርግዝና ባለቤቶችም ጊዜያቸው እርጉዛቸውን መውለድ ነው።\"'
'ሱረቱ ጦላቅ ፣ 04'
'ነብዩም ሶለሏሁ አለይሂ ወሰለም በሀዲሳቸው እንዲህ ብለዋል: \"በአሏህና '
'በመጨረሻው ቀን የሚያምን ሰው ውሀውን (የዘር ፈሳሹን) ለሌላው አትክልት አያጠጣ።\"'
'አቡ ዳውድ ዘግበውታል (2158)'

'ይህም ማለት ማንኛዋም እርጉዝ ሴት ያረገዘቸው ከፈታቸው ባሏም ይሁን ከሞተባት ባል ወይም' 
'ከዝሙትም ይሁን አሁን ከምታገባው ሰው ጋር ዝሙት ሰርታም ይሁን እርግዝናዋን እስክትፀዳ'
'ድረስ ማንንም ማግባት አይፈቀድላትም። ምክንያቱም በሀዲሱ በግልፅ እንደመጣው '
'የሌላ ሰው የዘር ፈሳሽ አዲስ ከምታገባው ሰው ጋር ሊቀላቀል ወይም የዝሙት ፅንስ ከሀላል ፅንስ ጋር ሊቀላቀል አይገባውምና።',



'በመጀመሪያ ማክበር ሲባል ግዴታ ፕሮግራም ማዘጋጀት ብቻ አይደለም። '
'ያንን ቀን በስጦታም ይሁን በማንኛውም ነገር በሌላ ቀን በማይደረግ ነገር ቀኑን መለየትና ትኩረት መስጠትም ጭምር ነው።'
'ታዲያ በሸሪአችን እንደሚታወቀው እንኳን ባለትዳሮች የተጋቡበትን ቀን '
'ይቅርና ከሰው ልጆች በአጠቃላይ በላጭ የሆኑት ነብያችን ሶለሏሁ አለይሂ '
'ወሰለም እንኳን ወደ ምድር የመጡበትን ቀን (መውሊድ) ማክበር የማይፈቀድና በሸሪዓችን '
'መሰረት የሌለው ቢድዓ ተግባር መሆኑ ግልፅ ነው። ይህ የባለትዳሮች የተጋቡበትን ቀን' 
'ማስታወሺያ ፕሮግራም ደግሞ የከሀዲያን ተግባር ነውና ከነሱ ጋር መመሳሰል ስለሚሆን የሚከለከል ተግባር ነው።',




'ምንም ያክል ፎቶ_ሀራም ቢሆንም ማጨት የሚፈልግ ወንድም ሆነ ሴት የሚያጩትን ሰው '
'በአካል በማግኘት ፊቱንና_እጁን እንዲሁም ብዙ ጉዜ የሚታየውን የሰውነት አካል ማየት ይችላሉ። '
'ነገር ግን በአካል መገናኘት ባይችሉና መልካቸውን መተያየት አስፈላጊ ሆኖ ከተገኘና '
'የሚከተሉት መስፈርቶች ከተሟሉ ፎቶዋን መላክ ትችላለች ፣ እሱም እንደዛው: እነሱም:\n\n'
 
'1: የምትልክለት ሰው መልካን ካየ በኃላ ከተመቸቺው ለማግባት ቁርጠኛ የሆነ አቋም ያለው እንጅ ዝም ብሎ '
'ያቺንም_ያቺንም የሚያማርጥ መሆን የለበትም። ይህን ማረጋገጥ አለባት። እንዲሁ '
'ለጠየቃት ሁሉ መስጠት የለባትም። እሷን ለማግባት ቁርጠኛ አቋም ያለው መሆን አለበት።\n\n'

'2: የምትልክለት ፎቶ ከፊቷና ከእጇ እንዲሁም በአብዛህኛው ግልፅ ከሚሆነው ሰውነት አካሏ '
'ውጭ ያለውን ሰውነታን የሚያሳይ ፎቶ መሆን የለበትም።\n\n'

'3: ሰውዬውም ታማኝ ሰው መሆን አለበት። አለበለዚያ ፎቶውን ከላከችለት በኃላ ለሌላ ሰው '
'ሊያሰራጨውና በሷ ፎቶ ስምም መጥፎ ነገር ሊሰራበት ይችላልና ለመጥፎ ነገር እንደማይጠቀመው እርግጠኛ መሆን ያስፈልጋል።\n\n'

'4: ፎቶውንም እሱ ብቻ እንጅ ሌላ አጂነቢ እንደማያየው መረጋገጥ አለበት። ካየው በኃላም '
'ሊያጠፋው ይገባል። እሱ ጋር መቀመጥ የለበትም። ምክንያቱም አንዲትን አጂነቢ ከአንድ ጊዜ' 
'በላይ አስፈላጊ ከሆነም ከሁለት ጊዜ በላይ መመልከት ስለማይችል። ስለዚህ እነዚህ ካለይ ያሉት መስፈርቶች ካልተሟሉ በስተቀር ፎቶን መላላክ አይፈቀድም።',





'አዎ ይችላል። ከአጎቱ በበለጠ ለርሱ ቅርብ የሆነው የወንድሙን ሚስት ከተፈታች በኃላ ማግባት '
'እንደሚፈቀድለት ሁሉ የአጎቱንም ሚስት ከተፈታች በኃላ የማግባት መብት አለው። '
'በጥቅሉ በአጎቱ ሚስትና በእርሱ መካከል በስጋም ይሁን በጥቢ ዝምድናና ቅርበት ከሌለ ችግር የለውም። '
'ለዚህም ደግሞ እርሷን ማግባት እንደማይፈቀድለትና መህረም መሆኗን የሚያመለክት ማስረጃ አለመኖሩ ራሱ መረጃ ነው።',




'ጥርት ያለ ተውበት ሁለቱም ካደረጉ በኃላ እና እርጉዝ አለመሆኗ በአንድ የወር አበባ መምጣት' 
'ከተረጋገጠ በኃላ እንዲሁም አርግዛ ከነበረ ደግሞ ከወለደች በኃላ ኒካህ ማሰር ይችላሉ። '
'ይህም የሆነበት ምክንያት የዝመት ፅንስ ከሀላል ፅንስ ጋር እንዳይቀላቀልና ለመለየትም እንዳያስቸግር ዘንዳ ነው።'

'ለዚህም አሏህ በቁርአኑ በሱረቱ ኒሳእ አንቀፅ 24 ላይ አንድ ወንድ ከሴቶች መካከል ሊያገባቸው የማይፈዱለትን' 
'ሴቶች ሲዘረዝር አብሮ #ዝሙት የሰራትን ሴት አለመጥቀሱና ከዛም በኃላ ባለው ንግግሩ ላይ '
'ከነዚህ ውጭ ያሉትን ማግባት #እንደሚፈቀድለት መጥቀሱ የሚቻል መሆኑን ያመለክታል።',




'በዚህ ጉዳይ ላይ አንዳንድ ሰዎች የሚስቱን እህት ማግባት ስለማይችል አጂነቢ እንዳልሆነች የሚያስቡ አሉ። '
'ይህ ግን ትክክል አይደለም። የሚስቱ እህትን ሚስቱ ከሱ ጋር እስካለች ድረስ ማግባት ነው እንጅ '
'የተከለከለው አጂነቢ ከመሆን አትወገድም። እሷንም መመለክትም ሆነ መጨበጥም በአንድ ቦታ ብቻ ለብቻም መሆን አይፈቀድለትም።',





'ፆታዊ ግኑኝነት ሳያደርጉ በፊት መፋታት ሁለት አይነት መልክ አለው። እሱም:\n\n'
'1: አንደኛው በመካከላቸው በአካልም ሳይገናኙ በፊት ከሆነ ፍቺው የተከሰተው በእሷ ላይ ዒዳ መቁጠር የለባትን። '
'እንዲሁም የመህሩን ግማሽ ትወስዳለች። ሌላም ባል ቀጥታ ማግባት ትችላለች።'
'ባሏም አዲስ በሆነ መህርና ኒካህ እንጅ ዝም ብሎ መመለስ አይችልም። ምክንያቱም አጂነቢ ሁናለችና።\n\n'

'2: ሁለተኛው ሁኔታ ደግሞ ፆታዊ ግኑኝነት ከማድረጋቸው በፊት ፍቺው ተከስቶ ነገር ግን '
'በመካከላቸው ይህን ግኑኝነት መፈፀም በሚያስችላቸው መልኩ ብቻ ለብቻ ሁነው ከነበረ' 
'ግን በእርሷ ላይ ኢዳ መቁጠር ሲኖርባት መህሩም ሙሉ በሙሉ የሷ ሀቅ ነው። ነገር ግን '
'ባሏ እሷን በመመለሱ ዙሪያ ላይ ግን ከላይ እንደተጠቀሰው አዲስ በሆነ መህርና ኒካህ እንጅ ዝም ብሎ መመለስ አይችልም።\n\n'

'ከላይ ለተጠቀሱት ነጥቦች ሁሉ ማስረጃዎቹም የሚከተሉት ናቸው:\n'
'\"እናንተ ያመናችሁ ሆይ ምእመናትን ባገባችሁና ከዚያም ሳትነኳቸው_በፊት በፈታችኃቸው ጊዜ '
'ለእናንተ በነሱ ላይ የምትቆጥሩት ዒዳ_ምንም የለባቸውም። ሱረቱል አህዛብ ፣ 49'
'\"ሴቶችን ሳትነኳቸው (ሳትገናኙ) ወይም ለነሱ መህርን ሳትወስኑላቸው ብትፈቷቸው በናንተ '
'ላይ ሀጢአት የለባችሁም ፣ (ዳረጎት በመስጠት መፍታት ትችላላችሁ)።\"ሱረቱል በቀራህ ፣ 236'
'\" ለነርሱም መወሰንን በእርግጥም የወሰናችሁላቸው ስትሆኑ ሳትነኳቸው በፊት ብትፈቷቸው '
'ካልማሯችሁ ወይም የጋብቻ ውል በእጁ የኾነው (ባልዬው) ካልማረ በስተቀር የወሰናችሁትን '
'ግማሹ አላቸው። ምህረትም ማድረጋችሁ ወደ አሏህ ፍራቻ በጣም የቀረበ ነው። ሱረቱል በቀራህ ፣ 237\n\n'


'ዒዳ መቁጠር ማለት ማህፀኗ ከፅንስ የፀዳ መሆኑን በማረጋገጧ ሌላ ባል ለማግባት እንድትችል '
'የሚያደርጉ ቀናት ያክል መቆየትና መጠበቅ ማለት ነው። '
'እነዚህም ቀናት ሀይድ ለሚያዩ 3 ጊዜ ሀይድ ማየት ሲሆን ሀይድ ለማያዩ ሴቶች ደግሞ 3 ወር ነው።',





'ይህ ጉዳይ በተራው ሙስሊም ማህበረሰብ ዘንድ ብዙ ጊዜ የሚመላለስ ጥያቄ ነው። '
'ብዙዎቹ በእርግዝና ወቅት ፍች አይወድቅም የሚል አስተሳሰብ አላቸው። ነገር ግን '
'ይህ አመለካከት በየትኛውም መልኩ በሸሪዓችን መሰረት የለውም። ከኡለሞችም ይህን ያለ አንድም አሊም የለም።' 

'እንደውም አንዲት እርጉዝ የሆነች ሴት በእርግዝናዋ ወቅት ብትፈታ ፍችው ትክክል ለመሆኑ '
'ኡለሞች በአጠቃላይ ተስማምተዋል። ነገር ግን በእርግዝናዋ የተፈታች ሴት እንደሌላዋ ሴት' 
'ሶስት ሀይድ ቆጥራ ሳይሆን ኢድዳዋ የሚያልቀው በመውለዷ ነው። ለዚህም አሏህ እንዲህ ይላል:— '
'\"የእርግዝና ባለቤቶችም (የኢዳ) ጊዜያቸው እርግዘናቸውን መውለዳቸው ነው።\"' 
'ሱረቱ ጦላቅ ፣ 4',





'በመጀመሪያ ደረጃ የዝሙት_ልጅ ወላጆቹ በሰሩት ወንጀል ምክንያት ቅንጣት የማይጠየቅና ሊጎዳ '
'የማይገባው ነውና እንደማንኛውም ሙስሊም መብት ያለው በመሆኑ የዝሙትን ልጅ በሌላ' 
'አመለካከት ማየት ተገቢ ካለመሆኑም በላይ የተከለከለ ነው።\n\n'

'ከዝሙት የሚወለደው ልጅ እናቱ ከሁለት አንድኛው እንጅ ሌላ ልትሆን አትችልም። እነሱም ወይ ባል_እያላት' 
'ሌላ ሰው ጋር ዝሙት የሰራች ወይም ባል_ሳይኖራት በዝሙት ልጅ ይዛ የመጣች ናት። በሁለቱም መልኩ '
'የሚወለድ ልጅ ምን አይነት ሸሪዓዊ ፍርድ ሊኖረው እንደሚችል ኡለሞች እንደሚከተለው አስቀምጠዋል:—\n\n'

'1: አንደኛው አግብታ ባል እያላት ከሱ ውጭ ሌላ ሰው ጋር ዝሙት የሰራች ከሆነች ከባሏ ውጭ '
'የወለደችው መሆኑን እርግጠኛ ብትሆንና ብትናገርም እሷ የምታመጣው ማንኛውም ልጅ በባሏ ስም '
'እንጅ በሌላ ሰው ስም አይጠራም። ነገር ግን ባልዬው ይህ ልጅ የኔ አይደለም ብሎ ቃዲ ዘንድ' 
'በሚስት ላይ የሚምል ከሆነ ግን ልጁ ወደ እናቱ ይጠጋና በእናቱ ስም ይጠራል እንጅ ዝሙት ወደ ሰራው ሰውዬ ተጠግቶ በሱ ስም አይጠራም።\n\n'

'2 ሁለተኛው: እናቲቱ ባል ሳይኖራት የወለደችው ልጅ ከሆነ ደግሞ በዚህ ላይ በኡለሞች መካከል '
'ልዪነት ቢኖርም በላጩና ከመረጃም አንፃር የተሻለው አቋም ግን የዝሙት ልጅ ወደ እናቱ ተጠግቶ '
'በእሷ ስም እንጅ የሚጠራው ዚና የሰራው ወንድዬው ራሱ ቢታወቅም በሱ ስም አይጠጋም።' 
'ለዚህና ለመጀመሪያዋ ሴትም ማስረጃው ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ማለታቸው '
'ነው \"ልጅ የባለ ፍራሹ (የባል) ነው ፣ ዝሙት የሰራው ወንድ ግን ልጅ የለውም።\"' 
'ቡኻሪና (2053) ሙስሊም (1457) ዘግበውታል',



'በመጀመሪያ ደረጃ እንደ አብዛህኛው ኡለሞች ዘንድ መህር ብሎ ማለት ለሴቲቷ ጥቅምን የሰጠና '
'በዋጋ መተመን የሚችል መሆን አለበት። ማለትም ይህ መህር ገንዘብም ይሁን እቃም ይሁን '
'ተግባርም ይሁን ብቻ ለሷ ጥቅም የሚያስገኝላትና ይህ ተግባርም ይሁን እቃ ትንሽም ቢሆን በገንዘብ መተመን የሚችል መሆን ይኖርበታል።\n\n'

'ስለዚህ ከዚህ የኡለሞች አተረጓጎም በመነሳት በጥያቄው ላይ በተጠቀሰው መልኩ መህር ማድረግ እንደማይቻል መረዳት ይቻላል።' 
'ምክንያቱም አንደኛ እሱ ቁርአንን መሀፈዙ ጥቅሙ ለራሱ እንጅ ለሷ ይሄ ነው የሚባል ግልፅ የሆነ ጥቅም የለውም።' 
'ሁለተኛ ደግሞ በዋጋም መተመን የማይችል ነውና ይህን መህር ማድረጉ ትክክል አይደለም። ባይሆን ትንሽ '
'እንኳን ቢሆን የተወሰነ የገንዘብ መጠንን መህር አድርጎ እሱ መሀፈዙን እንደተጨማሪ ማድረግ ይቻላል።\n\n'

'ነገር ግን ከዚህ ይልቅ ለሷ ቁርአንን ሙሉውንም ሆነ ከፊሉን ሊያስሀፍዛትም ሆነ '
'ሊያቀራት ተብሎ መህረ  ቢደረግ የተሻለ ነው። ምክንያቱም ይህ ማድረጉ አንደኛ '
'ለሷም ጥቅም አለው ሲቀጥል እሷን ለማቅራት ሲባል በዋጋ መተመን የሚችል የሆነ ወቅቱንና ጊዜውን ይሰጣታል።\n\n'

'ከዚህ ጋር ተያይዞ ኡሙ ሰለማ አቡ ጦልሀን መስለሙን እንደመህር መቁጠሯ የሚጠቅሰውን ሀዲስ①' 
'በተመለከተ ምንም ያክል ሀዲሱ ላይ ባይጠቀስም አንደኛ ከመስለሙ ጋር በተጨማሪ የተወሰነ '
'ገንዘብ መስጠቱን በርካታ ኡለሞች ይገልፃሉ። አለመጠቀሱም ይህ ነገር የታወቀ በመሆኑ ነው። '
'ሁለተኛም ይህ ክስተት የሆነው በመህር ጉዳይ ላይ የሚያወራው '
'የቁርአን አንቀፅ ከመውረዱና ከመደንገጉ በፊት ነውና በዚህ ሀዲስ ማስረጃ ማድረግ አይቻልም።',




];


List<String> appTitless5 = [


  'ሚስቱን በቃል ሳይናገር በቀልቡ (በሀሳቡ) ቢፈታት',


  'የሚስት እና የባል አሰጋገድ',


  'ባልናሚስት ቢነካኩ ኡዱ ይፈታሉ',


  'ሚስቴ ሒጃብ አለብስም አለችኝ',


  'ሚስት ብቻዋን ሩቅ ሀገር ለስራ መሄዷ',



  'የእህት ባል አጂነቢ ነውን',


  'እኔና አንቺ ተፋተናል ማለት ይቻላል',


  'ሚስትን ለማጨት ብሎ መመልከት',



  'ሚስትን ለማጨት ብሎ መመልከት',



  'በእርግዝና ወቅት ግኑኝነት ማድረግ',


  'የወንድ ልጅ የአጂነቢነት እድሜ መጀመሪያ',



  'የወሊድ መቆጣጠሪያ መጠቀም',



  'ሚስትን በፍርድ ቤት ተገዶ መፍታት',



  'ባሏ ለግኑኝነት ሲጠራት እምቢ ማለቷ',



  'ፈታሁሽ ሲለኝ አልሰማሁትም',



  'እህትማማቾችን አንድ ላይ ማግባት',



  'ባል 2ኛ ሚስት እንዳያገባ ቃል ማስገባት',



  'ባሏን ፍታኝ ማለት የምትችልባቸው ሁኔታ',



  'ለመዛመድ ተብሎ ሌላ ልጅ ማጥባት',




  'ልጅ ለእናቱ ወልይ ሆኖ ኒካህ ማሳሰሩ',



  'ካገባሽኝ እሰልማለሁ አለኝ',



  'ከአባት ውጭ ባለ አካል መጠራት',



  'ከፆታዊ ግኑኝነት በፊት ፍች ቢከሰት',



  'የቀለበት ፕሮግራም',



  'ፍችን በፅሁፍና በሜሴጅ መግለፅ',



  'ሚስትን ማማ ፣ እናት ብሎ መጥራት',
// part two

  'አቂቃ በገንዘብ ቀይሮ መስጠት',


  'የዝሙት ልጅ ኢማምነት',



  'ባሏ የሞተባት ምንድን ነው የምታደርገው',



  'ማስተርቤሽን (ሴጋ) በኢስላም',



  'ሴት ወንድን ለትዳር መጠየቋ',


  'ኮንዶም መጠቀም',



  'የአክስትን ልጅ ማግባት',




  'በእርግዝና ወቅት ኒካህ ማድረግ',




  'የሰርግን ቀን ማስታወሻ ዝግጅት',




  'ለመተጫጨት ፎቶ መላላክ',



  'የአጎት ሚስትን ማግባት',



  'ዝሙት የፈፀሙ ሰዎች መጋባት',



  'የሚስት እህት አጂነቢ ናትን',



  'ከፆታዊ ግኑኝነት በፊት መፋታት',



  'በእርግዝና ወቅት መፈታት',



  'የዝሙት ልጅ በአባቱ ስም ይጠራልን',



  'ቁርአን ሒፍዝን መህር ማድረግ',



  



];



List<String> sources5 = [



  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ',


  'ሸይኽ ኢብኑ ባዝ ረሂመሁሏህ',



  'ሸይኽ ኢብን ባዝ ረሂመሁሏህ',



  'ኢብኑ ዑሰይሚን',



  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',




  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም ',


  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',



  'ኢብኑ ኡሰይሚን፣ ኺጥበቱን ኒካህ',



  'ኢብኑ ኡሰይሚን፣ ኺጥበቱን ኒካህ',



  'የሳዑዲ የዑልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 19/353',




  'ኢብኑ ቁዳማ – ሙግኒ',


  'ኢብኑ ዑሰይሚን ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',



  'ሸይኹል ኢስላም ኢብኑ ተይሚያ ፣ ኪታብ አል ኢኽቲያራቱል ፊቅህያ',


  'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ ፈትዋ ቁጥር 13865',



  'ኢብኑ ኡሰይሚን ፣ ፈትዋ፣ 2/804',



  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',



'ኢብኑ ኡሰይሚን ፣ ሸርህ ሙምቲዕ ፣ 5/243 ፣ \n'
'ኢብኑ ቁዳማ ፣ ኪታብ ሙግኒ ፣ 9/483 ፣ \n'
'ሸይኽ ፈውዛን ፣ ኪታብ ሙለኸሱል ፊቅህ ፣ 2/345,346',


'ኢብኑ ኡሰይሚን ፣ ሊቃኡል መፍቱህ ፣ 6/54',




'ተፍሲሩል ቁርጡቢ ፣ 124',



'ኢብኑ ቁዳማ ፣ ኪታብ ሙግኒ ፣ 7/14,22 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ ሸርህ ሙምቲዕ ፣ 12/45',



'ተፍሲር አድወኡል በያን ፣ 164–168',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ '
'ሸይኽ ሰርኸሲይ ፣ ኪታቡል መብሱጥ ፣ 27/158',



'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 12/293 ፣ \n'
'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣7/191',



'ኢብኑ ኡሰይሚን ፣ ሊቃኡል ሸይርይ ፣ 1/46 ፣ \n'
'መጅሙኡል ፈታዊ ፣ 18/112',



'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 7/373 ፣ \n'
'ሸይኽ ሙሀመድ ኢብኑ ኢብራሒም ፣ ፈትዋ ቁጥር 11/3050, 3051',




'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 6/8 ፣ \n'
'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 20/274',


//part two


'ኢብኑል ቀይም ፣ ቱህፈቱል መውዱድ ፣ 164 ፣\n' 
'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 11/440,449',



'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 7/388-387 ፣\n' 
'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙዕ ፣ 4/181 ፣\n' 
'ኢማሙ ሻፊዒይ ፣ ኪታቡል ኡም ፣ 1/193',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 22/188\n',



'ኢብኑ ተይሚያ ፣ መጅሙዑል ፈታዊ ፣ 34/229\n ፣ '
'ሸይኹል አልባኒ ፣ ተማሙል ሚንናህ ፣ 420 ፣\n'
'ሸይኽ ሙሀመድ አማን አሽሸንቂጢይ ፣ አድወኡል በያን ፣ 5/525',



'ኢማሙ ነወዊይ ፣ ፈትሁል ባሪ ፣ 9/175 ፣\n' 
'ኢማሙል ቁርጡቢይ ፣ ተፍሲሩል ቁርጡቢ ፣  271 / 13\n',


'ኢብኑ ተይሚያ ፣ ፊቅሁል ኡስራ ፣ 634 ፣\n'
'ኢማሙ ነወዊይ ፣ አልመውሱዐቱል ፊቅህያ ፣ 30/82',



'ኢማሙ ነወዊይ ፣ ኪታቡል መናሂጅ ፣ 3/208 ፣\n'
'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 5/123 ፣\n'
'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 18/13',



'ኢብኑ ባዝ ፣ ፈታዊ ኑሩን አለደርብ ፣ 21/46',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 5/176',



'ኢብኑ ኡሰይሚን ፣ ፈታዊል ኢስላሚያህ ፣   3 / 128',



'ኢብኑ ባዝ ፣ ፈታዊ ኑሩን አለደርብ ፣ 3/1549',



'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 2758',




'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 2597',




'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 7/397፣\n'
'ኢብኑ ዑሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 13/182 ፣',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 1/45 , 46',



'ኢብኑ ተይሚያ ፣ ፈታዊል ኩብራ ፣ 3/178 ፣\n'
'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 20 / 387 ፣\n' 
'ኢብኑ ኡሰይሚን ፣ ፈታዊ ኢስላሚያህ ፣ 3/370 ',



'ኪታቡል መውሱዓቱል ፊቅህያ ፣ 39  / 155 ، 156 ፣\n'
'ኢማሙ ጦሀዊይ ፣ ሸርህ መዓኒል አሳር ፣ 3/17 ፣\n'
'ኢብኑ አብዱል በር ፣ ኪታቡ ተምሂድ ፣ 21/119 ፣\n'
'ኢማሙ ዘሀቢይ ፣ ሲየር አእላሙ ኑበላእ ፣ 3/356',





];



List<String> questions5 = [


  'ሚስቱን በቃል ሳይናገር በቀልቡ (በሀሳቡ) ቢፈታት ወይም ለማንም ሳይናገር ከራሱ '
'ጋር ልክ እንደፈታት ሁኖ ቢያስብ በትክክል እንደፈታት ነው የሚቆጠረው ወይስ እንዴት ነው?',



  'ሴት ከባለቤቷ ጋር ስትሰግድ እንዴት ነው?\n '
'በመቀራረብ ይቻላል በመሀላቸው ምን ያህል ርቀት መኖር አለበት?\n'
'በየትኛው በኩል ነው መሆን ያለባት በስተቀኝ በግራ ወይስ በሱ ትክክል ከኃላ?\n'
'የእሷ እራስ እና የሱ እግር መነካካትስ እንዴት ይታያል?\n',



  'ባልናሚስት ቢነካኩ ኡዱ ይፈታሉ?',



  'አንድ ሰው ሚስቱ የማትሸፈን ከሆነች? እድትሸፈን በሲነግራትም እምቢ ካለች ምድነው ማድረግ ያለበት? '
'ባልዮውስ በሱ አስተዳደር ስር ስለሆነች በማትሸፈነው አላህ ዘንድ ተጠያቂ ይሆናል?',



  'በድህነት ምክንያት ሚስት ከባሏ ውጪ ለብቻዋ ለስራ ወደ ውጪ አገር መሄዷ እንዴት ይታያል?',



  'አንዲት ሙተነቂብ የሆነች ሴት የእህቷ_ባል ፊት ፊቷን መግለጥ ትችላለችን?',



  'ባሌ ጋር በጣም እየተጨቃጨቅን በጣም ተናዶ ስለነበር "በቃ እኔና አንቺኮ ተፋተናል '
'ማለት ይቻላል" አለኝ፣ ታዲያ ፍቺው ተገኝቷል ወይስ፣ መፋታት አለብን ፣ '
'ወደ ቤተሰቦችሽ መሄድ አለብሽ እና ተመሳሳይ ቃላቶችስ እንዴት ናቸው?',



  'ሚስትን ለማጨት ብሎ መመልከት',



  'ሚስትን ለማጨት ብሎ መመልከት',



  'በእርግዝና ወቅት ግኑኝነት መፈፀም ይቻላልን? ዶክተሮች እስከ 7 ወር ድረስ ችግር የለውም ይላሉ?',



  'ወንድ ልጅ አጂነቢ የሚሆነውና ሴትም እሱ ፊት ከመገለጥ የምትከለከው ከስንት እድሜው ጀምሮ ነው?',



  'የወሊድ መቆጣጠሪያን ቶሎ ቶሎ ላለመውለድና ከኑሮውም አንፃር መጠቀም እንዴት ይታያል?',



  'አንዲት እህታችን ፍች የተፈታችው በፍርድ_ቤት ነው ፣ ይህም የሆነበት '
'ምክንያት ልጁ አልፈታም ብሏት በፖሊስ በግድ እንዲፈታ ተደረገ ፣ ታዲያ ይህ ፍች ትክክል ነውን?',



  'ሚስት ባሏ ለግኑኝነት ሲጠራት እምቢ ማለቷ ወንጀለኛ ያረጋታልን ፣ ካልተመቻትስ?',



  'ባሌ ሲፈታኝ በራሱ አንደበት አልሰማሁትም፣ ከዚህ በፊት '
'እንደፈታኝ ይናገራል ፣ታዲያ እኔ ሳልሰማው ቢፈታኝ ፍቺው ይፀናልነዴ?',



  'ሁለት እህትማማቾችን በአንድ ጊዜ ማግባት እንዴት ይታያል?',



  'አንዲት ሴት ከማግባቷ በፊት ሌላም ሚስት እንዳታገባብኝ ብላ '
  'የሚያገባትን ልጅ ቃል ማስገባት ትችላለችን?',



  'ከባሌ ከኔ በፊት ሌላ ሚስት ማግባቱን ከደረስኩበት በኃላ እንዲፈታኝ '
'እየጨቀጨኩት ነው ፣ እሱ ደግሞ አልፈታም እያለ ነው ፣ ምን ላድርግ?',



  'ወንድማማች እንዲሆኑ አስቦ የወንድምን ሆነ የእህትን ልጅ ማጥባት እንዴት ይታያል?',



  'ልጅ ለእናቱ ወልይ ሆኖ ኒካሕ ማሳሰር ይቺላል ወይ? እነማን '
'ሳይኖሩ ነው ወልይ መሆኑን የምናውቀው? የቅርብ ወራሽ ሲጠፋ ወይስ ቃዲ ሲታጣ?',



  'አንድ ልጅ ነበር ካገባሽኝ እሰልማለሁ እያለ ብዙ ጊዜ ይለምነኛል ፣ '
'ምን ላርግ ባንድ በኩልም የሂድያው ሰበብ ብሆን እላለሁ?',



  'ያደኩት አክስቴ ቤት ነውና ከልጅነቴ ጀምሮ የምጠራውም በአክስቴ_ባል ስም ነው ፣ ይህ እንዴት ይታያል?',



  'እሷ ውጭ እያለች ኒካህ አድርገው ነገር ግን ምንም ግኑኝነት ሳያደርጉ '
'ተጣሉ እና ፈታሁሽ አላት ፣ ታዲያ እሷ  መህሩን ሙሉውን መጠየቅ ትችላለች?',



  'ቀለበት በኢስላም እንዴት ነው ኒካህ ሲደረግ ቀለበት ማድረግ '
'ሱና ነው?  በየትኛው እጅ ነው ሚደረገው ለወንድና ለሴት ልዩነት አለው?',



  'በሜሴጅ ወይም በፅሁፍ ፈታሁሽ ብሎ ቢልክላት ፍቺው ይፀድቃል?',



  'አንድ ሰው ሚስቱን እናት ፣ ማማ እያለ ቢጠራት ምን ችግር አለው?',


  //part two

  'የአቂቃን ምግብ ቤት ከማዘጋጀት ለምስኪን ቢሰጥስ አልያም የበጉን ዋጋ ተምኖ ብሩን ለምስኪኖች መላክስ?',



  'በዚና የተወለደ ልጅ ማሰገድ ይችላል ወይ? በሽሪዓ እንዴት ይታያል?',



  'ባሏ የሞተባት ሴት እስከ አራት ወር ከአሰር ቀን ድረስ ትቀመጣለች ፣ '
'ታዲያ በዚህ መካከል ምንድን ነው የምታደርገው ፣ ማድረግስ የሌለባት ነገር ቢብራራልን?',



'ራስን በራስ ማርካት (ሴጋ) የሚበላው ነገር እንዴት ይታያል በሸሪዓችን?',



'ሴት ልጅ የወደደችውን ወንድ ለትዳር መጠየቅ ትችላለችን ወይስ በተለምዶ የግድ ቤተሰብ የመረጡላትን ነው የምታገባው?',



'ሙስሊም ሆኖ የሀላል ሚስቱን በኮንዶም መገናኘት ይችለልን?',




'የእክስትና የአጎትን ልጅ ማግባት በሸሪዓችን እንዴት ይታያል ፣ አጂነቢ ናቸውን?',


'እርጉዝ ሴት ኒካህ ማድረግ ትችላለችን ፣ ከምታገባው ባል ያረገዘች ከሆነስ?',



'የተጋቡበትን ቀን ለማስታወስ በየአመቱ ያችን ቀን እንደ በአል በማክበር ሳይሆን ስጦታ በመሰጣጣት ቢያስታውሱት ችግር አለውን?',




'ለመተጫጨት ተብሎ መልካቸውን ቀድሞ ለመተያየት ሲባል በአካል '
'መገናኘት ካልቻሉ በፌስቡክም ሆነ በዋትሳብ ፎቷቸውን ቢላላኩ እንዴት ይታያል?',




'ወንድሜ የእናታችንን ወንድም ሚስት (የአጎታችንን_ሚስት) ባሏ ከፈታት በኃላ ማግባት ይችላልን?',



'አንዲት ሴት ከአንድ ወንድ ጋር ዚና ካደረገች በኃላ ከእሱ ጋር መጋባት ትችላለችን?',



'ባል የሚስቱን እህት መጨበጥ ይፈቀድለታልን?',




'ኒካህ ካደረጉ በኃላ በአካል ሳይገናኙ በመካከላቸው ግጭት ተፈጠረና ፈትቼሻልሁ አላት ፣' 
'እና መልሶ ደግሞ መልሼሻለሀ አላት ይህ እንዴት ይታያል ከግኑኝነት በፊት ነው?',



'ሴት ልጅ እርግዝና ውስጥ ሆና ባልዩው ፈትቸሻለሁ ቢላት ፍቹ ይወድቃል አይወድቅም?',




'የዝሙት ልጅ በማን ስም ነው የሚጠራው ማለቴ በአባቱ አይጠራም የሚባል ነገር ሰምቼ ነው ፣ ትንሽ ቢብራራልን?',



'አንዳንድ ሴቶች ወደ ትዳር ሲገቢ ለኒካሁ መህር የሚጠይቁት ወንዱ ቁርአንን ሙሉውን ወይም '
'የተወሰነውን መሀፈዙን (በቃሉ መሸምደዱን) ነው ፣ ይህ በሸሪዓችን እንዴት ይታያል ፣ መህር ይሆናልን?',


];

