


             // Tuhara part one


List<String> texts6 = [

'አብዛህኛው የኡለሞች አቋም የሰው ሽንት ህፃንም ይሁን አዋቂ ወንድም ይሁን ሴት ጡት '
'ብቻ የሚጠባም ይሁን ምግብም የጀመረ ይሁን ሁሉም ሽንቱ ነጃሳ ነው ለዚህም ሀዲስ:'

'አንድ ጊዜ ኡሙ ቀይስ ቢንት ሚህሶን ምግብ መብላት_ያልጀመረ ልጇን ወደ ነብዩ '
'(ሶለሏሁ አለይሂ ወሰለም) ይዛው መጥታ በጉያቸው ሲያስቀምጡት ሸናባቸው፣ ከዛም '
'ውሀ እንዲያመጡላቸው አዘዙና ባያጥቡትም በላዩ ላይ ዉሀውን አፍስሰውበታል። '
'[ቡኻሪና ሙስሊም ዘግበውታል]\n\n'

'ነገር ግን በዚህ ዙሪያ የተግራራ ነገር ቢኖሩ የወንድ ህፃን ልጅ ሽንትን ማጠብ '
'ግዴታ አለመሆኑ ነው። ልክ ከላይኛው ሀዲስ እንደተመለከተው ውሀን በላዩ ላይ '
'ማፍሰሱ ብቻ በቂ ነው። ለዚህም ሀዲስ:'

'ሉባባ ቢንቱል ሀሪስ አንዲህ ትላለች:— \"አንድ ጊዜ ሑሰይን ቢን ዓሊይ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) '
'ጉያ ውስጥ ሆኖ አያለ ልብሳቸው ላይ ሸናባቸው። ከዛም ልብስ ልበሱና ሽርጥዎን ስጡኝ '
'ልጠበው ስላቸው እንዲህ አሉኝ; "የሚታጠበውኮ የህፃን ሴት ልጅ '
'ነው የወንድ ልጅ ደግሞ በላዩ ላይ ውሀ ማፍሰስ ነው።\"' 
'አህመድ፣ አቡ ዳውድና ኢብኑ ማጃህ ዘግበውታል',



'በመጀመሪያ ደረጃ በዚህ ዙሪያ ላይ በኡለሞች መካከል የተያየ አቋም ቢኖርም አመዛኙና '
'በላጩ ግን ባል ሚስቱን ሚስት ባሏን ቢነካኩ በስሜትም ይሁን ያለ ስሜት ውዱ አያስፈታም። '
'ለዚህም በሀዲስ እንደመጣው ነብዩ (ሶለሏሁ ኣለይሂ ወሰለም) ሚስቶቻቸውን '
'ስመው ውዱእ ሳያደርጉ ሶላት የሰገዱባቸው አጋጣሚዎች እንዳሉ ተጠቅሷል። '

'በቁርአን ላይ አላህ በሱረቱ ኒሳእ ያለው \"...ወይም ሴትን ከነካችሁ (ውዱእ አድርጉ)\"' 
'የሚለው አንቀፅ ደግሞ ኢብኑ አባስን ጨምሮ አብዛኛው ኡለሞች ያሉትና ትክክለኛውም ትርጉም' 
'ከሴት ጋር ግንኙነት ካረጋችሁ እንጂ በአካል ከተነካካችሁ ማለት እንዳለሆነ ተናግረዋል። '
'ስለዚህ በባለትዳሮች መካከል የሚኖር የአካል መነካካት ውዱእ አያስፈታም።',



'አብዛኞቹ ኡለሞች ቁርአንን ያለ ውዱእና ይዞ መቅራት የተከለከለ ነው። '
'ለዚህም ነብዩ (ሶለላሁ አለይሁ ወሰለም) ወደ የመን በላኩት ደብዳቤ ውስጥ \" '
'ቁርአንን ጡሀራ ያልሆነ ሰው እንዳይነካው\" የሚል መልእክት ይገኛል። ከዚህ በመነሳት '
'በቃልም ይሁን በጨርቅ ይዞም ይሁን ሰው ይዞለት መቅራት ይቻላል። በቃል '
'መቅራት የማይቻለው ጁኑብ ላይ ላለ ሰው ብቻ ነው። ምክንያቱም እሱ '
'ያለበት ትልቁ ሀደስ(ከባዱ ጡሀራን የማጣት) አይነት ላይ ነው።',



'ግዴታ አይደለም። በሸሪዓችን የመጣው ተለምዷዊ የሆነውን አስተጣጠብ ነው ፣ '
'እሱም ከላይ የሚታዩትን አካላት ማጠብና ውሀን ማዳረስ እንጂ ይሄን ያክል ራስን '
'አጨናንቆ እስከጥፍር ውስጥ ድረስ ያስገባ የሚል ሀዲስ የለም። ለዛም ነው ሸሪአችንም' 
'በማግራራት ላይንጂ ከአቅም በላይና አስቸጋሪ የሆነን ነገር አላዘዘንም።',



'የጀነበችው ሀይድ ላይ እያለችም ይሁን ሀይድ ከማየቷም በፊት ጀንባ ከዛ ሳትታጠብ '
'ሀይድ ብታይም መታጠብ ያለባት ሀይዷን ስትጨርስ ነው፣ ለሁለቱም አንድላይ ነው የምትታጠበው፣ '
'ለዚህም ደግሞ ሁለቱንም አብራ መነየት ትችላለች። ካልሆነም አንድኛውንም '
'ብትነይት ለሁለቱም ያብቃቃላታል። ለምሳሌ ለሀይድ ብላ ብትታጠብ ጀናባውም አብሮ ይወርዳል።',



'በዚህ ጉዳይ ላይ ዑለሞች መካከል ልዩነት ቢኖርም አመዛኙና_በላጩ ግን ሀይድም ላይ ይሁን '
'ኒፋሳ (የወሊድ ደም) ላይ ያለች ሴት እንደማንኛውም ሰው ቁርአን መንካት ባይፈቀድላትም '
'ቁርአን በቃሏ መቅራት ትችላለች። ቁርአን መቅራት እንደሌለባት የሚያመለክተው ሀዲስ በጣም ዶዒፍ ነው።' 

'የጀነበ ሰው በቃሉም ቢሆን መቅራት መከልከሉ የሚቆይበት ጊዜና ለመታጠብ የሚቆየው '
'ወቅት አጭር ስለሆነ ነው፣ ሀይድና ኒፋሳ ግን ብዙ ጊዜ ስለሚቆይ ያን '
'ሁሉ ጊዜ በቃል እንኳን ከቁርአን እንድትርቅ ማድረግ ይሆናልና በጀናባ ቂያስ አድርጎ ማመሳሰል አይቻልም።',




'ውዱእ እንደሌለው እያወቀ ሶላት መስገድ አቡ ሃኒፋና አንደንድ ዑለሞች ከኢስላም ያስወጣል፣ '
'ያከፍራል ቢሉም አብዛኛዎቹ ኡለሞች ከታላላቅና ከባባድ ወንጀሎች መካከል እንደሚመደብ ይናገራሉ። '
'ይህን ተግባር የፈፀመ ሰው ቶሎ ወደ አላህ ተፀፅቶ ሊመለስና '
'ከዚህ በኃላም ላለመድገም ቆርጦ ሊቶብት እንዲሁም ኢስቲግፋር ሊያደርግ ይገባል።',




'ብልትን በስሜትም ይሁን ያለ ስሜት የራስንም ይሁን የሌላ ሰው '
'የህፃንም ይሁን የአዋቂ ያለ መጋረጃ መንካት ውዱዕ ያስፈታል። '
'በሀዲሱ በግልፅ እንደመጣው በስሜት የሚል ገደብ አልተቀመጠም።' 
'ለዚህም ነብዩ ሶለሏሁ ዓለይሂ ወሰለም እንዲህ ብለዋል:—'
'\"ብልቱን የነካ ውድዕ ያድርግ\"',



'ይህ ጉዳይ በኡለሞች መካከል ልዩነት ያለበት ቢሆንም አጂነቢም ይሁን መህረም '
'ማንኛውንም ተቃራኒ ፆታን በስሜትም ይሁን ያለ_ስሜት መንካት ውዱእ አያስፈታም። '
'ለዚህም በሀዲስ ብዙ ቦታዎች ላይ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) ሚስቶቻቸው ጋር '
'በእጅም ይሁን በሌላ ሰውነት ተነካክተው ነገር ግን ውዱዕ ሳያደርጉ ሶላት የሰገዱባቸው '
'ብዙ አጋጣሚዎች አሉ። ከነዚህ ሀዲሶች መካከል አዒሻ ረዲየሏሁ አንሀ እንዲህ ትላለች:—'

'\"ነብዩ (ሶለሏሁ አለይሂ ወሰለም) ከፊል ሚስቶቻቸውን ስመው ውድእ ሳያደርጉ ወደ ሶላት ወጥተዋል።\"'
'[አቡ ዳውድ ፣ 179]',




'ልክ እንደሌላው ቦታ የተነጀሰና መጥፎ ነገራቶች የሚደረጉበት ቦታ እስካልሆነ ድረስ ችግር የለውም። '
'በሀዲሰም እንደመጣም ነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) ከሌሎች ነብያቶች ከሚለዪባቸው ነጥቦች' 
'መካከል አንዱ ምድር በአጠቃላይ መስጂድና ንፁህ መደረጓ ነው። ስለዚህ ማንኛውም '
'ቦታ ነጃሳ እና ሽርክያትና ሌሎች አላህ የማይወዳቸው ነገራቶች የሚደረግበት አካባቢ እስካልሆነ ድረስ መስገድ ይቻላል። ',




'ይህ በኡለሞች መካካል ልዩነት ያለው ጉዳይ ቢሆንም ጀናዛን ማጠብ ውድእ አያፈርስም።' 
'ምክንያቱም ከላይ የተጠቀሰው ሀዲስ የሚያመለክተው ጀናዛ ካጠቡ በኃላ '
'መታጠብም ሆነ ውድእ ማድረግ እንደሚወደድ እንጅ ውዱእ እንደሚያፈርስ አይደለም።'

'ምክንያቱም በሌላ ሀዲስ እንዲህ የሚል መቷልና:— \n\n'

'\"ሙተኖቻችሁን ካጠባችሁ በኃላ መታጠብ ግዴታ የለባችሁም፣ ምክንያቱም '
'ሙታኖቻችሁ ነጃሳ አይደሉም ፣ እጆቻችሁን መታጠብ ይበቃችኃል።\" '
'[ሀኪምና በይሀቂይ ዘግበውታል።]\n\n'

'በሌላም ዘገባ ኢብኑ_ዑመር እንዲህ ብለዋል:—  \"ጀናዛን ካጠብን በኃላ ከኛ መካከል' 
'የሚታጠብም አለ የማይታጠብም አለ።" ስለዚህ ከነዚህ ዘገባዎች በመነሳት '
'ጀናዛን ማጠብ ውድእ አያፈርስም። ባይሆን ውዱእ ማድረግ ይወደዳል።',



'መዝይ የሚባለው ለወንድም ለሴትም ነው። ከመንይ ጋር ያለውም ልዩነት እንደ ወንዱ ነው። '

'እሱም መንይ የሚባለው በከባድ ስሜት ውስጥ ተስፈጥሮ የሚወጣ በተለይ የፆታዊ ግኑኝነት ላይ '
'መጨረሻ ላይ የሚፈስ ሰውነትን ሁሉ የሚወር ስሜት ያለው ፈሳሽ ነው። መልኩ ደግሞ ለወንድ '
'ወፈር ብሎ ነጭ ሲሆን ለሴት ደግሞ ቀጠን ብሎ ወደ ዳልቻ አይነት ነገር ነው።\n\n'

'መዝይ ደግሞ ስለ ግኑኝነት ሲያስቡ ፣ ስለባል ወይም ስለ ሚስት ሲያስቡ ወይም ከባለቤት ጋር ሲጫወቱና '
'ሲሳሳሙም ይሁን ሲነካኩ የሚወጣና ሲወጣም የማያስታውቅና መልኩም እንደ ውሀ አይነት ያለው' 
'አንጂ እንደ መንይ ነጣ ያለ አይደለም። ታዲያ መንይ ሲሆን ትጥበት እንደሚዋጅበው ሁሉ መዝይ ግን '
'ነጃሳ ቢሆንም ከውዱእ ውጭ ምንም አያስፈልግም፣ መዝይ '
'የነካውንም ልብስ መቀየር አይጠበቅብንም በላዩ ላይ ውሀ ማፍሰስ ብቻ በቂ ነው።',




'በአካባቢው እርሷን የሚያጥባት አንድም ሴት ካልተገኘ ማጠብ ይችላል ችግር የለውም። '
'ነገር ግን በሚያጥብበት ወቅት ጓንት አድርጎ እንጅ ሰውነታን ያለ ምንም መለያ ጨርቅ መንካት የለበትም።',




'ይህ አይነቱ ፈሳሽ ወድይ ተብሎ ይጠራል። እሱም ያለ ምንም ስሜት የሚወጣ ፣ '
'ሲወጣም የማያስታውቅ ፣ ነጭ የሆነና ሽታ የሌለው ፣ አንዳንዴም ከሽንት '
'በኃላ የሚወጣ ፣ ወይም ከባድ እቃ ሲሸከሙ የሚወጣ ፈሳሽ ሲሆን በሸሪዓችን ያለው ፍርድ እንደ ሽንት ነው።'

'ማለትም ይህ ፈሳሽ ከወጣ ውዱእ ስለሚያበላሽ ውዱእ ማድረግና ፈሳሹ የነካውን '
'ቦታ እና ልብስ ማጠብ እንጅ ሙሉ የሰውነት አካልን መታጠብ ግዴታ አይደለም።',




'ስጋቸው የሚበላ ማንኛውም እንስሳ ሽንታቸውም ሆነ ሰገራቸው አይነጅስም። '
'ለዛም ነው ነብዩ ሶለሏሁ አለይሂ ወሰለም  ወደ መዲና ገብተው የታመሙትን ሰዎች '
'የግመል ሽንትና ወተት እንዲጠጡ ያዘዟቸው። ሽንቱ ነጃሳ ቢሆን ኖሮ እንዲጠጡት ባላዘዟቸው ነበር። '

'በሌላም ወቅት የበግ ጉረኖ ወይም ማደሪያ ሽንታቸውና በጠጣቸው ያለበት መሆኑን '
'እያወቁ ውስጡ መስገድ እንዴት ይታያል ተብለው ሲጠየቁ ችግር እንደሌለውና እንዲሰግዱ አመላክተዋቸዋል ። '
'ይህ ሽንትም ሆነ ሰገራ የነካውን ልብስ ማጠብም ግዴታ አይደለም። በሱም መስገድም ይቻላል። ሶላቱንም መድገም አይጠበቅበትም።',




'ይህ ጉዳይ የኡለሞች ልዩነት ቢኖረውም በላጩና አመዛኙ አቋም ግን ለሱጁደ ሹክርና ለሱጁደ '
'ቲላዋ ውዱእም ሆነ ጡሀራ መሆነ መስፈርት አይደሉም። ለዚህም ሀይድም ላይ ያለች ሴት '
'ይህን ማድረግ ትችላለች። ምክንያቱም በዚህ ዙሪያ የመጡት ሀዲሶች ላይ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) '
'አንድም ጊዜ ውዱእ እንዲያደርጉ አለማዘዛቸውና ሙሽሪኮችም አብረው ሱጁድ ማድረጋቸው ውዱእ መስፈርት እንዳልሆነ ያመለክተናል።',





'ፈሳሽ የሆነ የሰው ደም ነጃሳ ለመሆኑ ቁርአን ሀዲስና በአጠቃላይ '
'የኡለሞች ሙሉ ስምምነት አለበት። ለዚህም አላህ በቁርአኑ እንዲህ ይላል:—'
'\"(ሙሀመድ ሆይ) በላቸው ፣ ወደኔ በተወረደው ውስጥ በክት '
'ወይም ፈሳሽ ደም ወይም የአሳማ ስጋ እርሱ እርኩስ (ነጀሳ) ነው።\" '
'ሱረቱል አንዓም ፣ 145 '

'ሌሎችም በርካታ የሀዲስ ማስረጃዎችና የኡለሞች ስምምነቶች ይገኛሉ።',



'ሽንት ቤትም ይሁን ሌላ ቦታ ነጃሳነቱ በእርግጠኝነት የታወቀ እስካለሆነ ድረስ ውዱእ ማድረግ ይቻላል። '
'ምክንያቱም እንደሚታወቀው በተለይ በሴራሚክ የተሰሩ ሽንት ቤቶች ሽንትና ሰገራ '
'መጠቀሚያው ቦታ ብቻ ካለሆነ ሌላው በዙሪያው ያለው ወለሉ በአብዛህኛው '
'ጡሀራ ነው። ብቻ ቦታው ጡሀራ የሆነ አካባቢና ቦታ ላይ ውዱእ '
'ሲያደርግ ከታች ከወለሉ ተስፈንጥሮ ልብሱንም ሆነ ሰውነቱን የሚነካው እርጥበት አይነጅሰውም። ',



'በጉዞ ላይ ሆኖ ምንም ውሀም ይሁን አፈር የማይገኝበት አካባቢ ላይ እያለ ወይም በቤት ውስጥ '
'ታግቶ እያለ ሶላት ቢመጣበት ዝም ብሎ ያለ ምንም ውዱእ ሶላቱን ይስገድ ፣ '
'ሶላቱም ትክክል ነው። ከሰገደ በኃላ ውሀም ይሁን አፈር ቢያገኝ ሶላቱን መድገም ግዴታ የለበትም።'

'ምክንያቱም አላህ በብዙ የቁርአን አንቀፆች ላይ ነፍስን ከአቅሟና ከምቾቷ በላይ '
'እንደማያስገድዳትና አሏህ ያዘዘንን ተግባራት በቻልነው አቅም እንድንፈፅም ማዘዙ ተጠቃሽ ነው።\n\n'
'ከዚህ በመነሳት ከአቅማችን በላይ በሆነና ያልቻልነው ነገር ይቅር እንደሚባልልን ያመለክታል። '
'ለዚህ ደግሞ አሏህ ውዱእ ወይም ተየሙም እንድናደርግ ቢያዘንም ይህን ማድረግ አቅሙ ' 
'ስለሌለን ያለን አቅም ደግሞ ሶላቱን በወቅቱ መስገድ ነውና ይህንን '
'የአቅማችንን መስራት እንጂ ውዱእ ባለማድረጋችን ወንጀለኛ አንሆንም።',




'ነጃሳ ነገርን (ሽንት ፣ ደም ፣ ሰገራ ፣ ቢራ ...)  ለመድሀኒትነት መጠቀም '
'በላብራቶሪ ከእርሱ ውጭ ሌላ ምንም የሚያድነው ነገር እንደሌለ ካልተረጋገጠ በስተቀር መጠቀም ሀራም ነው። '
'ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም በሀዲሳቸው እንዲህ ብለዋል:—'

'\"አላህ በሽታም መድሀኒትም አውርዷል፣ ለሁሉም በሽታ መድሀኒት '
'አድርጓል ፣ ታከሙ ፣ በሀራም ነገር መድሀኒት አትጠቀሙ።\"'
'አቡ ዳውድ ዘግበውታል',



'በርግጥም አስካሪ መጠጥ በሸሪዓችን ክልክል የተደረገና ከከባባድ ወንጀሎች' 
'የሚመደብ ቢሆንም መጠጥ ነጀሳ በመሆኑ ዙሪያ ላይ በኡለሞች መካከል ልዩነት ያለበት ጉዳይ ነው።\n\n'

'ከዚህም በመነሳት ነጃሳ ነው ያሉት ኡለሞች አላህ በቁርአኑ መጠጥን እርኩስ ብሎ መሰየሙን እንደማስረጃ ይጠቅሳሉ። እሱም : '
'\"እናንተ ያመናችሁ ሆይ ፣ የሚያሰክር_መጠጥ ፣ ቁማርም ፣ ጣዖትም ፣ '
'አዝላምም ፣ ከሰይጣን ስራ የሆኑ እርኩሶች ናቸው ፣ ራቁትም ፣ ልትድኑ ይከጀላልና።\" '
'[ሱረቱል ማኢዳህ ፣ 91]\n\n'

'ነጀሳ አይደለም ያሉት ኡለሞች እና በላጩና የተሻለውም አቋም ደግሞ ይህን ከላይ ያለው '
'የቁርአን አንቀፅ የተፈለገበት የተግባሩን ቆሻሻነት እንጅ ፈሳሹ ሰውነትን የሚነካው ነገር ነጃሳ '
'መሆኑን አይጠቁምም ይላሉ። ምክንያቱም ከአስካሪ መጠጡ ጋር አብረው የተዘረዘሩትም '
'ቁማርና ጣዖት ልብስን ቢነኩ እንደማይነጅሱ የታወቀ በመሆኑና መጠጡም ከነሱ '
'ጋር አብሮ መዘርዘሩ ተግባሩን ለማንቋሸሽ እንጅ ልብስን ይነጅሳል ለማለት አይደለም። '

'ይህም በመሆኑ ምድር ላይ ያሉ ማንኛውም ነገራቶች በሸሪዓችን ነጀሳ መሆናቸው ማስረጃ\n\n'
'እስካልተገኘለት ድረስ ጡሀራ ስለሆኑ አስካሪ መጠጥም ነጃሳ ለመሆኑ ማስረጃ ስላልመጣበት ልብስን ቢነካ አይነጅስም። ',



'እድሚያቸው የገፋ ሴቶችም ይሁን ያልገፋ ሴቶች አጂነቢ እስከሆኑ ድረስ '
'መጨበጥም ሆነ ብቻ ለብቻ መቀመጥ አይፈቀድም። ምክንያቱም ነብዩ '
'ሶለሏሁ አለይሂ ወሰለም በሀዲሳቸው እንደጠቀሱት \"እኔ ሴቶችን አልጨብጥም። '
'\" ብለው ባሉበት ሀዲስ ላይ የእድሜ ገደብን አላስቀመጡም። '

'በዚህ ሀዲስ ብቻ ሳይሆን በሌላም ሀዲስ ላይ በእድሜያቸው የገፉ ሴቶችን '
'መጨበጥን የሚፈቀድ ሀዲስ አለመኖሩ ክልከላው ሁሉኑም አጂነቢ የሆኑትን ሴቶች '
'የሚያካትት መሆኑን ያመለክታል። በሌላ ነገር ማሰብ አለማሰብ ጋር አያገናኘውም። መስፈርትም አይደለም። ',


];



List<String> appTitless6 = [

  'የ ህጻን ልጅ ሽንት',

  'ባልናሚስት  ቢነካኩ',

  'ቁርአንን ያለ ውዱእ መንካት',


  'ለጀናባ የጥፍር ውስጥ ድረስ ማጠብ',


  'በሀይድ ወቅት ጀናባ መሆን',


  'ሀይድ ላይ ያለች ሴት ቁርአን መቅራቷ',


  'አውቆ ያለ ውዱእ መስገድ',


  'ብልትን መንካት ዉዱዕ ያስፈታልን',


  'ሴትን ልጅ መንካት ውዱ ያስፈታልን',


  'የክርስታን ቤት መስገድ ይቻላል',


  'ጀናዛን ማጠብ ውዱእ ያስፈታልን',


  'የመንይና የመዝይ ልዩነቱ',


  'የእናትን ጀናዛ ማጠብ',


  'ወድይ ደግሞ ምንድን ነው',


  'የበግ ሽንትና በጠጥ ይነጅሳልን',

  'በሀይድ/ያለ ውዱእ የምስጋና ሱጁድ',

  'የሰው ደም ይነጅሳልን',


  'ሽንት ቤት ውስጥ ውዱእ ማድረግ',

  'ለውዱእ ውሀም አፈርም ከሌለ',

  'ሽንትን ለመድሀኒትነት መጠቀም',

  'ቢራ (መጠጥ) ይነጅሳልን',

  'ባልቴት ሴትን መጨበጥ',



];




List<String> sources6 = [


  'ሸይኽ ኢብኑ ባዝ ረሂመሁሏህ',

  'ሸይኽ ኢብን ባዝ ረሂመሁሏህ',

  'ኢብኑ ባዝ ረሂመሁሏህ፣ መጅሙዑል ፈታዊ 4/383',

  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',

  'ኢማሙ ሻፊዒይ፣ ኪታቡል ኡም፣ \n'
  'ኢብኑ ቅዳማ፣ ኪታቡል ሙግኒ', 

  'ኢብኑ ባዝ ረሂመሁሏህ ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',

  'ኢማሙ ነወዊይ፣ ኪታብ መጅሙዕ 2/84 ፣ ረውዶቱ ጣሊቢን 10/67',

  'ነሳእይ/444 ፣ ኢብኑ ማጃህ/481\n' 
  'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 1/119',


  'ኢብኑ ተይሚያ ፣ መጅሙዑል ፈታዉ ፣ 12/222 ፣\n' 
  'ኢብኑ ኡሰይሚን ፣ ፈታዊ ፣ 10/134 ፣\n'
  'ኢብኑ ባዝ ፣ ፈታዊ ፣ 1/186 ፣ \n'
  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ ፈትዋ ቁጥር 5/266',

  'ኢብኑ ሀጀር ፣ ፈትሁል ባሪ ፣ 1/531 \n'
  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሞ ኮሚቴ ፣ 6/270 ',


  'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 1/295 ',


  'ኢማሙ ነወዊይ ፣ ሸርሁል ሙስሊም ፣ 3/213 ፣\n' 
  'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 1/168 ',

  'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 2/202',


  'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙዕ ፣ 2/165',


  'ኢብኑ ተይሚያ ፣ መጅሙኡል ፈታዊ ፣ 21/542 ፣ \n'
  'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 2/492 ፣ \n'
  'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 6/414',


  'ኢብኑ ተይሚያ ፣ ፈታዊል ኩብራ ፣ 5 / 340 ፣\n'
  'ኢማሙ ሸውካኒ ፣ ነይሉል አውጧር ፣ 5 / 347 ፣\n' 
  'ኢብኑ ሀጀር ፣ ፈትሁል ባሪ ፣ 2 / 554 \n'
  'ኢብኑ ባዝ ፣ ፈታዊ ኑሩን አለደርብ ፣ 10/461 ፣\n'
  'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 4/90',

  'ኢብኑ ተይሚያ ፣ ሸርሁል ኡምዳህ ፣ 1/105 ፣\n'
  'ኢብኑ ሀጀር ፣ ፈትሁል ባሪ ፣ 1/352 ፣\n' 
  'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙእ ፣ 2/576',

  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 5/85 ፣\n' 
  'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 12/369',


  'ኢብኑ ሀዝም ፣ ኪታቡል ሙህላ ፣ 1 / 363 ، 364',


  'ኢማሙ ነወዊይ ፣ ኪታብ መጅሙዕ ፣ 55 ፣\n'
  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',


  'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣  11/250',


  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 7/183 \n'
  'ነሳእይ ዘግበውታል (4181) አልባኒም ሶሂህ ብለውታል (2513)',








];



List<String> questions6 = [

  'አንድ ህፃን ልጅ ምግብ ከመመገቡ በፊት ሽንቱ ይነጅሳል ወይስ አይነጅስም? ' 
  'ከሴትና_ወንድ ምግብ እስኪጀምሩ ሽንታቸዉ የሚነጅሰው ማንኛቸው ናቸው?',

  'ባልናሚስት  ቢነካኩ ኡዱ ይፈታሉ?',

  'ቁርአንን ያለ_ውዱእ ይዞ መቅራት እንዴት ይታያል፣ በቃልስ መቅራት?',

  'ጀናባን ለማውረድ በሚደረገው ትጥበት ላይ ከጥፍር ውስጥ ውሀ ማስገባት ግዴታ ነውን?',


  'ሀይድ ላይ ያለች ሴት ብትጀንብ ወዲያው መተጠብ ግዴታ '
  'አለባት ወይስ ሀይዷን ስትጨርስ ነው? '
  'አስተታጠቡስ መጀመሪያ የትኛውን ነው የምትታጠበው? ',


  'ሀይድ ላይ ያለች ሴት ቁርአን መቅራት ትችላለችን? ',


  'ውዱእ እንደሌለው እያወቀ ሶላት መስገድ እንዴት ይታያል?',


  'የስሜት አካልን (ብልትን) ያለ ስሜት መንካት ውዱዕ ያስፈታልን?',


  'አጂነቢ ሴትን መንካት ውዱእ ያስፈታልን?',


  'ለተለያዩ ጉዳዮች የካፊር ቤት ውስጥ እያለሁ የሶላት ሰአት ድንገት ቢደርስና እዛው ብሰግድ እንዴት ይታያል?',


  'በሀዲስ ጀናዛን ካጠባችሁ ታጠቡ የሚል አለና ጀናዛ ማጠብ ውዱእ ያስፈታልንዴ?',


  'ከብልት የወጣ ፈሳሽ ሁሉ ትጥበት ግዴታ ያስደርጋልን ወይስ መንይ ብቻ ነው?' 
  'ከመዝይ ፈሳሽስ በምንድን ነው የሚለየው ፣ ለወንድ መዝይ የሚባል ነገር እንዳለው ሁሉ ለሴትም አለን?',

  'ወንድ ልጅ የእናቱን ጀናዛ ማጠብ ይችላልን?',


  'አንዳንድ ጊዜ ያለ ምንም_ስሜት ከብልት ዝም ብሎ የሚወጣ ፈሳሽ አለ ፣ ይህ ይነጅሳልንዴ ውዱዕስ ያስፈታልን?',


  'የበግ እና የፍየል ሽንታቸውና በጠጣቸው ይነጅሳልን? ከነጀሰስ በሱ የተሰገደ ሶላት መድገም አለብን?',


  'ሱጁድ አሽሹኩር ያለ ወዱእ ወይም ሀይድ ላይ ያለች ሴት መዉረድ ትችላለች?',


  'የሰውም ሆነ የራስ ደም ይነጅሳል ወይ?',


  'ባኞ ቤት (ሽንት ቤት እና ሻወር ያለው) ዑዱ ማድረግ እንዴት ይታያል በሸሪአችን?',


  'ውዱእ ለማድረግ በአካባቢው ውሀም_አፈርም የማይገኝ ከሆነ ምንድን ነው የሚያደርገው ፣ በድንጋይ ይቻላልን?',


  'አንዳንድ አካባቢዎች ሽንትን በመጠጣተና በመቀባት ለበሽታ መድሀኒትነት '
  'ይጠቀሙታልና በነጃሳ ነገር መድሀኒት መጠቀም እንዴት ይታያል?',

  'ኸምር (አስካሪ_መጠጥ) ልብስን ቢነካ ይነክጅሳልን? ',

  'አጂነቢ ሁና ነገር ግን ትልቅ ሴት የሆነች ማለትም አሮጊት ሴትን መጨበጥ' 
  'እንዴት ይታያል ፣ ያው በሌላ ነገር ሊያስቧት ስለማይችሉ ብዬ ነው?'




];