

List<String> texts3 = [


  'አውራ ጎዳና (መንገድ) ዳር‼️ '

'ምክንያቱም:—  \n\n'

 'በዚህ አካባቢ የተለያዩ እንስሳዎች ስለሚያልፉና ሽንታቸውና_ፅዳዣቸው ስለሚያርፍበት '
 'በዚህ አካባቢ የሚያልፉትን ሰዎችም እንደፈለጉ የመመላለስ መብትን ስለሚገድብ ምክንያቱም '
'መንገድ ላይ ሶላት የሚሰግድ ሰው ካለ ሰዎች እሱን ላለማቋረጥ እያሉ እንደፈለጉ የመዘዋወር መብታቸው ላይ ይጨናነቃሉ ' 
 'የሚሰግደው ሰው ለራሱ ካሁን ካሁን ሰው አቋረጠኝ ብሎ እንዲጨናነቅና ሶላቱን ተረጋግቶ እንዳይሰግድ ያደርገዋል።',



 'መእሙሙ (ተከታዩ) ኢማሙ ሩኩዕ ላይ ሆኖ ሲያገኘው በሱ ላይ ያለበት ግዴታ '
'ቁሞ የሚለው የሆነ አንድ ተክቢራ ብቻ ነው። እሱም ተክቢረተል_ኢህራም (የመግቢያ ተክቢራ) ነው። '
'የሩኩዕ ተክቢራ በዚህኛው ተክቢራ ውስጥ ይገባል። ለየብቻ ማለት ግዴታ ባይኖርበትም ቢለያየው ግን የተሻለ ነው።',



'ዊትር ሶላት መስገድ የተወደደ ተግባር እንጂ ግዴታ ባይሆንም በላጩ ግን '
'በተከታታይ አንዲትም ረከዓ ትሁን መስገዱ ነው። ከዚህ ጋር ተያይዞ የሚመወጣውም '
'የቁኑት ዱዓ ጉዳይ አሁንም ግዴታ ሳይሆን የሚወደድና የሚበረታታ ተግባር ነው።',



'ሶላት በሁለት ምክንያት ካለሆነ በስተቀር ማለትም በእንቅልፍ ወይም በመርሳት '
'ካለሆነ በስተቀር አውቆ ወይም ተሰላችቶ ያሳለፈ ሰው አብዛኛው ኡለሞች እንደሚሉትና '
'በላጩና አመዛኙ አቃም የሶላት ግዴታነትን ቢያምን እንኳን ይከፍራል የሚለው ነው። ወደ አላህ ሊቶብትም ይገባል። '
'ነገር ግን ከቶበተ እንደ አዲስ ነው እንጂ ሶላት የሚጀምረው ያለፈውን ሁሉ ሶላት ቀዷ ማውጣት አይጠበቅበትም። '
'ግዴታነቱን የማያውቅ ግን ባለማወቁ ኡዝር ሊሰጠው ይችላል።',



'በዚህ ርእስ ዙሪያ ላይ በኡለሞች መካከል ልዩነቶች ቢኖሩም ፣ አመዛኙና በላጩ '
'ግን ወደ ሱጁድ ሲወረድ መቀደም ያለበት ወይም መጀመሪያ መሬትን መንካት '
'ያለበት ጉልበት ነው ከዛም እጂ ተከትሎ ያርፋል። '

'ምክንያቱም በሀዲስ እንደመጣው ለሱጁድ የግመል አይነት አወራረድ እንዳንወርድ ተከልክሏል። '
'ግመል ደግሞ የምታስቀድመው እጇን ነውና እኛም ማስቀደም ያለብን ጉልበት እንጂ እንደግመል እጂን አይደለም። '
'ነገር ግን ከጉልበቱ በፊት እጁን የሚያስቀድምም ሰው ቢሆን አይወቀስም፣ '
'ምክንያቱም ይህ ዓቂዳ አይደለም፣ ማስረጃም ያላቸው አካላት ስለሆኑ መጨቃጨቅና አጉል መነታረክ ተገቢ አይደለም።',



'በመስጂድ ውስጥ በሴቶችና በወንዶች መካከል መጋረጃ መኖሩ በላጭ ቢሆንም ግን ግዴታ አይደለም። '
'ምክንያቱም በሀዲስ እንደመጣው ለወንዶች በላጩ ሶፍ የመጀመሪያው ሲሆን '
'ለሴቶች ደግሞ የመጨረሻው ሶፍ ነው። ይህም የሆነው የዛኔ ሴቶች ከወንዶች '
'ኃላ ሲሰግዱ እንደነበርና በመካከልም መጋረጃ እንዳልነበር ያመለክታል። ምክንያቱም '
'ከወንዶች ይበልጥ በራቁ ቁጥር ይበልጥ ከፊትናም እየራቁ ስለሆነ ነው። '
'ለዛም ነው ኡለሞች መጋረጃ ካለ ለሴቶችም በላጩ የመጀመሪያው ሶፍ ነው የሚሉት። '
'ስለዚህ የሴቶቹ ሶፍ ከወንዶች የራቀና የተለየ እንዲሁም ከኃላ እስከሆነ ድረስ የሚከለከል አይሆንም።',



'ውዱእ እንደሌለው እያወቀ ሶላት መስገድ አቡ ሃኒፋና አንደንድ ዑለሞች ከኢስላም ያስወጣል፣ '
'ያከፍራል ቢሉም አብዛኛዎቹ ኡለሞች ከታላላቅና ከባባድ ወንጀሎች መካከል ' 
'እንደሚመደብ ይናገራሉ። ይህን ተግባር የፈፀመ ሰው ቶሎ ወደ አላህ ተፀፅቶ ' 
'ሊመለስና ከዚህ በኃላም ላለመድገም ቆርጦ ሊቶብት እንዲሁም ኢስቲግፋር ሊያደርግ ይገባል።',



'የዒሻ ሶላት ወቅት የሚጠናቀቀው ከሌሊቱ ግማሽ ላይ ነው። ይህ እንግዲህ እንደየሌሊቱ እርዝማኔ '
'ሊለያይ ይችላል። እሱም የሌሊቱ እርዝማኔ 10 ሰዓት ከሆነ የዒሻ ሶላት መጨረሻው '
'5:00 ላይ ነው ማለት ነው፣ 12 ሰአት ከሆነ ደግሞ 6:00 አካባቢ ነው ማለት ነው። ',



'ሶላተል_ጋኢብ በሀዲስም ነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) ለነጃሺ እንደሰገዱት ሁሉ የተደነገገና '
'የተፈቀደ ተግባር ነው። ይህም ሩቅ አካባቢ ለሞተ ሰው የሚሰገድ የጀናዛ ሶላት ነው። '
'ታዲያ ይህ ሶላት ለማን ለማን ነው የሚሰገደው በሚለው ላይ በኡለሞች መካከል '
'ልዩነት ቢኖረውም አመዛኙና_በላጩ ንግግር ግን ሶላተል ጋኢብ የሚደገደው ሩቅ አካባቢ ሞቶ '
'በማንም ሳይሰገድበት_ለተቀበረ አካል መሆኑ ነው። ምክንያቱም የጀናዛ ሶላት የተወሰኑ አካላት '
'ከሰገዱት በሌላው ላይ ግዴታነቱ የሚቀር ተግባር ስለሆነ ነው። ',



'የመጀመሪያውም ላይ ይሁን የሁለተኛው ተሸሁድ (መቀመጥ) ላይ የሌባ ጣትን '
'ከፍ ማድረግ የሚወደድ ተግባር ነው። ይህም ጣቱን ቀጥ የሚያረገው ከተቀመጠ '
'ጀምሮ ለመቆም እስኪነሳ ወይም እስኪያሰላምት ድረስ እንጂ ላኢላሀኢለሏህ ሲል ብቻ አይደለም ቀጥ የሚያረገው። '
'ጣትን ማንቀሳቀሱ ደግሞ በላጩ ዱዓ ላይ ሲደርስ ትንሽ ቢያነቀሳቅሰው የሚወደድ '
'ተግባር ነው። እሱም ለምሳሌ አሏሁመ ሶሌ አላ ሙሀመድ... ፣ '
'አዑዙ ቢላሂ ሚን አዛቢ ጀሀነም... ፣ ረበና አቲና ፊዱንያ ሀሰናህ ... '
'እና ሌሎችም የዱዓ ቦታዎች ላይ ማንቀሳቀሱ ይወደዳል።',



'ከሶላት በኃላ ያለውና የተደነገገው ተግባር አዝካር እንጂ ዱዓ ማድረግና አሚን '
'ማለት መሰረት የሌለው ቢድዓ ነው። ለዚህም አሏህ እንዲህ ይላል:— \n'

'\"ሶላትን ባጠናቀቃችሁ ጊዜ አላህን አስታውሱ።\" '
'(ሱረቱ ኒሳእ/103) '

'ስለዚህ ከሶላት በኃላ የዲዓ ቦታ የለም፣ የዱዓው ቦታ ሶላት ውስጥ እያለ '
'ሳያሰላምት ነው። እሱም በሀዲስ እንደመጣው ሱጁድ ላይና ከተሸሁድ በኃላ ሳያሰላምት በፊት ነው።',



'አዛን እየተባለ ዝም ብሎ ማዳመጥና አዛን መመለስ በላጭና የሚወደድ ተግባር '
'ቢሆንም ማውራቱ ግን ሀራም ሳይሆን_የሚጠላ ተግባር ነው። ቢሰራው ወንጀለኛ አይሆንም።',



'የተፃፈው ነገር ጎላ  ያለና የተመልካችን ትኩረት የሚስብ ከሆነ በዚህ ልብስ መስገድ '
'የሚጠላ ተግባር ይሆናል። ለዚህ ነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) በሀዲሳቸው እንዲህ ማለታቸው ተዘግቧል:— \n'

'\"ነብዩ ሶለሏሁ ዓለይሂ ወሰለም አንድ ግዜ ምልክት(ቀለማት) ባለበት ልብስ ሰገዱ ፣ '
'ወደ ልብሱም ተመለከቱ ፣ ከዛ ሶላታቸውን እንደጨረሱ እንዲህ አሉ: \"ይህንን ልብስ ወደ '
'አቡ ጀህም ይዛችሁት ሂዱና ከዛም ሌላ ልብስ (ወፍራምና ምንም ምልክትና ቀለም የሌለው ልሙጥ ልብስ) '
'አምጡልኝ ፣ ምክንያቱም ይቺ ልብስ ቅድም ሶላት ውስጥ ወስውሳኛለች (ሀሳቤን ሰርቀዋለች)\" '
'ብኻሪ /373 ፣ ሙስሊም/556',



'ተሂየተል መስጂድ (መስጂድ እንደገቡ የሚሰገድ ሱና ሶላት) እንጂ እንደሌላው '
'ዝሁር ሶላት ከጁሙዓ ሶላት በፊት የሚሰገድ ቀብልያ ሱና ሶላት የለም‼️ '

'እንደውም አንዳንድ ኡለሞች ይህ ቢድዓ ነው ይላሉ። ምክንያቱም ይህ በሸሪዓችን አልመጣም። '
'ሰውዬው ኢማሙ ሚንበር ላይ ከመውጣቱ በፊት የፈለገውን ሱና ሶላት መስገድ ይችላል። '
'ከዛ ውጭ ከጁሙዓ ሶላት ጋር የተቆራኘ ቁጭ ብሎ የነበረ ሰው ተነስቶ የሚሰግደው ሶላት የለም። ',



'አብዛኞቹ ኡለሞች አስገዳጅና አስፈላጊ ነገር ከሌለ አይንን ጨፍኖ መስገድ የተጠላ '
'መሆኑን ያመለክታሉ። ይህንንም የአይሁዳዎች ተግባር መሆኑ ጋር አያይዘው ከነሱ ጋር መመሳሰል ነውም ያሉ አሉ። '
'ነገር ግን ከላይ እንደተጠቀሰው አስገዳጅና አስፈላጊ ነገር ከተከሰተ ለምሳሌ '
'ሶላት ውስጥ ሀሳብን መሰብሰብ ግድ ነው ታዲያ ለዚህ ብሎ ከሆና '
'ሶላት ውስጥ እያለ አይኑን ቢገልጥ ከፊት ሚስቱን ፣ እናቱን ፣ ወይም አጂነቢ ሴት አያለሁ ብሎ ካሰበ ችግር አይኖረውም።',



'ዱዓ ላይ ከነብዩ ሶለሏሁ ዓለይሂ ወሰለም የተገኙ ዱዓዎችን መጠቀሙ በላጭ ቢሆንም '
'እረበኛ ምንም የማይችልና በቃሉም ለመያዝ በጣም የተቸገረ ሰው ሶላት '
'ውስጥም ይሁን ከሶላት ውጭ በፈለገው ቋንቋ ዱዓ ማድረግ ይችላል። '
'ነገር ግን በሸሪዓችን የመጡ አንዳንድ ዱዓዎች ሁሉንም ጉዳይ ጠቅላይና '
'ማንኛውንም የዱንያም ሆነ የአኼራ ጉዳይ የሚያስገቡ ናቸውና እነዙህን '
'በተቻለው አቅም በቃሉ ሸምድዶ ቢያደርግ የተሻለ ነው። ለምሳሌ '
'ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار',


'በመጀመሪያ ደረጃ መቆም የሚችልና ለኢማምነት ብቁ የሆነ ሰው እያለ የማይችል ሰው '
'ማድረግ ተገቢ ባይሆንም ከሆነ ግን ሲጀምርም ቁጭ ብሎ ከጀመረ ሁሉም ከኃላው ያሉት ቁጭ ይላሉ። '
'ምክንያቱም በሀዲስ እንደመጣው \"ኢማም የተደረገው ሊመሩበት ስለሆነ\" '
'ሁሉንም እሱ እንደሚያደርገው አድርጎ መስገድ ግድ ይላል። ግን ሲጀምር ቁሞ '
'ከነበረና ወደ መካከል አካባቢ በህመምም ይሁን በሌላ ምክንያት ቁጭ ብሎ መስገድ '
'ቢጀምር ከኃላ ያሉት ይቆማሉ እንጅ ቁጭ አይሉም።',



'ይህ ጉዳይ በኡለሞች መካከል ልዩነት ቢኖረውም አብዛኞቹ ያሉበት እና በላጩም '
'አቋም ከሩኩዕ ቀጥ ካሉ በኃላ ደረት ላይ ቀኝ እጅን ግራ እጅ ላይ ማስቀመጥ ነው። እንዲህም ብለዋል:— '
'\"ሰዎች (ሶሀቦች) ሶላት ውስጥ ቀኝ እጃቸውን ግራ እጃቸው ላይ እንዲያስቀመጡ (በነብዩ ሶለሏሁ አለይሂ ወሰለም) ይታዘዙ ነበር።\" '
'(ቡኻሪ ዘግበውታል) '

'ታዲያ ሶላት ውስጥ ሁሉም ሁኔታ ላይ እጅ የሚቀመጥበት ቦታ አለው። ለምሳሌ '
'ሱጁድ ሲሆን ሁለት እጆች መሬት ላይ ይሆናሉ ፣ ሩኩዕ ሲሆን ጉልበት ላይ ፣ '
'መቀመጥ ሲሆን ደግሞ ታፋ ላይ ይሆናሉ ልክ እንደዚሁ ቂያም (መቆም) ላይ '
'ደግሞ ደረት ላይ ነው የሚሆኑት። ከሩኩዕ በኃላ ያለው መቆም ደግሞ ከዚህ ውስጥ ይገባልና እጅ ይያዛል። '
'ነገር ግን ይህን ተግባር ቢድዓ የሚተገብሩትን አካላት ደግሞ ሙብተዱዕ ማለት ተገቢ አይደለም። '
'ምክንያቱም መሰረት ያለው ተግባር ነውና።',



'የተገለጠው ሳያስበው ከሆነ ፣ የተገለጠውም የሰውነት ክፍል ትንሽዬ ከሆነ እና ተገልጦ ብዙ '
'ካለቆየ ወዲያው ከሸፈነው ሶላቱ አይበላሽም። ',



'በዚህ ዙሪያ ኡለሞች የአቋም ልዩነት ቢኖርም የተሻለውና በላጩ አቋም ግን ኹጥባን በአረበኛ '
'ማድረግ በላጭ ቢሆንም ኹጥባውን የሚያዳምጡት ሰጋጆች የአፍ ቋንቋቸው ከአረበኛ '
'ውጭ ከሆነና አረበኛም አብዛኛዎቹ መረዳት የማይችሉ ከሆነ በራሳቸው ቋንቋ ተርጉሞ '
'ኹጥባ ማድረግ ይቻላል። ምክንያቱም ኹጥባ ዋናው አላማው መምከርና ማስተማር ስለሆነ '
'ልክ እንደማንኛውም ዳእዋ በማንኛውም ቋንቋ ንግግር አድርጎ አዳማጮቹ ከኹጥባው ተጠቃሚ መሆን ስላለባቸው ነው። ',



'ሴት ልጅ ሶላት ውስጥ ከፊቷ በስተቀር እንዳለ ሙሉ አካሏን የሚሸፍን ልብስ መልበሷ በላጭ ነው። '
'ፊትን ግን በአካባቢው ሊያያት የሚችል አጂነቢ ወንድ ከሌለ ሱናው መግለጡ ነው። አጂነቢ ካለ ግን መሸፈን አለባት። '
'የእጅን መዳፍ በተመለከተ ደግሞ መሸፈኑ በላጭ ቢሆንም መግለጡም ችግር የለውም። '
'ከነዚህ ውጭ ያሉት የሰውነት አካላት ( ራስ ፣ እግር ፣ ደረት እና ሌሎችኝ የሰውነት አካላት በሙሉ) መሸፈን አለባቸው።',



'በመጀመሪያ ደረጃ በጀመዓ ለሚሰገድ ሶላት ሶፍ መስራት ግዴታ ነው። ለብቻ መቆም '
'የተከለከለ ነው። ሰውዬው ሶፋ ሞልቶ ሲያገኘው ሶፋን አጠጋግቶ ፈልቅቆ '
'መግባት ከቻለ ከኃላ ብቻውን መቆሙ የተከለከለ ነው። ሶላቱም ትክክል አይደለም። '
'ነገር ግን ሶፋን ከፈት አርጎ መግባት ካልቻለ ችግር የለውም። ለሴቶች '
'ግን አንዲት ሴት ብቻዋን ከሆነ መስጊድ የገባቸው በወንዶች ሶፍ መካከል '
'መግባት ስለማይፈቀድላት ብቻዋን መስገድ ትችላለች።',



'ለኢማምነት ብቁ እስከሆነ ድረስ በዚና (ዝሙት) የተወለደ ልጅን ኢማም ማድረግና ከኃላው '
'መስገድ እንደማይቻል ምንም ማስረጃ ስላልመጣ ሶላቱ አንደማንኛውም ኢማም ትክክል ነው። '
'ባይሆን አንዳንድ ኡለሞች እሱ ኢማም በመሆኑ በሰዎች መካከል ቅሬታን የሚያስነሳ ፣ '
'የሚያስደብራቸውና ጭቅጭቅ መነሻ ከሆነ ሌላ በዲኑ ኢስቲቃማና ጥንካሬ ያለው ሰው ቢያሰግድ በላጭ ነው ይላሉ። '

'በጥቅሉ ግን በሀዲስ እንደመጣው ማንኛውም ለኢማምነት ብቁ የሆነ ሰው ከዝሙት '
'ይወለድም አይወለድም ማሰገድ ይችላል። በዛ ላይ ይህ ሰው ወላጆቹ በሰሩትና እሱ '
'ባልሰራው ወንጀል ምክንያት ሊንቋሸሽና ከማህበረሰቡ ሊራቅ አይገባውም። ለዚህም አላህ በቁርአኑ እንዲህ ይላል:— '
'\"ወንጀል ተሸካሚ የሌላን ወንጀል አትሸከምም። '
'(ሱረቱል ፋጢር ፣ 18)',



'ለሱና ሶላቶች (የዱሀ ሶላት ፣ ተሀጁድ ፣ ተራዊህ ፣ ከፈርድ በፊትና በኃላ ያሉት ሱና ሶላቶች ፣ ዊትር) '
'አዛንም ሆነ ኢቃማ የላቸውም። ውዱእ ከተደረገ ቀጥታ መስገድ እንጂ አዛንና ኢቃማ '
'እንዳላቸው ማስረጀ አልመጣም። ነብዩም ሶለላሁ አለይሂ ወሰለም ሶሀቦቻቸውም አላደረጉትም። ',


'ያለ ምንም ሸሪዓዊ ምክንያት ተከታታይ በሆነ መልኩ ሱብሂ ሶላት ላይ ቁኑት '
'ማድረግ (ከሁለተኛው ሩኩዕ በኃላ ዱአ ማድረግ) የሱና_ተቃራኒ የሆነ ተግባር ነው። '
'ምክንያቱም ነብዩ ሶለሏሁ አለይሂ ወሰለም በዚህ መልኩ ቁኑት ሲያደርጉ አልነበረምና። '
'ነገር ግን ቁኑት የሚደረገው በሙስሊሞች ላይ ከባድ_ችግር ሲከሰት ብቻ ሲሆን '
'ቁኑቱም በሁሉም አምስት ወቅት ሶላቶች እንጂ የሱብሂ ሶላት ላይ የሚገደብ አይደለም።',



'በመጀመሪያ ደረጃ ወደ ቂብላ መዞር (ቂብላን መቅጣጨት) የሶላት መስፈርት በመሆኑ '
'ላይና ይህን ማድረግ እየቻለ ሳያደርግ ወደ ቂብላ ሳየዞር ወደ ሌላ አቅጣጫ የሰገድ ሶላቱ '
'ብልሹና ተቀባይነት የሌላት መሆኑ ላይ ኡለሞች ተስማምተዋል። '
'ነገር ግን ሰውየው ቂብላው በየት አቅጣጫ ይሁን ማወቅ በማይችልበት አካባቢ ከሆነ '
'ግምቱ ወደ ሚያመዝንበት አቅጣጫ ዞሮ መስገድ ይችላል። ሶላቱን ካጠናቀቀም በኃላ '
'ቂብላን እንደሳተ ቢረዳ እንካን ሶላቱን መድገም ግዴታ የለበትም ሶላቱ ትክክል ነው። \n\n'

'ለዚህም ጃቢር ቢን አብደላህ እንደሚናገሩት ሶሀቦቹ አንዴ የሆነ ጉዞ ላይ እያሉ '
'የዳመና_ጉም አካባቢውን ሲሸፍና የቂብላውን አቅጣጫ መለየት ሲያቅታቸው ወደ '
'ገመቱት አቅጣጫ ሰግደው ነበርና በማግስቱ ጧት ሲነጋ ቂብላን ስተው እንደነበር ሲረዱ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) '
'ጋር በመምጣት ሁኔታውን ካብራሩላቸው በኃላ ሶላቱን መድገም ይጠበቅባቸው እንደሆነ '
'ሲጠይቋቸው ሶላታቸው ትክክል መሆኑንና መድገም ግዴታ እንደማይኖርባቸው ነግረዋቸዋል።',



'አዛን ፈርዱል ኪፋያ (በአንድ አካባቢ ላይ አንድ ሰው ካደረገው በሌላው ላይ ግዴታ የማይሆን) '
'ኢባዳ ነው። ስለዚህ በአካባቢው አዛን ከተባለ እያንዳንዱ ሰው ላይ አዛን ማድረግ ግዴታ '
'ስለማይሆን ቀጥታ መስገድ ይችላል። ማንም አዛን ካለደረገ ግን ማድረጉ በላጭ ቢሆንም '
'አዛን ሳያደርግ ሶላት ቢሰግድ እንኳን ሶላቱ ትክክል ነው። ምክንያቱም አዛን የሶላት መስፈርት '
'አይደለም። ከሶላት የተገነጠለ ነገር ነውና።',



'ሱጁደ_ሰህው (የሶላትን አካል በመርሳት ለሚፈጠር ጉድለት መጠገኛ ስጁድ) ከማሰላመት በፊትም_በኃላም ይደረጋል። \n\n'

'ታዲያ ከተስሊም በፊት የሚሆነው በሁለት ምክንያቶች ሲሆን እነሱም:—\n'

'1: የሶላቱን ዋጂብ አንዱንም ቢሆን አጓድሎ ከሆነ (ለምሳሌ የመጀመሪያውን ተሸሁድ ረስቶት ከተነሳ)\n'
'2: በረከአው ብዛት ተጠራጥሮ ከሆነና አመዛኙን ሀሳብ መለየት የማይችልበት የጥርጣሬ ደረጃ ላይ ካለ '
'(ለምሳሌ የሰገደው የረከአ ብዛት 3 ይሁን 4 ከተጠራጠረና አመዛኙ የትኛው እንደሆነ ካላወቀ '
'በትንሹ ቁጥር ላይ ተመርኩዞ ይጨምርና) ከማሰላመቱ በፊት ነው ሱጁድ ሰህው ያደርጋል።\n\n'

'ነገር ግን ከሰላምታ በኃላ የሚሆነው ደግሞ;\n '

 '1 የሶላቱን አንድም ቢሆን ጨምሮ ከሆነ (ለምሳሌ አንድ ረከአ ውስጥ ሁለት ጊዜ ሩኩእ ካደረገ) ፣\n '
 '2 በረከአው ብዛት ተጠራጥሮ ነገር ግን ጥርጣሬው ወደ አንድኛው ሀሳብ የሚያመዝን ከሆነ '
'(ለምሳሌ የሰገደው የረከአ ብዛት 3 ይሁን 4 ከተጠራጠረና አመዛኙ 3 ረከአ የሚለው መሆኑን '
'ካወቀ በዚሁ ላይ ተመርኩዞ ይጨምርና) ካሰላመተ በኃላ ነው ሱጁድ ሰህው ያደርጋል።',


'ይህ ጉዳይ የኡለሞች ልዩነት ቢኖረውም በላጩና አመዛኙ አቋም ግን ለሱጁደ '
'ሹክርና ለሱጁደ ቲላዋ ውዱእም ሆነ ጡሀራ መሆነ መስፈርት አይደሉም። '
'ለዚህም ሀይድም ላይ ያለች ሴት ይህን ማድረግ ትችላለች። ምክንያቱም በዚህ '
'ዙሪያ የመጡት ሀዲሶች ላይ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) አንድም ጊዜ ውዱእ '
'እንዲያደርጉ አለማዘዛቸውና ሙሽሪኮችም አብረው ሱጁድ ማድረጋቸው ውዱእ መስፈርት እንዳልሆነ ያመለክተናል።',



'በሀዲስ የመጣው አንድ ሰው ሶላቱን ሲያጠናቅቅ ወደ ቀኝና ወደ ግራ '
'አሰላሙአላይኩም_ወራህመቱሏህ እንጅ ወበረካቱሁ የሚል አልመጣም። '
'ለዚህም በአቡዳውድ (ቁ 997) በተዘገበው ሀዲስ አልቀማህ እንዳሉት '
'ነብዩ ሶለሏሁ አለይሂ ወሰለም ሲያሰላምቱ ወደ ቀኝ አሰላሙአለይኩም_ወራህመቱሏህ ወደ ግራም እንዲሁ ማለታቸውን ይጠቅሳሉ። '
'ወበረካቱሁ የሚለውን በመጨመሩ ዙሪያ ላይ የመጣውም ሀዲስ ትክክለኛነቱ '
'ላይ በኡለሞች መካከል ልዩነት አለበት። ስለዚህ ከጥንቃቄም አንፃር በላጩ '
'ወበረካቱሁ የሚለውን አለመጨመሩና በሀዲሱ በመጣው ላይ መገደቡ ነው።',


'ሽንት ቤትም ይሁን ሌላ ቦታ ነጃሳነቱ በእርግጠኝነት የታወቀ እስካለሆነ ድረስ ውዱእ '
'ማድረግ ይቻላል። ምክንያቱም እንደሚታወቀው በተለይ በሴራሚክ የተሰሩ ሽንት '
'ቤቶች ሽንትና ሰገራ መጠቀሚያው ቦታ ብቻ ካለሆነ ሌላው በዙሪያው ያለው '
'ወለሉ በአብዛህኛው ጡሀራ ነው። ብቻ ቦታው ጡሀራ የሆነ አካባቢና ቦታ ላይ '
'ውዱእ ሲያደርግ ከታች ከወለሉ ተስፈንጥሮ ልብሱንም ሆነ ሰውነቱን የሚነካው እርጥበት አይነጅሰውም። ',


'አብዛኛው ኡለሞች ያሉበትና የተስማሙበትም አቋም ለሶላተል ጀናዛ ወደ ቀኝ ብቻ '
'ተዙሮ የሚደርግ አንድ ማሰላመት ብቻ ነው። ሁለት ጊዜ ለመሆኑ የሚያመላክት ግልፅ የሆነ ሀዲስ አልተገኘም።',



'በመጀመሪያ ደረጃ ሸሪዓችን አሚን ማለትን ያልደነገገበት ሁኔታ ካልሆነ በስተቀር በማንኛውም '
'ዱአ ላይ አሚን ማለት የተደነገገ ነው። ከነዚህ ዱአዎች መካከል የጁሙአ ኹጥባ ዱአ አንዱ ነው። '
'በዚህ ወቅት ኸጢቡ ዱአ ሲያደርግ አሚን ማለት ይቻላል።\n '

'ምክንያቱም በዱአ ጉዜ አሚን በማለት ዙሪያ የመጡት ሀዲሶች ጥቅል መልእክት ያላቸው ናቸውና። '
'ነገር ግን እዚህ ዱአ ላይ ድምፅን ከፍ አድርጎ አሚን ማለትም ሆነ በጀመዓ በአንድ ድምፅ '
'አሚን ማለት እንዲሁም እጅን ከፍ ማድረግ አልተደነገገም። መሰረት የሌላቸው ተግባራት ናቸው። ',



'ሱጁድ የሚደረግበት ቦታ አስቸጋሪ ከሆነ ለምሳሌ ቦታው እሾሀማ ከሆነ ፣ አባጣ ጎርባጣ ከሆነ ፣ '
'ድንጋይና ጠጠር ያለበት ቦታ ከሆነና ሌላም በቀጥታ በግንባር ሱጁድ ለመድረግ የሚያስቸግር '
'ቦታ ከሆነ ግንባርን መሸፈንና በጥምጣምም ላይ ይሁን በኮፍያ ላይ ሱጁድ ማድረግ ይፈቀዳል። '
'ባይሆን በላጩ ግንባርን ገልጦ ሱጁድ ማድረግ ቢሆንም ግዴታ ግን አይደለም። '
'ለዚህም በሀዱስ እንደመጣው አነስ ኢብኑ ማሊክ እንዲህ ብለዋል "በሙቀት ወቅት '
'ከነብዩ ሶለሏሁ አለይሂ ወሰለም ጋር እንሰግድ ነበር ፣ አንድኛችን (ከሙቀቱ የተነሳ) '
'ግንባሩን ለሱጁድ መሬት ላይ ማስቀመጥ ሲያቅተው_ልብሱን ይዘረጋና እዛ ላይ ሱጁድ ያደርግ ነበር። '
'ሙስሊም (620) ዘግበውታል',



'አንድ ሙስሊም የግንባሩ ቆዳ ሁኔታ መቀየሩና ጥቁር ነገር መኖሩ ብዙ የሚሰግድ መሆኑን '
'እንደማያመላክተው ሁሉ ይህ ምልክት አለመኖሩም የማይሰግድ መሆኑን አያመለክትም። '
'ምክንያቱም ይህ የቆዳ መቀየር የግንባራቸው ቆዳ ስስ የሆኑ ግለሰቦች ላይ የሚከሰትና ምንም '
'የማይሰግዱ ሰዎችም ላይ የሚታይ በመሆኑ ይህ ነገር ሰዎችን መለያ አድርጎ መጠቀሙ በሸሪዓችን መሰረት የሌለው ነው። '

'በቁርአን የመጣው \"ከሱጁድ ፋና የተነሳ ፊታቸው ላይ ምልክቶች አላቸው\" '
'የሚለው ቆዳ ላይ የሚታይ ነገር መኖሩን የሚያመላክት ሳይሆን ሰውዬው ሱጁድ ባበዛ ቁጥር ፊቱ ላይ '
'የሚታይ የሆነ ብርሀንና ውበትን እንደሆነ ሙፈሲሮች በተለያየ አጋጣሚ አብራርተዋል።',



'በመጀመሪያ ደረጃ ኢስላም ሶፍን በማስተካከል ላይ ማስተካከሉ ምን '
'ያክል ትሩፋት እንዳለው በመግለፅ   ከፍተኛ ትኩረት ሰቷል። '
'ታዲያ ይህ ሶፍ በምን መልኩ ነው የሚደረገው ለሚለው ትክክለኛው የሶፍ አደራረግ '
'የእግርን የኃላ ተረከዝ (ቁርጭምጭሚት) ከጎን ካለው ሰጋጅ ጋር እኩል አደርጎ '
'ማነካካት እንጅ የእግር የፊት ጣቶችን እኩል ማድረግ አይደለም። ምክንያቱም የእግር ጣቶች '
'እርዝመትና የእግር እርዝመት ከሰው ወደ ሰው ሲለያይ የሁሉም ሰው ቁርጭምጭሚት ግን በሰውነት '
'ትክክል ስለሆነ የሶፍ ወጣ ገባ ማለት አይኖርም።',



'በጉዞ ላይ ሆኖ ምንም ውሀም ይሁን አፈር የማይገኝበት አካባቢ ላይ እያለ ወይም በቤት ውስጥ '
'ታግቶ እያለ ሶላት ቢመጣበት ዝም ብሎ ያለ ምንም ውዱእ ሶላቱን ይስገድ ፣ ሶላቱም ትክክል ነው። '
'ከሰገደ በኃላ ውሀም ይሁን አፈር ቢያገኝ ሶላቱን መድገም ግዴታ የለበትም።\n\n '

'ምክንያቱም አላህ በብዙ የቁርአን አንቀፆች ላይ ነፍስን ከአቅሟና ከምቾቷ በላይ '
'እንደማያስገድዳትና አሏህ ያዘዘንን ተግባራት በቻልነው አቅም እንድንፈፅም ማዘዙ ተጠቃሽ ነው። '
'ከዚህ በመነሳት ከአቅማችን በላይ በሆነና ያልቻልነው ነገር ይቅር እንደሚባልልን ያመለክታል።ለዚህ '
'ደግሞ አሏህ ውዱእ ወይም ተየሙም እንድናደርግ ቢያዘንም ይህን ማድረግ አቅሙ ስለሌለን ያለን አቅም '
'ደግሞ ሶላቱን በወቅቱ መስገድ ነውና ይህንን የአቅማችንን መስራት እንጂ ውዱእ ባለማድረጋችን ወንጀለኛ አንሆንም።',



'በመጀመሪያ ደረጃ በሸሪዓችን የተከለከለው የተሰዊር (የስእልና የፎቶ) አይነት ሩህ ያላቸውን '
'አካላት እንጅ እንደመስጂድ አይነት ሩህ የሌላቸውን ግኡዝ አካላትን መሳልና ማንሳት የተከለከለ አይደለም። '
'በመቀጠል ካዕባም ይሁን ሌላ ማንኛውም መስጂድም ይሁን ሌላ ስእል ያለበት መስገጃ '
'ምንጣፍ ላይ መስገድ በሸሪዓችን ይጠላል። ይህም የሆነበት ምክንያት ይህ ስእል ከፊት '
'ለፊቱ ከሆነ ሰጋጁን እንዲወሳወስና ሀሳቡ እንዲሰረቅ ስለሚያደርገው ነው። \n\nለዚህም የሚከተለው ሀዲስ ማስረጃ ይሆናል: '
'\" ዓኢሻ ረዲየሏሁ አንሀ እንዲህ ትላለች: "ነብዩ ሶለሏሁ አለይሂ ወሰለም መስመርና_ምልክቶች '
'ያለበት ልብስ ላይ ሰገዱ ፣ ወደ ምልክቶቹም ተመለከቱ ፣ ሶላቱንም እንደጨረሱ እንዲህ አሉ \" '
'ይህን ልብስ ወደ አቢ ጀህም ይዛችሁት ሁዱና ሌላ (ወፍራምና ልሙጥ) ልብስ ይዛችሁልኝ ኑ" አሉ። '
'(ቡኻሪና(373) ሙስሊም(556)) ዘግበውታል',



'በሸሪዓችን አዲስ ሲፍ የሙጀመርበት ሱናው ቀጥታ ከኢማሙ ኃላ ባለው ቦታ ትክክል ሲሆን ፣ '
'ከዛም ከቀኝና ግራ በኩል እየተደረደሩ ይሄዳሉ። ለዚህም አቡዳውድ (681) በዘገቡት ሀዲስ '
'ላይ ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል: \"በኢማሙ ኃላ መካከል ላይ ሁኑ ፣ ክፍቶቹን ዝጋጉ።\" '
'ሲፍን ከማስተከሰከል ውስጥ የመጀመሪያው ሶፍ ሳይጠናቀቅ አዲስ ሶፍ አለመጀመር ፣ '
'ቦታ ካለ ከኃላ የሚመጣ ሰው ሶፋ መሀል መግባት ከፈለገ ከፈት ማድረግ ይገኙበታል።',



'በሸሪዓችን አዲስ ሲፍ የሙጀመርበት ሱናው ቀጥታ ከኢማሙ ኃላ ባለው ቦታ ትክክል ሲሆን ፣ '
'ከዛም ከቀኝና ግራ በኩል እየተደረደሩ ይሄዳሉ። ለዚህም አቡዳውድ (681) በዘገቡት ሀዲስ ላይ '
'ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል: \"በኢማሙ ኃላ መካከል ላይ ሁኑ ፣ ክፍቶቹን ዝጋጉ።\" '

'ሲፍን ከማስተከሰከል ውስጥ የመጀመሪያው ሶፍ ሳይጠናቀቅ አዲስ ሶፍ አለመጀመር ፣ '
'ቦታ ካለ ከኃላ የሚመጣ ሰው ሶፋ መሀል መግባት ከፈለገ ከፈት ማድረግ ይገኙበታል።',




'በሸሪዓችን እጅ ጣቶች የሚደረጉ ማንኛውንም አዝካሮች ማድረግ በላጩ_በቀኝ እጅ ነው። '
'ለዚህም ቡኻሪና ሙስሊም በዘገቡት ሀዲስ እንደመጣው ነብዩ ቀኝ እጃቸውን ለጥሩ ነገር '
'ይጠቀሙ እንደነበርና ግራን ደግሞ ከዛ ውጭ ይጠቀሙ እንደነበር መዘገቡ በላጩ በቀኝ መሆኑን '
'ያመለክታል። ነገር ግን በግራ እጅም ማድረግ ሀራም ወይም ቢድዓ ደረጃ የሚያደርስ ተግባር አይደለም።',



'የዚህ አይነቱን አዛን መመለስ በሸሪዓችን ያልተደነገገ በመሆኑ ተገቢ አይደለም።ምክንያቱም ይህ ሙአዚኑ '
'በዚሁ ወቅት ያደረገው አዛን ሳይሆን ከዚህ ቀደም አንዴ አድርጎት የተቀረፀ በመሆኑ ነው። '
'ሙአዚኑ በሰአቱ አዛን ያደረገው እንጅ የድሮ ቀረፃ ለአሁን ሊሆን አይችልም። '
'ነገር ግን ከዚህ ውጭ በአካባቢው በሚገኝ መሰጂድ የሚደረገውን አዛንም ይሁን በቴሌቪዥንም '
'ሆነ በሬድዬ በቀጥታ ስርጭት የሚለቀቁትን አዛኖች መመለስ የሚፈቀድና የሚወደድ ተግባር ነው። '
'ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል: "ሙአዚኑን ከሰማችሁት እሱ የሚለውን ተመሳሳይ '
'በሉ ፣ ከዛም በእኔ ላይ ሶለዋት አውርዱ ...\" '
'(ሙስሊም (577)) ዘግበውታል',



'ከፋቲሀ ቀጥሎ ያሻውን ሱራ መቅራት በፈርድ ሶላትም ይሁን በሱና ሶላት ፣ '
'ድምፅ ከፍ በሚደረግባቸውም ሶላቶች ይሁን ድምፅ በማይሰማባቸው ሶላቶች ፣ '
'የኢማሙ ሶላት ያመለጠውም ይሁን ያላመለጠው ለሁሉም ሰው ሱና እንጅ ግዴታ አይደለም። '
'ለዚህም ሲባል አቡ ሁረይራ እንዲህ ይላሉ: \"ነብዩ ሶለሏሁ አለይሂ ወሰለም ያሰሙንን '
'ነገር እናሰማችኋለን ፣ እሳቸው የደበቁንን ነገር እንደብቃችኃለን ፣ የኪታብ እናትን (ፋቲሀን) '
'የቀራ በርግጥም ታብቃቃዋለች ፣ ከዚህም በላይ የጨመረ በላጭ ነው።\" '
'(ቡኻሪ (738) ፣ እና ሙስሊም (396)) ዘግበውታል',




'ያመለጠ ሶላትን ያለ_ወቅቱ ሲሰገድ ማለት የሌሊት ሶላት በቀኑ የቀኑ ሶላት ደግሞ '
'በሌሊቱ ቀዷ ሲወጣ የአቀራሩ ሁኔታ ላይ በኡለሞች መካከል ሁለት አይነት አቋም አለ። \n\n '

'እሱም ከፊል ኡለሞች መመዘኛው ቀዷ_የሚያወጣበት ወቅት ነው ሲሉ ማለትም የሌሊት '
'ሶላትን በቀን ቀዷ ካወጣ እንደቀን ሶላቶች ድምፁን ከፍ አያደርግም። እንዲሁም የቀን '
'ሶላትን በሌሊት የሚሰግድ ከሆነም እንደሌሊቱ ድምፁን ከፍ ያደርጋል። ይላሉ። ለምሳሌ '
'ዝሁርን ሌሉት ቀዷ የሚያወጣ ከሆነ እየጮኸ ነው የሚቀራው ማለት ነው። \n\n'
'የከፊል ኡለሞችና በላጩና የተሻለው አቋም ደግሞ መመዘኛው ያመለጠው ወቅት ነው ፣ '
'ማለትም ሶላቱ በወቅቱ ቢሆን ኖሮ በሚሰገድበት ሁኔታ ነው የሚሰገደው። ለምሳሌ የቀን '
'ሶላት ሌሊት ቀዷ ቢያወጣ እንደቀኑ ድምፁን ዝቅ አድርጎ ነው የሚቀራው ፣ የሌሊቱን ሶላት '
'በቀን ቀዷ የሚያወጣ ከሆነም እንደሌሊቱ በቀኑ እየጮኸ ነው የሚቀራው። '
'ምክንያቱም ቀዷ ሶላት ከዋናው ሶላት ጋር ተመሳሳይ መሆን አለበትና። \n\nበዛም ላይ ነብዩ '
'ሶለሏሁ አለይሂ ወሰለም ከሶሀቦቻቸው ጋር ጉዞ ላይ ሁነው እያሉ በፈጅር ወቅት ሲተኙ ፀሀይ ከወጣ '
'በኃላ ሱብሂን ሲሰግዱ ልክ በወቅቱ እንደሚሰግዱት እየጮሁ ይሰግዱ እንደነበር ትክክለኛ ዘገባዎች '
'መተዋልና ነው። ነገር ግን ከላይ የተጠቀሰው ሁሉ በላጩንና የተወደደውን ለመጥቀስ ያክል '
'እንጅ በየትኛውን መልኩ ቢሰግድ (ጩሆም ይሁን ሳይጮህ ቢቀራ) ሶላቱ ትክክል ነውና ተቀባይበት አለው። ',



'ለአቅመ አደም ያልደረሰ ማለትም ከ7 አመት በላይ የሆነው ግን የዘር_ፈሳሽ በማየትም '
'ይሁን እድሜው 15 በመሆን ሸሪዓዊ ድንጋጌዎችን የመገደድና ወንጀሎችም ጭምር '
'በመላኢካዎች መፃፍ ደረጃ ላይ ያልደረሰ ህፃን ልጅ ኢማም ሆኖ ማሰገዱ ዙሪያ ላይ '
'በኡለሞች መካከል ልዩነት ያለበት ርእስ ነው። '
'እሱም ከፊል ኡለሞች ኢማም ለመሆን አዋቂ ማለትም ለአቅመ አደም የደረሰ መሆን አንዱ '
'መስፈርት ነው ስለሚሉ የህፃን ልጅ ኢማምነትን አይቀበሉም። ሌሎች ደግሞ በግዴታ '
'ሶላቶች ላይ እንጅ በሱና ሶላት ላይ ህፃን ማሰገድ ይችላል ይላሉ። \n\n'
'የከፊሎቹ ኡለሞች አቋም የሆነውና በላጩም አቋም ግን ህፃኑ ልጅ በትክክል ሶላቱን መስገድ '
'እስከቻላና በዙሪያው ካሉ ሰዎች በተሻለ መልኩ ቁርአንን መቅራት የሚችል እስከሆነ ድረስ በፈርድም '
'ሶላት ይሁን በሱና ሶላት ማሰገድ ይችላል።ምክንያቱም ነብዩ ሶለሏሀየ አለይሂ ወሰለም በሀዲሳቸው '
'እንደገለፁት "ከእንናንተ መካከል በቁርአን ይበልጥ አንባቢው ይምራችሁ" ብለዋል①። ታዲያ እዚህ '
'ሀዲሳቸው ላይ የእድሜ ገደብ ሳያስቀምጡ እንዲሁ በጥቅሉ ነውና ያስቀመጡት ትልቅ ሰው መሆን መስፈርት አይደለም።',



'በመጀመሪያ ደረጃ ፈርድ ሶላት የሚሰግድ ሰው ሱና ሶላት በሚሰግድ ሰው መከተል ይችላል። '
'ለዚህም በሀዲስ እንደመጣው ሶሀብዩ ሙዓዝ ኢብነየ ጀብል ረዲዬሏሁ አንሁ ከነብዩ ሶለሏሁ አለይሂ '
'ወሰለም ጋር ዒሻእ ሶላትን ይሰግድና ከዛ ወደ ህዝቦቹ ይሄድና ኢሻ ሶላትን ኢማም ሆኖ ያሰግዳቸዋል ①። '
'ይህም ማለት ይህ ሶላቱ ለነሱ ግዴታ ሶላታቸውን ቢያሰግዳቸውም ለሱ ግን ድጋሜ ስለሆነ ሱና ሶላት ነው። '
'ሰለዚህ ፈርድ ሶላት የሚሰግዱ ሰዎች ሱና ሶላት በሚሰግድ ሰው መከተል እንደሚችሉ ያመለክታል። '
'ከዚህ በመነሳት ሱና ሶላት እየሰገድክ እያለ ሰዎች ፈርድ ሶላት እየሰገድክ መስሏቸው '
'ሊከተሉህ ቢሞክሩ ምርጫ አለህ ማለትም ከፈለክ በምልክት እንዳይከተሉህ ማድረግ ብትችልም '
'አብዛህኛው ኡለሞች ግን ከላይ እንደተጠቀሰው ችግር ስለሌለው ዝም ብሎ ሶላቱን ይቀጥል ፣ '
'እነሱም ይከተሉትና የደረሱትን ያክል ከሱ ጋር ይስገዱ ስለሚሉ ምልክት ማሳየቱ ግዴታ የለበትም።',



'ሶላት ውስጥ መካከል ላይ እያሉ መጀመሪያ የነየቱትን (ያሰቡትን) ኒያ ወደ ሌላ መቀየር በሶስት 3 አይነት መልኩ '
'ሲሆን ሁለቱ የማይፈቀዱ ሁነው አንዱ ብቻ ችግር የሌለው ነው። እነሱም:\n'
'1: ከልዩ ወደ ልዩ ኒያ\n'
'2: ከልቅ ወደ ልዩ ኒያ \n'
'3: ከልዩ ወደ ልቅ ኒያ\n\n'

'1: ከልዩ_ወደ_ልዩ (ልዩ ከሆነ ኒያ ልዩ ወደ ሆነ ኒያ መቀየር): ማለትም ለምሳሌ '
'የአሱርን ሶላት ለመስገድ ነይቶ ሶላቱን መስገድ ከጀመረ በኃላ የዝሁርን ሶላት አለመስገዱ '
'ትዝ አለውና እዛ ሶላት ውስጥ እያለ ኒያውን ወደ ዝሁር ሶላት መቀየር ፣ ወይም ደግሞ '
'የዱሀ ሶላትን ለመስገድ ነይቶ ሶላቱን ከጀመረ በኃላ የሱብሂ ቀብልያን (ሱና) እንዳልሰገደ '
'ትዝ አለውና እዛው ውስጥ እያለ ኒያውን ወደ ሱብሂ ቀብልያ ሶላት ቀየረው ። \n\n'

'በሁለቱም ምሳሌዎች ላይ የተጠቀሱት የኒያ አቀያየሮች ትክክል አይደሉም። ሶላቱም ትክክል '
'አይደለም። ምክንቱም ልዩ የሆነ ኒያ ከሶላቱ ከመጀመሩ በፊት ነው መገኘት ያለበት እንጅ ከጀመሩ በኃላ አይደለም። '

'2: ከልቅ_ወደ_ልዩ (ልቅ ከሆነ ኒያ ልዩ ወደ ሆነ ኒያ መቀየር): ማለትም ለምሳሌ:— '
'ስድ የሆነ ሱና ሶላት እየሰገደ እያለ የሱብሂን ሶላት እንዳልሰገደ ትዝ ሲለው እዛው ውስጥ እያለ '
'ኒያውን ቢቀየር ይህም አይፈቀድም። ምክንያቱም ከላይ እንደተጠቀሰው ልዩ የሆነ ኒያ ከሶላቱ '
'መጀመሪያ ላይ ነው መገኘት ያለበት እንጅ ከጀመሩ በኃላ አይደለምና።\n\n '

'3: ከልዩ_ወደ_ልቅ (ልዩ ከሆነ ኒያ ልቅ ወደ ሆነ ኒያ መቀየር):  ይህም ማለት ለምሳሌ '
'የመግሪብ ሶላት ሱናን አስቦ ሶላት ከጀመረ በኃላ ስድ የሆነ ሱና ሶላት ለማድረግ አሰበና '
'ኒያውን ቢቀይር ወይም ዝሁርን ለመስገድ አስቦ ከቆመ በኃላ የዝሁር ሶላት ለመስገድ መስጂድ '
'የሚገቡ ሰዎች መብዛታቸውን ሲገነዘብ ከነሱ ጋር አብሮ ጀመአ ሶላት ለመስገድ ብሎ ዝሁርን '
'መስገዱን ትቶ ወደ ሁለት ረከአ የሱና ሶላት ለመስገድ እዛው ሶላቱ ውስጥ እያለ ቢነይት ይፈቀድለታል።',




'የሶላተ ተራዊህ የረከአዎች ብዛት ላይ አንዳንድ አካላት ከሀዲሳዊ ማስረጃዎችና ከሰለፎች አረዳድ '
'ባፈነገጠ መልኩ ለሁለት ጫፍ የረገጡ ሀሳቦች ተከፍለዋል። አንደኛው አካል የተራዊህ ረከአ '
'ከአስራአንድ በላይ የጨመረን ቢድአ እንደፈጠረ በመቁጠር በሱ ላይ ሲያጥላሉ በአንፃሩ ሌላኛው '
'አካል ደግሞ በአስራአንድ ረከአ ላይ ብቻ የተገበደንና ከዛ በላይ ያልጨመረን ሰው የኡለሞችን ኢጅማዕ '
'ጥሷል በሚል ምክንያት ይህ አይነቱን ሰው ሲያጥላሉ ይታያል። ሆኖም ሁለቱም ከማስረጃ አንፃር ተገቢ '
'ያልሆኑ በመሆናቸው በዚህ ርእስ ከመጨቃጨቅና ከመነታረክ መቆጠብ ያስፈልጋል። \n\n'
'ይህ ርእስ ከሸሪዓዊ ጥቅሶችና ከሰለፎች አረዳድ አንፃር ሰፋ ያለ ጉዳይ ነው። ይህም ማለት በተራዊህ '
'ረከአ ብዛት ላይ ማንኛውም ሰው የፈለገውን ያክል ረከአ መስገድ ይችላል። ለዚህም ኢብኑ ኡመር '
'በዘገቡት ሀዲስ ላይ አንድ ሰው ነብዩን ሶለሏሁ አለይሂ ወሰለም ስለ ሌሊት ሶላት ሲጠይቃቸው '
'እንዲህ ብለዋል \"የሌሊት ሶላት ሁለት_ሁለት ነው ፣ ከእናንተ አንድኛችሁ የሌሊቱን መንጋት '
'ከፈራ የሰገደውን ሶላት ዊትር የምታደርግለትን አንዲት ረከአ ይስገድ።\" '
'ቡኻሪ (946) እና ሙስሊም (749) ዘግበውታል \n'
'ከዚህ ሀዲስ እንደምንረዳው የሌሊት ሶላት ሁለት ሁለት እያደረጉ መስገድ እንጅ የረከአው ብዛ '
'ልክ አለመጠቀሱ ገደብ የሌለው መሆኑን ያመለክታል። በሌላ ሀዲስ ላይ ነብዩ ሶለሏሁ አለይሂ '
'ወሰለም በረመዷንም ከረመዷን ውጭም  የሌሊት ሶላትን ሲሰግዱ ከአስራአንድ በላይ አይጨምሩም '
'ነበር የሚለው የአኢሻ ሀዲስ ተግባር እንጅ ንግግር ስላልሆነ በኡሱል አል '
'ፊቅህ መመሪያ መሰረት ተግባር ግዴታን አያመለክትም። \n\n'
'ከዚህም በተጨማሪም ታላላቅ የመዝሀብ ባለቤት የሆኑና አሉ የሚባሉ ታላላቅ የሰለፍ '
'ኡለሞችም ይህን ጉዳይ ላይ ሰፋ ባለ መልኩ ነው የተረዱት። ማለትም በሀነፍይ ፣ '
'በሻፊዕያ እና በሀንበሊ መዝሀብ እስከ 20 ረከአ ሲያሰርሱት ፣ በማሊኪ መዝሀብ '
'ደግሞ እስከ 36 እና 34 አድርሰውታል። ሌሎች በጣም በርካታ ኡለሞችና የማሊኪ '
'ከፊል ተከታዬችም 11 ረከአ ላይ መገደብን መርጠዋል። ከዚህ የምንረዳው ጉዳዩ ሰፋ '
'ያለና ማንም ሰው በፈለገው የረከአ ብዛት ልክ መስገድ እንደሚችል ነው። ',




'በቁኑት ዱዓ ላይ እጅን ማንሳት 70 ቃሪዖችን በገደሉት ሙሽሪኮች ላይ ነብዩ '
'ሶለሏሁ አለይሂ ወሰለም ቁኑት ዱዓ ሲያደርጉ እጃቸውን ማንሳታቸው ተዘግቧልና '
'ይፈቀዳል።① እንዲሁም ከኡመር ኢብኑል ኸጧብና ከሌሎችም ታላላቅ ሶሀቦች የተገኘ ነው።',



];

List<String> appTitless3 = [

  'ጎዳና ላይ መስገድ',
  'ሩኩዕ እና የተክቢራ ብዛት',
  'የዊትር ቁኑት',
  'ሰላት ማሳለፍ',
  'ሱጁድ አደራረግ',
  'ሰላት ላይ መጋረጃ',
  'ያለ ውዱዕ መስገድ',
  'የዒሻ ማብቂያ',
  'ሶላተል ጋኢባ',
  'ጣትን ማንቀሳቀስ',
  'ዱዐ',
  'አዛን እየተባለ ማውራት',
  'ጽሁፍ ያለው ልብስ',
  'የጁምዐ ቀብሊያ',
  'አይንን መጨፈን',
  'ዱዐ በአማርኛ',
  'ኢማም',
  'ከሩከዕ መልስ እጅን መልቀቅ',
  'የወገብ መገለጥ',
  'ኹጥባ በአማርኛ',
  'የእግር መገለጥ(ለሴት)',
  'ብቻ መስገድ',
  'የዝሙት ልጅ ኢማምነት',
  'የተሀጁድ አዛን',
  'ሱቢህ ላይ ሁሌ ቁኑት',
  'ሙሳፊር ቂብላው ሲጠፋው',
  'ሶላትን ያለ አዛን መስገድ',
  'ሱጁደ ሰህው ',
  'በሀይድ/ያለ ውዱእ የምስጋና ሱጁድ',
  'ሲያሰላምቱ "ወበረካቱሁ" መጨመር',
  'ሽንት ቤት ውስጥ ውዱእ ማድረግ',
  'ለጀናዛ ሶላት 2 ጊዜ ማሰላመት',
  'ኹጥባ ላይ አሚን ማለት',
  'ጥምጣም ላይ ሱጁድ ማድረግ',
  'ግንባር ላይ የሱጁድ ምልክት',
  'ሶፍ ላይ ተረከዝ ወይስ ጣት',
  'ለውዱእ ውሀም አፈርም ከሌለ',
  'የካዕባ ስእል ያለበት መስገጃ',
  'የሶፍ መጀመርያ',
  '***',
  'ተስቢህ በግራ እጅ',
  'በሞባይል አዛን ጥሪ',
  'ከፋቲሃ ቀጥሎ',
  'ሱቢህን ቀን መስገድ',
  'የህፃን ልጅ ኢማምነት',
  'ሱና ሶላት በሚሰግድ ሰው መከተል',
  'ኒያ መቀየር',
  'የተራዊህ ረከኣ',
  'ቁኑት ላይ እጅን ማንሳት'



];




List<String> sources3 = [


  '',

  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ',

  'ሸይኽ ኢብኑ ባዝ ረሂመሁሏህ',

  ' ኢብኑ ባዝ ረሂመሁሏህ',


  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',

  'ኢማሙ ነወዊይ፣ ሸርሁ ሙስሊም/81 ፣ \n'
  'ጃሚዑ አህካሙ አኒሳእ/354',

  'ኢማሙ ነወዊይ፣ ኪታብ መጅሙዕ 2/84 ፣ ረውዶቱ ጣሊቢን 10/67',


'ኢብኑ ባዝ ረሂመሁሏህ ፣ መጅሙዑል ፈታዊ ',

'የሳኡዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 8/418 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ  ፣ 17/149',


'ሸይኹል አልባኒ ፣ ተማሙል ሚናህ/223 ፣ \n'
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',


'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 15/216',

'ኢብኑል ቁዳማ ፣ ኪታቡል ሙግኑ ፣ 10/ 337 ፣ \n'
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ',


'ኢብኑ ቁዳማ ፣ ኪታብ ከሻፋል ቀናዕ ፣ 1/307',



'ኢብኑ ተይሚያ፣ ፈታዊል ኩብራ ፣\n'
'ኢብኑ ኡሰይሚን ፣ ኑሩን ዓለደርብ ፣ \n'
'ኢብኑል ሀጂ አልማሊኪይ ፣ ኪታብ መድኸል',


'ኢብኑ ቁዳማ ፣ ኪታብ ሙግኒ ፣ 2/30 ፣ \n'
'ሸይኽ ኢዝ አብዱሰላም ፣ ኪታብ ዛዱል መዓድ ፣ 1/283',


'ኢብኑ ተይሚያ ፣ ፈታዊል ኩብራ ፣ 2/424 ፣\n'
'ኢብኑ ባዝ ፣ 11/172',


'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 4/230 ፣\n '
'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 2/28 ፣ \n'
'ኢብኑ ሀዝም ፣ አል ሙህላ ፣ 2/104',


'ኢብኑ ዑሰይሚን ፣ መጅሙኡል ፈታዊ ፣ 161 ፣ \n'
'ኢብኑ ባዝ ፣ መጅሙኡል ፈታዊ ፣ 11/144',


'ኢብኑ ተይሚያ ፣ ሸርሁል ኡምዳ ፣ 34',


'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 8/253 ፣ \n'
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 12/372',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',


'ኢብኑ ዑሰይሚን ፣ ሊቃኡን መፍቱህ ፣ 03',


'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 7/388-387 ፣ \n'
'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙዕ ፣ 4/181 ፣ \n'
'ኢማሙ ሻፊዒይ ፣ ኪታቡል ኡም ፣ 1/193',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',


'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 1/449 ፣\n '
'ኢብኑ ኡሰይሚን ፣ መጅሙኡል ፈታዊ ፣ 14/107',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 10/420',

'ኢብኑ ዐሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 1/125',


'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 14/347',


'ኢብኑ ተይሚያ ፣ ፈታዊል ኩብራ ፣ 5 / 340 ፣\n'
'ኢማሙ ሸውካኒ ፣ ነይሉል አውጧር ፣ 5 / 347 ፣ \n'
'ኢብኑ ሀጀር ፣ ፈትሁል ባሪ ፣ 2 / 554 \n'
'ኢብኑ ባዝ ፣ ፈታዊ ኑሩን አለደርብ ፣ 10/461 ፣\n' 
'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 4/90',



'ኢብኑ ባዝ ፣ ፈታዊ ኑሩን አለደርብ ፣ ካሴት ቁጥር 517',



'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 5/85 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 12/369',


'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 3/418 ፣ \n'
'ኢብኑ ባዝ ፣ ፈታዊ ኑሩን አለደርብ ፣ 14/19',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 17384 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ 16/321 ፣ \n'
'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 10/243',



'ኢብኑ ተይሚያ ፣ መጅሙዑል ፈታዊ ፣ 22/166',



'ኢብኑ ኡሰይሚን ፣ ፈታዊ ኢስላሚያህ ፣ 1 / 484 ',


'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 3–7/13',


'ኢብኑ ሀዝም ፣ ኪታቡል ሙህላ ፣ 1 / 363 ، 364 ',


'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 12/362 ፣ \n'
'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 6/181',


'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙእ ፣ 4/192 \n'
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 12/205 ፣\n'
'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 3/10',


'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙእ ፣ 4/192 \n'
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 12/205 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 3/10',


'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 7 / 105 – 107 ‏፣\n' 
'ኢብኑ ዑሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 13 / 243 ‏',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 10/363 ፣ \n'
'ኢብኑ ዑሰይሚን ፣ መጅሙዑል ፈታዊ ፣ /12 196 ',



'ኢማሙ ነወዊይ ፣ ሸርሁል ሙስሊም ፣ 4 / 105 ، 106 ፣ \n'
'ኢብኑ ዑሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 3 / 103 ',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 26541 ፣ \n'
'ኢብኑ ዑሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 2/140',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 30/166 ‏፣ \n'
'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 7/389 ፣\n' 
'ኢብኑ ዑሰይሚን ፣ ፈታዊ ፣ 15 / 81',


'ኢብኑ ተይሚያህ ፣ መጅሙዑል ፈታዊ ፣ 22 / 258 ‏፣\n '
'ኢብኑ ዑሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 2 / 304 ',



'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 12/347 ',



'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 4/73 - 74 ፣\n' 
'ኢብኑ ተይሚያ ፣ ኪታቡል ኢኽቲያራት ፣ 64 ፣ \n'
'ኢማሙ ሲዩጢይ ፣ መውሱዓቱል ፊቅህያ ፣ 27/142–145 ፣\n' 
'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 1/457 ፣ \n'
'ኢማሙ ነወውይ ፣ ኪታቡል መጅሙዕ ፣ 4/31',



'ሸይኹል አልባኒ ፣ ኢርዋኡል ገሊል ፣ 2/182'



];


List<String> questions3 = [


  'ሶላት መስገድ ከሚከለከልባቸው ቦታዎች መካከል?',

  'ሰውየው ኢማሙ ሩኩዕ ላይ እያለ ቢደርስ አንድ_ተክቢራ ነው የሚያደርገው ወይስ '
  'ለኢህራምና ለሩኩዕ የተለያየ ተክቢራ ነው የሚያደርገው?',


'አንድ ሰው ዊትርን በሚሰግድበት ሰዐት (የዊትር ቁኑት) ማለት ግዴታ ነው?',


'እያወቀ ሶላት ያሳለፈ ይከፍራል?ሳያውቅስ ማለቴ የሶላትን አስፈላጊነትና ግዴታነት ካላወስ?',

'ወደ ሱጁድ ሲወረድ መቀደም ያለበት ጉልበት ነው ወይስ እጅ?',


'ሴቶች መስጂድ በሚሰግዱበት ወቅት ከወንዶች ኃላ ያለ_መጋረጃ መስገዳቸው እንዴት ይታያል፣ ለምሳሌ በየ ትምህርት ቤቶች?',


'ውዱእ እንደሌለው እያወቀ ሶላት መስገድ እንዴት ይታያል?',


'የዒሻ ሶላት ወቅት መጨረሻው ስንት ሰዓት ነው?',


'ሩቅ ቦታ ለሞተ አካል የሚሰገደው ሶላተ_ጋኢብ እንዴት ይታያል፣ በማንኛውም ሰው ላይ ይሰገድበታልን?',

'ሶላት ውስጥ ተቀምጠን ተሸሁድን ስንቀራ ጣታችንን የምናመለክተው አታህያቱ ብለን '
 'ስንጀምር ነው ወይስ አሸሀዱ አላኢላሀኢለሏህ ሰንል ? ይሄን ብታብራሩልኝ...',


'ሶላት ከተጠናቀቀ በኃላ ዱዓ ማድረግና በጀመዓ አሚን ማለት እንዴት ይታያል?',


'ሙአዚኑ አዛን እያለ የጎንዬሽም ሆነ የስልክ ወሬ_ማውራት እንዴት ይታያል?',


'ከጀርባው ፅሁፍ ያለውን ልብስ ለብሶ መስገድ እንዴት ይታያል?',

'አንዳንድ ሰዎች ጁሙዓ ወቅት ላይ መስጊድ ውስጥ ቁጭ ብለው እያለ አዛን ሲደረግ '
'ሱና ሶላት ለመስገድ ይነሳሉ እና ይህ እንዴት ይታያል?',


'ሶላት ስሰግድ አይኔን ጨፍኜ እሰግዳለሁ ይህም ሙሉ '
'ሀሳቤ ወደ ሶላቴ እንዲሆንና እንዳልወሳወስ ብዬ ነው እንዴት ይታያል?',


'ሶላት ውስጥ ሱጁድ ላይ አረበኛ የማይችል ሰው በአማረኛ ወይም በሌላ ቋንቋ ዱአ ማድረግ ይችላልን?',


'አንዳንድ ሰዎች ኢማሙ በህመምም ይሁን በሌላ ምክንያት ቁጭ ብሎ '
'የሚያሰግድ ከሆነ መእሙሙም (ተከታዩም) ቁጭ ማለት አለበት ይላሉ እንዴት ነው?',


'ብዙ ጊዜ ከሩኩዕ ቀጥ ከተባለ በኃላ እጅን የሚለቁም አሉ የሚይዙም አሉ ፣ ትክክለኛው የትኛው ነው?',


'አንድ ሰው እየሰገደ ጎንበስ ሲል ወገቡ አካባቢ ቢገለጥ ሶላቱ ይበላሻልን?',


'አሁን አሁን በአንዳንድ አካባቢዎች አንዳንድ ኢማሞች የጁሙዓውን ኹጥባ '
'በአካባቢው ቋንቋ ተርጉመው ያደርጋሉ ፣ ይህ እንዴት ነው?',


'ሴት ልጅ ሶላት ውስጥ እያለች ምን ምን አካሏን መግለጥ ትችላለች? እግሯን መግለጥሳ?',


'ሰውዬው ኢማሙ ማሰገድ ከጀመረ በኃላ ወደ መስጂዱ ውስጥ ሲገባ ከፊት ያለው ሶፍ '
'ሞልቶ ሲያገኘው ጊዜ ብቻውን ቆመ። ታዲያ ይህ ሶላቱ እንዴት ነው?',


'በዚና የተወለደ ልጅ ማሰገድ ይችላል ወይ?በሽሪዓ እንዴት ይታያል?',


'ለተሀጁድ ሶላት አብዛኛው መሥጊድ አዛን ይደረጋል አንዳንድ መስጊድ '
'አይደረግም ለምንድን ነው የትኛውሥ የተሻለ ነው?',


'አንዳንድ መስጂዶች ሱብሂ ሁሌ ቁኑት (ከሁለተኛው ሩኩእ በኃላ ዱዓ) ያደርጋሉ ፣ '
'እና ይህ እንዴት ነው⁉️ አንዳንዶች አይቻልም ይላሉ ቢብራራልን?',


'አንድ ሰው ሙሳፊር ሆኖ እያለ የሶላቱ ቂብላ በየት በኩል ይሁን ማወቅ ከተሳነውና ' 
'በገመተው አቅጣጫ ከሰገደ በኃላ ቂብላውን እንደሳተ ቢረዳ ሶላቱን መድገም ይችላልን?',


'አዛን ሳያደርግ ሶላት ቢሰግድ ሶላቱ ትክክል ነውን?',


'ሱጁደ ሰህው (የመርሳት ሱጁድ) ከማሰላመት በፊት ነው ወይስ በኃላ?',


'ሱጁድ አሽሹኩር ያለ ወዱእ ወይም ሀይድ ላይ ያለች ሴት መዉረድ ትችላለች?',



'ሶላቱ ሲጠናቀቅ አሰላሙአለይኩም ወራህመቱሏህ ከሚለው ቀጥሎ ወበረካቱሁ ብለው ' 
'የሚጨምሩ እንዳንድ ኢማሞች አሉ ይህ እንዴት ነው?',


'ባኞ ቤት (ሽንት ቤት እና ሻወር ያለው) ዑዱ ማድረግ እንዴት ይታያል በሸሪአችን?',


'የጀናዛ ሶላት ላይ ያለው ተስሊማ (ማሰላመት) ስንት ጊዜ ነው ወደየትኛው አቅጣጫ?',


'ብዙ መስጂዶች ላይ ኢማሙ ኹጥባ እያደረገ እያለ ዱአ ሲያደርግ ታዳሚው እየጮኸ አሚን '
'ይላሉ ይህ እንዴት ይታያል ፣ ቢድዓስ ይሆናልን?',


'ሱጁድ ሲደረግ ግንባርን መግለጥ ግዴታ ነውን ፣ በጥምጣምና በኮፍያ ላይስ ሱጁድ ማድረግ?',


'በኛ አካባቢ አንድ ሙስሊም ግንባሩ ላይ ጥቁር ነገር ካለው የሱጁድ ምልክት ነው ኑር ነው ይባላል ፣ ይህ እንዴት ነው?',



'ትክክለኛው የሶፍ አስተካከል እንዴት ነው ፣ አንዳንዶች ጣትና ጣቶችን '
'ነው የሚያነካኩት አንዳንዶች ደግሞ ተረከዝ ለተረከዝ ነው ፣ የትኛው ነው በላጩ?',


'ውዱእ ለማድረግ በአካባቢው ውሀም_አፈርም የማይገኝ ከሆነ ምንድን ነው የሚያደርገው ፣ በድንጋይ ይቻላልን?',



'የካእባና የሌሎች መስጂዶች ስእል ያለበት መስገጃ ላይ መስገድ እንዴት ይታያል ፣ ይህስ ከተስዊር አይገባም?',


'አንድ ሰው ጀመአ እየተሰገደ እያለ አንደኛው ሶፍ ሞልቶ ሁለተኛ  ሲጀምር ከየት ነው የሚጀምረው ፣ ከቀኝ ወይስ በኢማሙ ትክክል?',


'አንድ ሰው ጀመአ እየተሰገደ እያለ አንደኛው ሶፍ ሞልቶ ሁለተኛ ሲጀምር ከየት ነው የሚጀምረው ፣ ከቀኝ ወይስ በኢማሙ ትክክል?',



'ከሶላት በኃላ ተስቢህ ሲደረግ በቀኝ እጅ ነው ወይስ በሁለቱም እጆች ይቻላል?',



'በእጅ ስልኮቻችን ላይ የአዛን ወቅት ሲደርስ የሚጮህ አፕሊኬሽን አለ ፣ '
'እና ይህን አዛን ልክ በየመስጂዱ እንደሚደረገው አዛን ቃሉን እየተከታተልን መመለስ እንዴት ይታያል ፣ አንዳንዴም ያለ ወቅቱ ይጮሀል?',


'ሶላት ውስጥ ከፋቲሀ ቀጥሎ ሌላ ሱራ መቅራት ግዴታ ነው ወይስ ሱና?',


'ሱብሂን ሶላት ረፍዶብኝ ፀሀይ ከወጣ በኃላ ስሰግድ እንደሌሊት ሶላቶች ጩሄ ነው '
'መስገድ ያለብኝ ወይስ ቀን ስለሆነ መጮህ የለብኝም?',


'ከ10 አመት በላይ ያልሆነ ህፃን ልጅ ኢማም ሆኖ ሶላት ማሰገዱ እንዴት ይታያል?',


'ሱና ሶላት እየሰገድኩ ከኃላዬ ፈርድ ሶላት የምሰግድ መስሏቸው ቢከተሉኝ ምልክት አሳይቼ '
'ልከልክላቸው ወይስ ዝም ብዬ ሶላቴን ልቀጥልና ይከተሉኝ?',


'ሶላት ውስጥ ኒያን መቀየር ይቻላልን ፣ ከተቻለስ የሚቻለው መች ነው ፣  በምን መልኩ ነው?',


'የሶላተ ተራዊህ ረከአ ብዛቱ ስንት ነው ፣ ከአስራ_አንድ በላይ መጨመር ቢድአ ነውን ፣ እስከማስረጃው ቢብራራልን?',


'የቁኑት ዱአ ላይ እጅን ማንሳት በሸሪዓችን እንዴት ይታያል?',


];