

List<String> texts7 = [

'ከዚህ በፊት በሴት ልጅ ድምፅ ላይ በኡለሞች መካከል ያለው ልዩነት ማየት ያስፈልጋል። '
'እሱም አመዛኙ ንግግር ድምፅን ማጣፈጥና_ማማለል እስከሌለበት ድረስ የአጅነቢ ሴት '
'ድምፅ ዓውረት (የተከለከለ ሀፍረት ነገር)  አይሆንም። ምክንያቱም አላህ በቁርአኑ '
'እንደሚለው "እናንተ የነብዩ ሴቶች ሆይ ... ድምፃችሁን አታለስልሱ፣ ምክንያቱም '
'በልቡ በሽታ ያለበት ሰው ይማረካልና።" (ሱረቱል አሕዛብ፣32)'
'ስለዚህ አስፈላጊ ሆኖ ሲገኝና ውስጡ ማማለልና ማለስለስ ከሌለበት የአጅነቢ ሴትን '
'ድምፅ መስማቱ የሚከለከልና ወንጀለኛ የሚያደርገው አይደለም።\n\n'
'ከዚህ በመነሳት በቻት ወይም በፅሁፍ_መልእክት መገናኘት የግድና አስፈላጊ ሆኖ '
'ከተገኘና ውስጡ ትርፍ_ወሬና አማላይ ቃላት ከሌሉበት አሁንም የሚከለከል አይሆንም። '
'እንኳን ድምፅ_አልባው ፅሁፍ አይደለም ድምፅ ላይ እንኳን ቢበዛ በኡለሞች መካከል ልዩነት ቢኖረው ነው። '
'ነገር ግን ምንም ያክል ከላይ የተጠቀሱት መስፈርቶች ከግምት ውስጥ በማድረግና ሌላ '
'ተጨማሪና ትርፍ ነገራቶችን ሳይጨምሩ አስፈላጊና_አንገብጋቢ ጉዳይ ሲያጋጥም በፅሁፍ መልእክትን '
'መቀያየር ካለመከልከሉ ጋር ከዛ ውጭ ግን በላጩ_መራቁና አለማድረጉ ነው። ምክንያቱም '
'ዲናችን ወደ መጥፎ ነገር የሚወስዱ መንገዶችን በመዝጋት ላይ የተገነባ ነውና።',


'በመጀመሪየ ደረጃ በኡለሞች መካከል ያለው ልዩነት በሴት ልጅ ድምፅ ላይ ያለው ነገር ነው። '
'እሱም አመዛኙና በላጩ ንግግር ድምፅን ማጣፈጥና_ማማለል እስከሌለበት ድረስ '
'የአጅነቢ ሴት ድምፅ ዓውረት (ለአጂነቢ የተከለከለ ሀፍረት ነገር)  አይሆንም። ምክንያቱም አላህ በቁርአኑ እንደሚለው:—\n\n '
'\"እናንተ የነብዩ ሴቶች ሆይ ... ድምፃችሁን አታለስልሱ፣ ምክምያቱም በልቡ በሽታ ያለበት ሰው ይማረካልና።\"'
'[አህዛብ፣32]\n\n'
 
'ስለዚህ አስፈላጊና የግድ ሆኖ ሲገኝና ውስጡ ማማለልና ማለስለስ ከሌለበት የአጅነቢ ሴትን '
'ድምፅ መስማቱ የሚከለከልና ወንጀለኛ የሚያደርገው አይደለም። ለዚህም ነብዩ (ሶለሏሁ አለይሂ ወሰለም) '
'ጋር ሴት ሶሀቦች መጥተው በዲን ጉዳይ ያላቸውን ጥያቄዎችና ቅሬታቸውን ያቀርቡ ነበር።'

'ነገር ግን ይህም ሆኖ እያለ ሴት ልጅ አዛን ማድረግ ፣ ወንዶችን ማሰገድ ፣ ኹጥባ ማድረግ ፣ '
'ሶላቷ ውስጥም ከኢማሙ ችግር ሲፈጠር ተስቢህ አትችልም። '
'ምክንያቱም ድምጳን ማሰማቷ ፊትናና ሌሎች ችግሮችን እንዳይቀሰቅስ ስለሚፈራ ነው‼️\n\n'

'ከዚህም በመነሳት ወንዶች ያሉበት ግሩፕ ውስጥ ሴቷ ድምጷን ቀርፃ መላኳ የግድና በጣም አስፈላጊ '
'ካለሆነ አይቻልም ፣ ለምሳሌ ዲናዊ ጥያቄዎችን ለመጠየቅ መፃፍ ካልቻለችና መፃፍ ብትችልም ከፅሁፍ '
'ይልቅ በድምፅ ይበልጥ ግልፅና የሚብራራ ይሆናል ተብሎ የሚታሰብ ከሆነ ከላይ እንደተገለፀው ድምጷን '
'ሳታማልልና ሳታሳምር በኖርማል አነጋገር መናገር ትችላለች። ነገር ግን '
'አሁንም ቢሆን በፅሁፍ መግለፅ የሚቻል ከሆን በድምፅ የሚከለከል ይሆናል።',


'ሴት ልጅ ትልቅም ትሁን ህፃን የግዴታ ካልሆነና አስፈላጊ ካልሆነ ለምሳሌ ለህመም፣ '
'ለመድሀኒትና ለሌሎች አስገዳጂ ሁኔታዎች ካልሆነ በስተቀር መላጨት አይፈቀድላትም፣ '
'ምክንያቱም ከወንዶች ጋር ተሸቡህ ( መመሳሰል) ስለሚሆን።',



'በመጀመሪያ ደረጃ ሜክአፕ መሰራት ቆዳን የማይጎዳና ለባልና ለዘመዶች እንጂ አጂነቢ ወንዶች '
'ፊት እስካልሆነ ድርሰ የሚከለከል አይሆንም። ሴት ልጅ አደባባይ ይዛው አትውጣ እንጂ ማንኛውንም የመዋቦያ ነገር መጠቀም ትችላለች። '

'ከዚህ በመነሳት ሜክአፕ መስራትም ከዚህ ውስጥ ይገባል። ማለቴ የምትሰራው ልጅ አጂነቢ ወንድ '
'ፊት ልታሳየው እንደሆን እስካላወቀች ድረስ ብትስራ አትከለከልም። ከዚህም በላይ ለምንድን ነው '
'የምትሰሪው ብላ መጠየቅም ግዴታ አይሆንባትም። ነገር ግን ከራሷ መጥቶ ለአጂነቢ ነው '
'ምናምን ብላ ከነገረቻት መስራት አትችልም፣ ምክንያቱም በመጥፎ ነገር ላይ መተባበር ነውና።',


'የጀነበችው ሀይድ ላይ እያለችም ይሁን ሀይድ ከማየቷም በፊት ጀንባ ከዛ ሳትታጠብ ሀይድ ብታይም መታጠብ '
'ያለባት ሀይዷን ስትጨርስ ነው፣ ለሁለቱም አንድላይ ነው የምትታጠበው፣ ለዚህም ደግሞ '
'ሁለቱንም አብራ መነየት ትችላለች። ካልሆነም አንድኛውንም ብትነይት ለሁለቱም ያብቃቃላታል። '
'ለምሳሌ ለሀይድ ብላ ብትታጠብ ጀናባውም አብሮ ይወርዳል። ',


'የተጣበቀ ልብስ መልበስ ሴቶች ፊትም ይሁን የትም የተከለከለ ነው '
'ምክንያቱም ከካፊሮች ጋር መመሳሰል ስለሆነ፣ ይህ ደግሞ በየትኛውም መልኩ የተከለከለ ነው። '

'ሱሪ ግን በጣም የማያጣብቃትና የሰውነት ቅርጷን በደንብ የማያሳይ ከሆነ ፣ '
'ከወንዶች ጋርም ሆነ ከካፊር ሴቶች ጋር የማይመሳሰል ከሆነና ሰፊና '
'ወፍራም እንዲሁም ከስሩ ሌላ ልብስ ካለው ሴቶች ፊት መልበሷ ችግር የለውም።',



'በዚህ ጉዳይ ላይ ዑለሞች መካከል ልዩነት ቢኖርም አመዛኙና_በላጩ ግን ሀይድም ላይ ይሁን ኒፋሳ (የወሊድ ደም) '
'ላይ ያለች ሴት እንደማንኛውም ሰው ቁርአን መንካት ባይፈቀድላትም ቁርአን በቃሏ መቅራት ትችላለች። '
'ቁርአን መቅራት እንደሌለባት የሚያመለክተው ሀዲስ በጣም ዶዒፍ ነው። '

'የጀነበ ሰው በቃሉም ቢሆን መቅራት መከልከሉ የሚቆይበት ጊዜና ለመታጠብ የሚቆየው ወቅት አጭር ስለሆነ ነው፣ '
'ሀይድና ኒፋሳ ግን ብዙ ጊዜ ስለሚቆይ ያን ሁሉ ጊዜ በቃል እንኳን ከቁርአን '
'እንድትርቅ ማድረግ ይሆናልና በጀናባ ቂያስ አድርጎ ማመሳሰል አይቻልም።',



'ሴት ልጅ የሰርጓ ቀን ነጭም ይሁን ሌላ ከለር ያለው ሴቶች የሚለዩበትን ልብስ ከካፊር ሴቶችና፣ '
'ከወንዶች ጋር የማይመሳሰል ፣ የሰውነት ቅርጷን የማያሳይ ፣ አካሏን የሚሸፍን ፣ '
'ፊቷን የማያሳይ እና ብልጭልጭና ሳቢ ነገራቶች የሌሉበት እስከሆነ ድረስ መልበስ ትችላለች።'

'ቬሎ ተብሎ የሚጠራውም ነገር ከላይ የተጠቀሱትን መስፈርቶች እስካሟላ ድረስ የሚከለከል አይሆንም። '
'ከካፊሮች ጋር ያመሳስላል ለሚባለው ደግሞ በአሁኑ ሰዓት የካፊሮች ብቻ መለያ መሆኑ '
'ስለቀረና ሙስሊም ሴቶችም በስፋት እየተጠቀሙት ስለሆነ ከካፊር ሴቶች ጋር መመሳሰል ውስጥ አይገባም። ',




'የወር_አበባም ላይ ይሁን የወሊድ ደም ላይ ያለች ሴት ከዚህ ደም እስክትጠራ ድረስ ግኑኝነት '
'ማድረግ ፈፅሞ አይፈቀድላትም‼️ ለዚህም አላህ በቁርአኑ እንዲህ ይላል;—'

'\"ስለ ወር_አበባ ይጠይቁሀል፣ እንዲህም በላቸው፣ እርሱ የተበከለ ነው፣ ሴቶችን በወር አበባ ጊዜ '
'(ከግኑኝነት) ራቋቸው፣ ንፁህ እስከሚሆኑ ድረስ አትቅረቧቸው፣ ንፁህ በሆኑም ጊዜ አላህ '
'ባዘዛችሁ ስፍራ ተገናኟቸው፣ አላህ ከ(ሀጢአት) ተመላሾችን ይወዳል፣ ተጥራሪዎችንም ይወዳል።\"'
'[ሱረቱል በቀራ ፣ 222]\n\n'

'በዚህም ወቅት ከሚስቱ ጋር ግኑኝነት ያደረገ ባል ከባድን ወንጀል ፈፅሟል፣ ወደ አሏህ '
'ተፀፅቶ ሊመለስ ይገባዋል። አንደንድ ኡለሞችም እንደሚሉት በዚህ ሰው ላይ የአንድ ወይም '
'የግማሽ ዲናር ከፋራ (ወንጀል ማሳበሻ ቅጣት) አለበት። ሁለቱም አላህን ሊፈሩ ይገባል።',




'የእህት ባል መህረም/ ማግባት የማይቻል የቅርብ ዘመድ አይደለም። ለሚስቱ እህት አጂነቢ ነው። '
'ምክንያቱም ለጊዜው የሚስቱን እህት ማግባት ባይቻልለትም፣ ሚስቱን ከፈታት ወይም '
'ከሞተች የሷን እህት ማግባት ይፈቀድለታልና። ለዚህም ሲባል ከሷ ጋር የሚኖረው ግንኙነት ልክ እንደማንኛውም አጂነቢ ወንድ ነው።',



'ባልሽ ለአባትሽ ሚስት አጂነቢ እንደሚሆነው ሁሉ የአባት_ሁለተኛ_ሚስት_አባትም '
'(የእንጀራ እናት አባት) አጂነቢ ነው። ከሱ ጋር ብቻ_ለብቻ መቀመጥም ሆነ እሱ '
'ፊት ያለ ሙሉ ፊትን መግለጥና ያለ ሙሉ ሂጃብ መታየት የማይፈቀድ ነው‼️ ' ,



'አራቱም መዝሀቦች የተስማሙበትና አብዛኞቹ ዑለሞችም እንደሚሉት አጂነቢ '
'ወንድን መጨበጥ ሀራም ነው‼️ ለዚህም ዓኢሻ ባወራቺው ሀዲስ ላይ እንዲህ ብላለች;—'

'\"ነብዩ በእጃቸው ለሙባየዓ (ለቃልኪዳን) እንኳን አንድም ሴት ነክተው አያወቁም፣ በቃል ነበር ቃልኪዳን የሚፈፅሙት።\"'
'ቡኻሪ ዘግበውታል '

'በሌላም ሀዲስ እንዲሁ አዒሻ እንደተናገረቺው "የነብዩ (ሶለላሁ ዓለይሂ ወሰለም) '
'እጅ ያገቧትን ሴት እንጂ የማንንም ሴት እጅ ነክታ አታውቅም።" ብላለችና አይቻልም።',



'በበሽታ ደም ወቅት ዒባዳ (ሶላትና ፆም) መፈፀም የሚቻል ከሆነ ግኑኝነት ማድረግ ደግሞ '
'ይበልጥ የሚቻል ነው። ምክንያቱም ብትከለከል ኖሮ ኢባዳም (ሶላትና ፆም) ትከለከል ነበር ፣ '
'ግኑኝነት ደግሞ ከዒባዳ ያነሰ ነው። በዛ ላይ በሀዲስ አንደመጣው '
'ሀይድና የበሽታ ደም የተለያዩ ስለሆነ እንደ ሀይድ አይነት ፍርድ አይኖረውም።',



'ኒቃብ መልበስን በተመለከተ በኡለሞች መካከል ሰፋ ያለ ልዪነት አለበት። ከዚህም መካከል '
'ኢማሙ አህመድና ኢማሙ ሻፊዒይ አጂነቢ ፊት እጅንና ፊትን መሸፈን ግዴታ ነው ይላሉ። '
'አቡ ሀኒፋ ደግሞ ግዴተሰ አይደለም ይላሉ። ብቻ በጥቅሉ በላጩ አቃም ግን ግዴታ መሆኑ ነው። '
'ለዚህም የሚከተሉት ማስረጃዎች ይገኛሉ። አላህ እንዲህ ይላል:\n\n'

'\" አንተ ነብይ ሆይ ፣ ለሚስቶችህ ፣ ለሴቶችህ ፣ ለልጆችህም ፣ ለምእመናን ሚስቶችም '
'ከመከናነቢያዎቻቸው በላያቸው ላይ እንዲለቁ ንገራቸው። ይህ '
'እንዲታወቁና (ባለጌዎች) እንዳይደፍራቸው ለመኾን በጣም የቀረበ ነው።\" '
'[ሱረቱል አህዛብ ፣ 59]\n\n'

'\" እቃንም (ለመዋስ) በጠየቃችኃቸው ጊዜ ከመጋረጃ ኃላ ሁናችሁ ጠይቋቸው። ይህ ለልቦቻችሁና ለልቦቻቸው የበለጠ ንፅህና ነው።\"'
'[አህዛብ ፣ 53]\n\n'

'\"ጉፍታዎቻቸውንም በአንገትያዎቻቸው ላይ ያጣፉ።\" '
'[ሱረቱ ኑር ፣ 31]\n\n'

'እንዲሁም በሀዲስ ሀጅ ላይ ያለች ሴት ፊቷን እና እጇን መሸፈን '
'የለባትም ማለታቸው ከዛ ውጭ መልበስ እንዳለባት ያመለክተናል።',



'እንደሚታወቀው ቅንድብን መቀንደብም ሆነ ማስቀንደብ አላህ የረገመው ተግባር ለመሆኑ ሀዲስ መቷል። '
'ይህም ተግባር የቅብድብን ሙሉውንም ይሁን የተወሰነ ፀጉር በመንቀልና_በማሳጠር የሚተገበር ተግባር በመሆኑ የተከለከለ ተግባር ነው።\n\n'

'ታዲያ ይህን ፀጉር ሳይነቅሉ እንዳለ ቅርፁን ብቻ በቀለም ማስተካከል በዑለሞች መካከል '
'ልዩነት ያለው ጉዳይ ቢሆንም በላጩና ከጥንቃቄም አንፃር የተሻለው አቋም ግን አለማደረጉ ነው። '
'ይህም ምናልባች ከካፊር ሴቶች ጋር መመሳሰል ስለሚያስይዝና የአላህን ፍጥረት መቀየር ውስጥ ይገባል በሚል ነው። '

'ሆኖም በአደባባይ ለአጂነቢ ወንዶች ግልፅ እስካልሆነ ድረስና ከካፊር ሴቶች ጋር መመሳሰል እስካልኖረበት ድረስ ችግር የለውም።',



'በሸሪዓችን ለወንዶች ቀብርን መዘየር ተከልከሎ ከነበረበት እንደገና የተፈቀደና የሚወደድ ተግባር ነው። '
'ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋልና:—'

'\"ቀብርን ከመጎብኘት (ከመዘየር)  ከልክያችሁ ነበር ፣ (አሁን) ጎብኟት ፣ ምክንያቱም አኼራን ታስታውሳችኃለችና።\" '
'[ሙስሊም ዘግበውታል]\n\n'

'ለሴቶች ግን በሀዲስ በግልፅ እንደመጣው የተከለከለ እና የአላህ እርግማንም '
'ያለበት ተግባር ነው። ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል:— '

'\"አላህ ቀብርን የሚዘይሩ ሴቶችንና (ቀብሩ ላይ) መስጂድ እና መብራት የሚያደርጉ ሰዎችን አላህ ረግሟቸዋል (ከራህመቱ አርቋቸዋል)።\"'
'አህመድ እና አቡዳውድ ዘግበውታል',


'ይህ ጉዳይ በኡለሞች መካከል ልዩነት ያለበት ቢሆንም አጂነቢም ይሁን መህረም ማንኛውንም '
'ተቃራኒ ፆታን በስሜትም ይሁን ያለ_ስሜት መንካት ውዱእ አያስፈታም። ለዚህም በሀዲስ ብዙ '
'ቦታዎች ላይ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) ሚስቶቻቸው ጋር በእጅም ይሁን በሌላ ሰውነት '
'ተነካክተው ነገር ግን ውዱዕ ሳያደርጉ ሶላት የሰገዱባቸው ብዙ አጋጣሚዎች አሉ። ከነዚህ ሀዲሶች መካከል አዒሻ ረዲየሏሁ አንሀ እንዲህ ትላለች:—'

'\"ነብዩ (ሶለሏሁ አለይሂ ወሰለም) ከፊል ሚስቶቻቸውን ስመው ውድእ ሳያደርጉ ወደ ሶላት ወጥተዋል።\"'
'አቡ ዳውድ ፣ 179',



'ሀይድ ላይ ያለች ሴት ለምንም ይሁን ለምን መስጂድ ውስጥ መቀመጥ አይፈቀድላትም። '
'ነገር ግን ይንጠበጠባል ብላ ካልስጋች በመስጂዱ አካባቢ ማለፍ ትችላለች። ለዚህም ኡሙ ዓጢያ ረዲየሏሁ ዓብሀ እንዲህ ብላለች:— '

'\"ነብዩ ሶለሏሁ አለይሂ ወሰለም በሁለቱ ኢዶች ላይ ለአቅመ ሀዋ የደረሱ እና አዲስ ያገቡ' 
'ሴቶችም ቢሆኑ ወደ መስጂድ ይዘናቸው እንድንወጣ አዘውናል። ሀይድ ላይ ያሉትን ደግሞ ከሰጋጆች መስገጃ አካባቢ ራቅ እንዲሉ አዘዙ።\"'
'[ቡኻሪ እና ሙስሊም ዘግበውታል]\n\n'

'ስለዚህ ህይድ ላይ ያሉትን ሴቶች ከኢድ መስገጃ ሜዳ እንዲርቁ ካዘዙ መስጁድ ውስጥ መግባታቸውማ '
'ይበልጥ የተከለከለ ነው። መስጊድ ውስጥ የሚሰጡትን ቁርአቶችን እና ዳእዋዎችን '
'ለመከታተል የሚያመች እዛው ከመስጊዱ ቅርብ የሆነ አካባቢ ካለ ጥሩ ካለሆነ ግን '
'ለሶላት ተከልክሎ ከሱ ባነሰ ነገር ላይ የሚፈቀድ አይሆንም።',


    // part two


'መጀመሪያ በኡለሞች መካከል ልዩነት ያለው ጉዳይ ቢሆንም በላጩ ለአጂነቢ ግልፅ '
'የማይሆንና ራስን የማይጎዳ እስከሆነ ደረስ ሴት ልጅ ማንኛውንም የመዋቢያ ነገር ጆሮዋ '
'ላይ መጠቀም እንደምትችል ነው። ታዲያ ይህ ተግባር ከአንድ ቦታ በላይም ይበሳ ፣ '
'ከላይም ይሁን ከታች የሚበሳው የሚከለክል ነገር እስከሌለ ድረስ ይቻላል።',


'ግርዛት ተፈጥሮአዊ ከሆኑ ሱናዎች ማካከል ነው። ለዚህም ነብዩ ሶለሏሁ አለይሁ ወሰለም) በሀዲሳቸው እንዲህ ብለዋል:— '

'\" አምስት ተፈጥሮአዊ ሱና (በተፈጥሮ የነበሩ ግን ሊወገዱ የሚገባቸው ተግባራት) አሉ: እነሱም መገረዝ ፣'
'የብልት ፀጉርን ማስወገድ ፣ የብብት ፀጉር መንቀል ፣ ጥፍር'
'መቁረጥ እና ቀድሞ ቀመስን (ከከንፈር በላይ ያለን ፀጉር ማሳጠር ናቸው።\"'
'[ቡኻሪ (5550) ፣ ሙስሊም (257)]\n\n'

'ታዲያ መገረዝ በሸሪዓችን ወንድም ሴትንም ቢያካትትም ግዴታነቱ ለወንዱ እንጂ ለሴት ሱና ነው።ታዲያ ሸሪዓችን '
'እንዲሁ በዘፈቀደ ያለ ምንም ጥቅም የሴት ልጅ ግርዛትን የሚወደድ አላደረገውም። '
'በዚህ ዘርፍ ብዙ ጥናት ካደረጉ ዶክተሮች እንደተገኘው በጣም ብዙ ጥቅሞች ስላሉት እንጅ።'

'ከነዚህም መካከል ባለመገረዟ ምክንያት የሚመጣ መጥፎ_ሽታ እንዳያጋጥማት ሰበብ ይሆናል ፣ '
'የተረጋጋች እንጅ ቁጡ እንዳትሆንም የራሱ አስተዋፆኦ አለው። ባለመቆረጡ እያደገ '
'በሚሄድ የሰውነት ስጋ ምክንያት በግኑኝነትም ጊዜ አስከፊ ህመም ስለሚከሰትና ስለሚሰማ ይህ እንዳይሆን ሰበብ ይሆናል።',


'ሴት ልጅ ሶላት ውስጥ ከፊቷ በስተቀር እንዳለ ሙሉ አካሏን የሚሸፍን ልብስ መልበሷ በላጭ ነው። '
'ፊትን ግን በአካባቢው ሊያያት የሚችል አጂነቢ ወንድ ከሌለ ሱናው መግለጡ ነው። አጂነቢ ካለ ግን መሸፈን አለባት። '
'የእጅን መዳፍ በተመለከተ ደግሞ መሸፈኑ በላጭ ቢሆንም መግለጡም ችግር የለውም። '
'ከነዚህ ውጭ ያሉት የሰውነት አካላት ( ራስ ፣ እግር ፣ ደረት እና ሌሎችኝ የሰውነት አካላት በሙሉ) መሸፈን አለባቸው።',



'ድምጷን ካላሳመረችና በሚፈትን መልኩ ቅላፄ ካላደረገችበት እንዲሁም ብቻ_ለብቻ ሁነው ካልሆነና '
'በአካባቢው ከሴቶች ይህን ቂርአቱን መሰማት የምትችል አንድም ሴት ከሌለ  ችግር የለውም ይቻላል። '
'ምክንያቱም አመዛኙን አቋም ካየን የሴት ልጅ ድምፅ ሀፍረት (ለአጂነቡ ግልፅ የማይደረግ) አይደለምና።',



'ሀጅ ሴት ላይ ግዴታ ይሆን ዘንድ መሟላት ካለባቸው መስፈርቶች መካከል አንዱ '
'የሚወስዳት መህረም (መቼም ልታገባው የማትችል ወንድ) ጋር መሄድ መቻል ነው። '
'ስለዚህ ያለ መህረም ሀጂ ማድረግ መስፈርቱ ተጓድሏልና አይፈቀድም። '

'ቡኻሪና ሙስሊም በዘገቡት ሀዲስም "ሴት ልጅ ያለ መህረም ጉዞ እንዳትጓዝ\" የሚል አለ። '
'በዚህ መልኩ ከብዙ ሴቶች ጋርም ሆኖ ሀጅ መሄድ ተገቢ አይደለም። ምክንያቱም ይህ ከመህረም አያብቃቃምና። በሀዲስም አልመጣም።',



'ጨማ ላይ በማበስ ዙሪያ የማበሻ ጊዜው ካለፈ ሲያልቅ አውልቆ እንደ አዲስ መጀመር እንጂ በዛው '
'መቀጠል አይገባውም። ታዲያ ይህ ሳይሆን ቀርቶ በዛው ሳያወልቅ ሶላት ከሰገደ የማበሻ ወቅቱ '
'ካለቀ በኃላ ውዱኡ ፈቶ (ፈርሶ) ከነበረ ውዱኡንም ሶላቱንም መድገም አለበት። ምክንያቱም ውዱእ ሲያደርግ እግሩን አላጠበምና። '

'ገር ግን ምንም ያክል አንዳንድ ኡለሞች የማበሻ ወቅቱ ከተጠናቀቀ ውዱእም አብሮ ይፈርሳል ቢሉም '
'ማስረጃ የሌለው ንግግር ነውና ወቅቱ ካለፈም በኃላ ሶላቱን እስኪሰግድ '
'ድረስ ውዱእ ያልፈታ ከነበረ ከሆነ ሶላቱ ትክክል ነው። መድገም አይጠበቅበትም።',



'የፅንስን ፆታ_ለመለየት የሚጠቀሙት መሳሪያ እና ላቦራቶሪ እንጅ ዝም ብሎ በመተንበይና በመጠንቆል '
'እስካልሆነ ድረስ የሚፈቀድ ይሆናል። አላህም የሚስጥር አዋቂ መሆኑ ጋር አይጋጭም። '
'ምክንያቱም አላህ ሚስጥር ነገራቶችን አዋቂ ነኝ ሲል በመሳሪያና በሌሎች መመርመሪያ '
'ነገራቶች የሚታወቁትን ነገረቶች አያካትትም። የሰዎች ልጆች ሊደርሱባቸው የማይችሉ ነገራቶችን ነው። '

'ነገር ግን የፅንስን ፆታ ማስመርመር ለመደሰት ካልሆነ በስተቀር ብርን '
'ማባከን ካለበትና ያን ያክል ጥቅም ከሌለው ማንኛውም ፆታ ይሁን '
'የአላህ_ስጦታ ስለሆነና ወዶ መቀበልም ግዴታ ስለሆነ መተው በላጭ ነው።',



'ይህ በሁለት መልኩ ሀራም ይሆናል።'

'አንደኛው በሸሪዓችን ወደ ሀራም ነገር የሚያዳርስ ሁሉ ሀራም ነው። በዚህም ሴት ልጅ መኪና '
'በመንዳቷ ፊቷ እንዲገለጥ ፣ መንገድ ላይ በሚያጋጥሟት ትራፊክ ፖሊሶች እና በየመሀሉ '
'መኪናው ሲበላሽም ሆነ ነዳጅ ስላለቀ ማደያዎች ዘንድ በማስሞላት ምክንያት '
'ከአጂነቢ ወንዶች ጋር እንድትቀላቀል ፣ አይናፋርነቷም እንዲጠፋ እና በልቅነት '
'ከቤቷ ርቃ ሩቅ ቦታ እንድትሄድ ስለሚያደርግ እና ወደ ሌሎችም ሀራም ነገራቶች መዳረሻ ስለሚሆን ይከለከላል። '

'ሁለተኛው ደግሞ የሆነ ጥቅምን ከማምጣትና ከማስገኘት በፊት ጉዳትን መከላከል ይቀደማል። '
'በዚህም ሴት ልጅ መኪና በመንዳቷ ከምታገኘው ጥቅም ይልቅ ከላይ የተጠቀሱትን ጉዳቶች መካከል ይቀደማልና የሚከለከል ተግባር ይሆናል።',




'ይህ ጉዳይ የኡለሞች ልዩነት ቢኖረውም በላጩና አመዛኙ አቋም ግን ለሱጁደ ሹክርና '
'ለሱጁደ ቲላዋ ውዱእም ሆነ ጡሀራ መሆነ መስፈርት አይደሉም። ለዚህም '
'ሀይድም ላይ ያለች ሴት ይህን ማድረግ ትችላለች። ምክንያቱም በዚህ ዙሪያ '
'የመጡት ሀዲሶች ላይ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) አንድም ጊዜ ውዱእ '
'እንዲያደርጉ አለማዘዛቸውና ሙሽሪኮችም አብረው ሱጁድ ማድረጋቸው ውዱእ መስፈርት እንዳልሆነ ያመለክተናል።',



'ሴት ልጅ እግራን ሶላት ውስጥ መሸፈኗ ጉዳይ ላይ በኡለሞች መካከል ሰፋ ያለ ልዩነት ያለበት '
'ጉዳይ ቢሆንም ከጥንቃቄ አንፃር እና ከልዩነትና ከጥርጣሬ ከመውጣትም አንፃር መሸፈኑ በላጭ ነው። '
'ይህ በቤት ውስጥ አጂነቢ በሌለበት ሁኔታ ነው። ነገር ግን በዙሪያዋ ሊያዩዋት የሚችሉ አጂነቢ ወንዶች ካሉ መሸፈኑ ግዴታ ነው።',


'መህረም ማለት ለአንዲት ሴት ልጅ በስጋም ይሁን በጥቢም ይሁን በአማችነት የቅርብ '
'ዘመዶቿ  ሁነው አጂነቢ የማይሆኑኗትና መቼም ሊያገቧት የማይችሉና እነሱ ፊትም ሂጃብ መልበስ ግዴታ የማይሆኑባት ናቸው።'
'እነዚህም ወንዶች: አባት ፣ አያትና ወደ ላይ ቢቆጠርም ፣ ልጅ ፣ የልጅ ልጅና '
'ወደ ታች ቢቆጠርም ፣ አጎቶች ፣ አክስቶች ፣ ወንድም ፣ የወንድም ልጅ ፣ '
'የእህት ልጅ ፣ የጥቢ ወንድም ፣ የእናት ባል ፣ የባል አባትና ወደ ላይ ቢቆጠርም ፣ '
'የባል ልጅና ወደ ታች ቢቆጠርም እና የመሳሰሉት ናቸው። ',



'አዎ አንዲት ሴት ፅንሱ በሆዷ ውስጥ እያለም (በእርግዝና ወቅትም) ይሁን '
'በምትወልድበትም ወቅት ይሁን ከወለደች በኃላ የወሊድ ደሟ (ኒፋስ) ላይ '
'ባለችበት ወቅት ላይ ብትሞት በአላህ ፈቃድ እንደ ሸሂድ (ሰማእት) ትቆጠራለች። '
'ለዚህም ነብዩ (ሶለሏሁ አለይሂ ወሰለም) እንዲህ ብለዋል:—'

'\"... በአላህ መንገድ ላይ የሚገደልም ሸሂድ ነው ፣ በወረርሽኝ በሽታ የሞተም ሸሂድ ነው ፣ '
'በተቅማጥም የሞተ ሸሂድ ነው ፣ (ውሀ ውስጥ) በመስመጥም የሞተ ሸሂድ ነው ፣ '
'(በህንፃ) መደርመስም የሞተ ሸሂድ ነው ፣ በእርግዝናና_በወሊድ የሞተችም ሸሂድ ናት።\"'
'[አህመድና (5/315) ፣ አቡዳውድ (3/482) ዘግበውታል]',



'አብዛኛው ኡለማዎች ሴት ልጅ ሀይድ ላይ እያለች ለቂርአትም ይሁን ለዳእዋ መስጂድ መግባቷን ከልክለዋል። '
'ለዚህም እንደማስረጃ የተጠቀሙት ቡኻሪና_ሙስሊም ላይ የተዘገበውን የኡሙ ዓጢያን ሀዲስ ነው። እርሷም እንዲህ ትላለች:'

'\"ነብዩ ሶለሏሁ አለይሂ ወሰለም ሁለቱ የኢድ ቀናት ላይ (ለአቅመ የወር አበባ ማየት) '
'የደረሱ ሴቶችን ይዘን እንድንወጣ አዘውናል። ሀይድ ላይ ያሉ ሴቶችን ደግሞ ከሙስሊሞች መስገጃ ቦታ እንዲርቁ አዘዋል።\"'
'[ቡኻሪ (974) ፣ ሙስሊም (890)]\n\n'


'ይህ ሀዲስ በግልፅ እንደሚያመለክተው ሀይድ ላይ ያሉ ሴቶች እንኳን መስጂድ አይደለም የኢድ '
'መስገጃ ሜዳ የሆነ ልቅ ቦታን እንኳን መራቅ እንዳለባቸው ነው። ነገር ግን ደሙ '
'ይንጠባጠብብኛል ብላ የማትሰጋ ከሆነ ግን በመስጂዱ አካባቢ ማለፍ ይፈቀድላታል።'

'በመስጂድ የሚሰጠውን ዳእዋም ሆነ ቂርአት ማዳመጥ ለሚለው ደግሞ ይህ ፕሪግራም '
'የሚሰጠው በማይክ ከሆነና ከመስጂድ ውጭ መስማት የሚቻል ከሆነ ውጭ '
'ላይ ሆኖ መስማት ይቻላል። ይህም ካልሆነ ደግሞ ዳእዋውንም ሆነ ቂርአቱን በድምፅ ሪከርድ_መቅረፅም ይቻላል።',



'እድሚያቸው የገፋ ሴቶችም ይሁን ያልገፋ ሴቶች አጂነቢ እስከሆኑ ድረስ መጨበጥም '
'ሆነ ብቻ ለብቻ መቀመጥ አይፈቀድም። ምክንያቱም ነብዩ ሶለሏሁ አለይሂ ወሰለም '
'በሀዲሳቸው እንደጠቀሱት "እኔ ሴቶችን አልጨብጥም።" ብለው ባሉበት ሀዲስ ላይ የእድሜ ገደብን አላስቀመጡም። '

'በዚህ ሀዲስ ብቻ ሳይሆን በሌላም ሀዲስ ላይ በእድሜያቸው የገፉ ሴቶችን መጨበጥን '
'የሚፈቀድ ሀዲስ አለመኖሩ ክልከላው ሁሉኑም አጂነቢ የሆኑትን ሴቶች የሚያካትት መሆኑን '
'ያመለክታል። በሌላ ነገር ማሰብ አለማሰብ ጋር አያገናኘውም። መስፈርትም አይደለም።',



'በርግጥ አሏህ ሱብሀነሁ ወተአላ ሰላምታን እንድናበዛ ፣ ሰላምታ ላቀረበ ሰውም ሰላምታን '
'እንድንመልስ ከማዘዙም በተጨማሪ ሰላምታን መለዋወጥ በሙእሚኖች መካከል መዋደድን የሚጨምር አድርጎታል። '

'ታዲያ ይህ ትዝዛዙ ማንኛውንም ሙስሊም ያካትታል። ማለትም ወንድ ከማንኛውም ሙስሊም '
'ወንድ ጋርና የቅርብ ከሆኑ ሴት ዘመዶቹ ጋር ፣ ሴትም ከማንኛዋም ሙስሊም ሴት ጋርና የቅርብ '
'ከሆኑት ወንድ ዘመዶቿ ጋር ማለት ነው። ነገር ግን በሁለት አጂነቢ በሆኑ '
'ወንድና ሴት መካከል የሚኖረው የሰላምታ ሁኔታ ግን ይለያል።\n\n'

'እሱም በመካከላቸው ፈተና ይከሰታል ተብሎ የሚያሰጋ ሁኔታ ካለ ሰላምታ መለዋወጥ አይፈቀድላቸውም። '
'ምክንያቱም በሸሪዓችን ወደ መጥፎ ነገር የሚያዳርስ ነገር በሙሉ የተከለከለ ነው። '
'ስለዚህ ሰላምታ መለዋወጥም ፊትና ያመጣል ከተባለ ኸይር ስራ ቢሆን እንኳን የሚከለከል ይሆናል።'

'ለምሳሌ እሱ ለእሷ ሰላምታ በማቅረቡ ቀስ በቀስ ወደ ሌላ መጥፎ ነገር ሊያመራ ይችላል ተብሎ '
'የሚሰጋ አይነት ከሆነ አይፈቀድለትም። ለዚህም ሲባል በርካታ ኡለሞች ባልቴት የሆነች '
'ሴት እጇን ሳይጨብጡ ሰላምታን ማቅረብን ይፈቅዳሉ። ምክንያቱም '
'ከወጣቷ አጂነቢ ሴት የሚፈራው ፈተና እሷ ጋር ይኖራል ተብሎ የሚሰጋ ስጋት የለምና ነው። ',




'አንዲት ሙስሊም ሴት ካፊር_ሴት ፊት ለፊት ሂጃቧንም ሆነ ፊቷን መግለጥ ዙሪያ በኡለሞች '
'መካከል ልዩነት ያለበት ርእስ ነው። ይህም ልዩነት የተፈጠረውም አሏህ በሱረቱ ኑር አንቀፅ 31 '
'ላይ \"ጌጣቸውንም ለባሎቻቸው ፣ ለአባቶቻቸው ፣ ... ወይም ለሴቶቻቸው፣ ...'
'ካልሆነ በስተቀር አይግለፁ" በሚለው አንቀፅ አረዳድ አማካኝነት ነው።\n\n'

'ማለትም እዚህ አንቀፅ ላይ አሏህ ሙስሊም ሴቶች ከላይ ከተዘረዘሩት አካላት ውጭ '
'ለማንም እንዳይገለጡ ሲናገር "ለሴቶቻቸውም" ሲል ምን ለማለት ተፈልጎበት ነው '
'የሚለው  ከፊል ሙፈሲሮች ሙስሊም ሴቶችን ለማለት ነው ሲሉ ከፊሎቹ ደግሞ '
'አይ በአጠቃላይ ሙስሊም የሆኑትንም ያልሆኑትን ሴቶች ያጠቃልላል ይላሉ።'

'በጥቅሉ ግን ከሌሎች ሀዲሳዊ መረጃዎች አንፃር በላጩ ሁለተኛው አተረጓጎም ነው። '
'ማለትም ስለፀጉሯም ሆነ በአጠቃላይ ስለ ሰውነቷ ሁኔታ ለሌላ አጂነቢ ወንድ '
'ትናገራለች ብላ ካልፈራች በስተቀር ለሙሰሊምም ለካፊርም ሴት ፀጉሯን መገለጥ ትችላለች።\n\n'

'ይህን ከሚያጠናክሩ ማስረጃዎች መካከል አይሁድ የሆነች ሴት አዒሻ ረዲዬሏሁ አንሀ ዘንድ '
'መግባቷና አኢሻም ለሷ መሸፈኗን የሚያመለክት ማስረጃ አለመገኘቱ አንዱ ነው።'
'ሆኖም ካፊር ሴት ፊት ግልፅ የምታደርገው የሰውነት አካሏ ልክ አጂነቢ ያልሆኑ '
'ዘመዶቿ ፊት ግልፅ የምታደርገውን የውዱእ ማድረጊያና የመዋቢያ አካላቶቿን ብቻ ነው። ',



'በርግጥ የረመዷን ቀዷ የነበረበት ሰው ቀጣዩ ረመዷን ከመግባቱ በፊት ቀዷውን አውጥቶ '
'ማጠናቀቅ ግዴታ እንደሆነ ኡለሞች በአጠቃላይ ተስማምተውበታል። '
'ለዚህም ማስረጃው አኢሻ ረዲዬሏሁ አንሀ ሶሂህ በሆነ ሀዲስ እንዲህ ማለቷ ነው:— \n\n'

'\"በእኔ ላይ የረመዷን ቀዷ ፆም ይኖርብኝ ነበር ፣ ለነብዪ ሶለሏሁ አለይሂ ወሰለም' 
'ምቾት ሲባል ሸዕባን ወር ውስጥ እንጅ ከዛ በፊት ቀዷ ማውጣት አልችልም ነበር።'
'\" እዚህ ሀዲስ ላይ አኢሻ ረዲዬሏሁ አንሀ በዚህ ወር ላይ ቀዷዋን ለማጠናቀቅ '
'መጓጓቷ ቀጣዩ ረመዷን እስኪገባ ማዘግየት ክልክል መሆኑን ያመለክታል።\n\n'

'ነገር ግን ቀጣዩ ረመዷን እስኪገባ ድረስ ቀዷውን ያላጠናቀቀ ሰው ከሁለቱ አንድኛው '
'ሁኔታ ይኖረዋል። እነሱም አንዱ በሸሪዓዊ ምክንያት ከሆነ ነው ፣ ማለትም '
'በተከታታይ በሽታ ወይም መፆም ፅንስንም ሆነ አካልን ይጎዳል ተብሎ '
'ከተረጋገጠና በሌሎች ከባባድ ምክንያቶች ከሆነ ይህ ሰው ቀዷውን '
'ባለማጠናቀቁ ያሉበትን ቀዷ ማውጣት ብቻ እንጅ ወንጀልም ሆነ ሚስኪን ማብላት አይኖርበትም።\n\n'

'ሁለተኛው ደግሞ ሸሪዓዊ ባልሆነ ምክንያት ማለትም በስንፍና እና በመሳሰሉት '
'ከሆነ ይህ ሰው ወንጀለኛ በመሆኑ በሱ ላይ ተውበት ያለበት መሆኑና '
'በሱ ላይ ያሉበት ቀናትን ቀዷ ማውጣት እንዳለበት ኡለሞች ተስማምተዋል። '
'ሆኖም ከዚህ በተጨማሪ ባሉበት ቀናት ልክ ሚስኪኖችን ማብላት አለበት '
'ወይስ የለበትም በሚለው ላይ ኢማሙ ሻፊዕይና ሌሎች ከፊል ኡለሞች '
'ከአንዳንድ ሶሀቦች ፈለግ ተገኝቷል በሚል አለበት ሲሉ ሌሎች ኡለሞች '
'ቡኻሪና አቡ ሀኒፋን ጨምሮ ደግሞ ቀዷና ተውበት እንጅ ሌላ የለበትም ይላሉ።\n\n'

'ሆኖም ከመረጃ አንፃር በላጩና አመዛኙ አቋም ሁለተኛው ነው። ምክንያቱም '
'በመጀመሪያ የሶሀባ ንግግር ከአሏህ ንግግር ጋር ሲገጥም ነው የሚያዘው ፣' 
'ምክንያቱም አሏህ በቁርአኑ በተለያዩ ምክንያቶች የረመዷን ቀዷ ያለበትን' 
'ሰው ቀዷ ከማውጣት ውጭ ሌላን አላዘዘምና። እንዲህም ይላል:'
'\"...በሽተኛ የሆነም ፣ ወይም መንገድ ላይ ያለ ፣ ከሌሎች '
'(ከረመዷን ውጭ ካሉት ቀናት) መቁጠር (ቆጥሮ መፆም) ነው ያለበት...\"'
'ሱረቱል በቀራህ ፣ 185',



'በተሰበረው ወይም በተነቀለው ጥርስ ቦታ ሰው_ሰራሽ የሆነን ጥርስ በጊዜያዊነትም '
'ይሁን በቋሚነት ማስተከል በሸሪዓችን የተከለከለ አይደለም። በዉዱእም '
'ወቅት ይሁን ሰውዬው ሲሞት ሰው ሰራሹን ጥርስ ማውጣት ግዴታ አይደለም። '

'ፊጥራን (ተፈጥሮን መቀየርን) በተመለከትም ይህ በሸሪዐችን ከተፈቀደው ህክምና '
'ውስጥና ነውርን ወይም ህመምን ከማሰውገድ ውስጥ ይገባልና ከዚህ ጋር አይካተትም። '
'ነብዩም ሶለሏሁ አለይሂ ወሰለም አፍንጫው የተቆረጠበት ሶሀባ በዛ ቦታ ላይ '
'ከብር የተሰራ አፍንጫን እንዲያደርግበት ሲፈቅዱለት ባስቸገረው ጊዜ የወርቅም ቢሆን ማድረግ እንደሚችል ገልፀዋል። '
'ነሳእይ (5070)  ዘግበውታል ፣ አልባኒም ሶሂህ ብለውታል',



'ለጅልባብና ለኒቃብ ከለሩ ጥቁር ከለር መሆኑ መስፈርት መሆኑን የሚያመለክት ቁርአናዊም '
'ሆነ ሀዲሳዊ ማስረጃ የለም። ማለትም አንዲት ሴት ሂጃቧ ከወንዶች መለያ ከለር '
'ጋር እስካልተመሳሰለና ከለሩም የሰዎችን እይታ የሚስብና ያሸበረቀ እስካልሆነ '
'ድረስ ማንኛውንም ከለር መጠቀምን የሚከለክል መረጃ የለም።\n\n'

'ሆኖም ብዙ ሴቶች ለሂጃብ ጥቁር ከለርን ከሌሎች ከለሮች ይመርጣሉ። ይህም '
'የሆነበት ምክንያት አንዳንድ ኡለሞች እንደሚገልፁት ጥቁር ከለር ከሌሎች ከለሮች '
'አንፃር ሲታይ እይታን ከመሳብ አንፃር ዝቅተኛ ስለሆነና ሴት ሶሀቦችም ጥቁር '
'ሂጃብ መልበስን ያዘወትሩ እንደነበረ ከኡሙ ሰለማ የተዘገበ ሀዲስ① ስላለ ነው። '
'ቢሆንም ከሌሎች በላጭ ከለር ለመሆኑም አጠቃላይ የኡለሞች ስምምነት የለም።',

];


List<String> appTitless7 = [

  'አጅነቢይ ሴትን ማውራት',

  'የሴት ልጅ ድምፅ ሪከርድ',

  'ህፃን ሴት ልጅ ፀጉሯን መላጨቷ',

  'የሴት ልጅ ሜካፕ',

  'በሀይድ ወቅት ጀናባ መሆን',

  'ሴት ልጅ ሴቶች ፊት ሱሪ መልበሷ',

  'ሀይድ ላይ ያለች ሴት ቁርአን መቅራቷ',


  'ለሰርግ ቀን ቬሎ መልበስ',

  'ሀይድ ላይ እያለች ግኑኝነት መፈፀም',

  'የእህት ባል አጂነቢ ነውን',


  'የአባት ሚስት አባት አጂነቢ ነውን',


  'አጂነቢ ወንድን ለሰላምታ መጨበጥ',


  'የበሽታ ደም ወቅት ላይ ግኑኝነት ማድረግ',


  'ኒቃብ ዋጂብ ነው ወይስ አይደለም',


  'የቅንድብን ቅርፅ በሂና ማስተካከል',


  'ቀብር ዝያራ ለሴት ልጅ',

  'ሴትን ልጅ መንካት ውዱ ያስፈታልን',


  'በሀይድ ወቅት መስጊድ መቀመጥ',

  // part two

  'ጆሮን ከአንድ ቦታ በላይ መበሳት',

  'የሴት ልጅ ግርዛት በኢስላም',

  'ሴት ሶላት ውስጥ የእግሯ መገለጥ',

  'ለአጂነቢ ቁርአን እየቀሩ ማሰማት',


  'ሴት ያለ መህረም ሀጅ ማድረጓ',

  'ጊዜው ካለፈ በኃላ በጫማ ላይ ማበስ',

  'የፅንስን ፆታ ማስመርመር',

  'ሴት ልጅ መኪና መንዳቷ',

  'በሀይድ/ያለ ውዱእ የምስጋና ሱጁድ',

  'ሶላት ውስጥ እግሯን መሸፈኗ',


  'አጂነቢ ያልሆኑ ወንዶች እነማን ናቸው',

  'በወሊድ ወቅት የሞተች ሸሂድ ናት',

  'በሀይድ ወቅት መስጂድ መግባት',

  'ባልቴት ሴትን መጨበጥ',

  'ለአጂነቢ ሴት ሰላምታን ማቅረብ',

  'ካፊር ሴት ፊት ፀጉርን መግለጥ',

  'ቀዷዬን ሳልጨርስ ረመዷን ገባ',

  'አርቲፊሻል ጥርስ ማስተከል',

  'ሒጃብ ጥቁር መሆን አለበትን',















];


List<String> sources7 = [


  'ሽህ ሙሀመድ ሷሊህ አል ሙነጂድ ሀፊዞሁሏህ',

  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ',

  'ኢብኑ ባዝ ረሂመሁሏህ',

  'ኢብኑ ዑሰይሚን',


  'ኢማሙ ሻፊዒይ፣ ኪታቡል ኡም፣\n'
  'ኢብኑ ቅዳማ፣ ኪታቡል ሙግኒ',

  'ኢማሙ አሸንቂጢይ ፣ ኪታብ ዛዱል ሙስተቅኒዕ፣\n'  
  'የሳኡዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ',

  'ኢብኑ ባዝ ረሂመሁሏህ ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',

  'ኢብኑ ዑሰይሚን፣ ኪታብ መጅሙዓቱል አስኢላህ፣ 92\n'
  'የሳኡዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ፣ 17/343',


  'ኢብኑ ባዝ ረሂመሁሏህ ፣ መጅሙዑል ፈታዊ\n',


  'ኢብኑ ባዝ ረሂመሁሏህ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',

  'ኢብኑ ባዝ ረሂመሁሏህ ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',

  'ኢብኑ ባዝ ረሂመሁሏህ ፣ መጅሙዑል ፈታዊ 10/132',

  'ኢብኑ ቁዳማ ፣ ሙግኒ',

  'ኢብኑ ኡሰይሚን ፣ ፈታዊ ፣ 1/391,392 ፣\n'
  'ሸይኽ ፈውዛን ፣ ፈታዊ ፣ 1/396,397',

  'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 21778',

  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣\n' 
  'ኢብኑ ኡሰይሚን ፣ ፈታዊ አልመርአት',


  'ኢብኑ ተይሚያ ፣ መጅሙዑል ፈታዉ ፣ 12/222 ፣\n'
  'ኢብኑ ኡሰይሚን ፣ ፈታዊ ፣ 10/134 ፣\n'
  'ኢብኑ ባዝ ፣ ፈታዊ ፣ 1/186 ፣\n'
  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ ፈትዋ ቁጥር 5/266',

  'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 6/272 ፣\n'
  'ኢብኑ ኡሰይሚን ፣ ፍትዋ ጦሀራ ፣ 273 ፣\n'
  'ሸርሁል ሙምቲዕ ፣ 1/267',

  'ኢብኑ ኡሰይሚን ፣ መጅሙኡል ፈታዊ ፣ 11/69 ፣ \n'
'ሸይኽ ፈውዛን ፣ ፈታዊ ፣ 3/324',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',

'ኢብኑ ሙፍሊህ አል ሀምበሊይ ፣ ኪታብ ሸርሁል ሙቅኒዕ ፣ 7/11',


'ኢብኑ ዑሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 11/ 221',

'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 11/130',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣\n' 
'ኢብኑ ኡሰይሚን ፣ መጅሙኡል ፈታዊ ',


'ሸይኽ ፈውዛን ፣ መጅሙኡል ፈታዊ ፣\n'
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣\n'
'ኢብኑ ኡሰይሚን ፣ መጅሙኡል ፈታዊ ፣ 461',


'ኢብኑ ተይሚያ ፣ ፈታዊል ኩብራ ፣ 5 / 340 ፣\n'
'ኢማሙ ሸውካኒ ፣ ነይሉል አውጧር ፣ 5 / 347 ፣\n' 
'ኢብኑ ሀጀር ፣ ፈትሁል ባሪ ፣ 2 / 554\n'
'ኢብኑ ባዝ ፣ ፈታዊ ኑሩን አለደርብ ፣ 10/461 ፣\n'
'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 4/90',


'የሳዑዲ የኢልምና የፈትዋ ቋሚ ኮሚቴ ፣ 5/143 ፣\n' 
'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲእ ፣ 2/161',


'ኢማሙ ነወዊይ ፣ ሸርሁል ሙስሊም ፣ 10/22 ፣\n' 
'ኢብኑ ቁዳማህ ፣ ኪታቡል ሙግኒ ፣ 6/555',

'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ ፈትዋ ቁጥር 20030',

'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 6/272 ፣\n' 
'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 1/195\n'  
'ኢብኑ ኡሰይሚን ፣ ፈታዊ አጦሀራ ፣ 273',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 7/183'
'ነሳእይ ዘግበውታል (4181) አልባኒም ሶሂህ ብለውታል (2513)',


'ኢማሙ ወነውይ ፣ ኪታቡል አዝካር ፣ 407 ፣\n'
'ኢብኑ ሀጀር ፣ ፈትሁል ባሪ ፣ 11/37 ፣\n'
'ኢብኑል ቀይም ፣ ዛዱል መዓድ ፣ 2 / 412',


'ኢብኑ ባዝ ፣ ፈታዊል መርአቲል ሙስሊማህ ፣ 2 / 582 ፣\n'
'ኢብኑ ዑሰይሚን ፣ ፈታዊል መርአቲል ሙስሊማህ ፣ 1 / 417\n',
'ቡኻሪ (1007) እና ሙስሊም (584) ዘግበውታል',


'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 6/451 ፣\n'
'ኢማሙ ነወዊይ ፣ አልመጅሙዕ ፣ 6/366 ፣\n' 
'ኢብኑ ቁዳማ ፣ አልሙግኒ ፣ 4/400',


'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 25/15, 57',


'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 17/100, 108–110\n'
'አቡዳውድ (4101)',


];


List<String> questions7 = [

  'አጅነቢይ ሴትን በቻት ማውራት እንዴት ይታያል?',

  'ሴት ልጅ ወንዶች ባሉበት ግሩፕ ውስጥ ድምጵ ማሰማት ትችላለች ማለቴ ድምጷን በመቅዳት መልቀቅ ትችላለች?',

  'ሴት ልጅን ህፃን እዳለች ፀጉሯን መላጨት እንዴት ይታያል',

  'ሙስሊም ሴት ልጅ ሜክአፕ መስራት ትችላለችን?',

  'ሀይድ ላይ ያለች ሴት ብትጀንብ ወዲያው መተጠብ ግዴታ አለባት ወይስ' 
  'ሀይዷን ስትጨርስ ነው⁉️ አስተታጠቡስ መጀመሪያ የትኛውን ነው የምትታጠበው?',


  'ለሴት ልጅ ሴቶች ፊት ሱሪና የሚያጣብቅ ነገርን መልበስ ይፈቀድላታልን?',


  'ሀይድ ላይ ያለች ሴት ቁርአን መቅራት ትችላለችን?',

  'ሴት ልጅ ለሰርጓ ቀን ቬሎ መልበስ እንዴት ይታያል፣ ከካፊሮችስ ጋር መመሳሰል አለበት?',


  'የወር አበባ ላይ ያለች ሴት ከባሏ ጋር ግኑኝነት መፈፀም ትችላለችን፣ ከነ ማስረጃው ቢብራራልኝ',


  'አንዲት ሙተነቂብ የሆነች ሴት የእህቷ_ባል ፊት ፊቷን መግለጥ ትችላለችን?',


  'አባቴ ከእናቴ ጋር ከፈቱ በኃላ ሌላ ሚስት አግብቶ ነበርና የሷ አባት ለኔ አጂነቢ ነውን፣ እሱ ፊት ፊቴን መገለጥ እችላለሁን?',


  'አጂነቢ ወንድንም ሆነ ሴትን ለሰላምታ መጨበጥ እንዴት ይታያል?',


  'አንዲት የበሽታ ደም ላይ ያለች ሴት ግኑኝነት ብተፈፅም ምን ችግር አለው?',


  'ኒቃብ መልበስ ዋጂብ ነው አይደለም?  ከነ ማስረጃው ብታብራሩልኝ?',



  'ቅንድብን በሂና መቀባትና ቅርፁን ማስተካከል እንዴት ይታያል ፣ ለአጂነቢ ሳይሆነ ባል ፊት?',



  'ሴት ልጅ ቀብር መዘየር ትችላለችን?',


  'አጂነቢ ሴትን መንካት ውዱእ ያስፈታልን?',


  'በሀይድ ወቀት መስጅድ መቀመጥ እና ለቂርአትና ለዳእዋ እንዲሁም መስጊድ ለማፅዳት ብሎ መቀመጥ እንዴት ይታያል?',


  'ለሴት ልጅ ጆሮዋን መበሳት ትችላለችን ፣ ከአንድ ቦታ በላይ መበሳትስ?',

  'የሴት ልጅ ግርዛት በኢስላም እይታ እንዴት ይታያል ፣ ግዴታ ነው ወይስ ሱና?',

  'ሴት ልጅ ሶላት ውስጥ እያለች ምን ምን አካሏን መግለጥ ትችላለች? እግሯን መግለጥሳ?',

  'ሂፍዝ እየሀፈዝን የሚሰማን ሰው ወንድ ልጅ ነው። እና ለአጂነቢ ቁርአንን ማሰማት እንዴት ይታያል?',

  'አሁን አሁን አንዳንድ ሴቶች ያለ መህረም ብዙ የሴት ጀመዓ ሁነው ሀጅ' 
  'ያደርጋሉ ይሄ በጀመዓ መሄዳቸው እንደ መህረም ነው ይላሉ በዚህ መልኩ ሀጅ ይቻላልን?',


  'የማበሻ ወቅቱ ካለፈ በኃላ ማለፋን ሳያውቅ አበሰና ሰገደ ፣ ታዲያ '
'ማበሻው ወቅቱ ካለፈ በኃላ የሰገደው ሶላት ትክክል ነውን? ሶላቱንስ መድገም አለበትን?',


'እናት የፅንሷን ፆታ ለማወቅ ብላ ዶክተር ጋር ሂዳ ብታስመረምርና ብታውቅ ይፈቀዳልን? '
'አላህ የሚስጥር እውቀትን እኔ ብቻ ነኝ የማውቀው ከሚለው ጋር አይጋጭምን?',


'ለሴት ልጅ መኪና መንዳት በዲናችን እንዴት ይታያል?',


'ሱጁድ አሽሹኩር ያለ ወዱእ ወይም ሀይድ ላይ ያለች ሴት መዉረድ ትችላለች?',


'ሴት ልጅ ሶላት ስትሰግድ እግሯ የግድ መሸፈን አለበት ወይስ  እንዴት ነው?',


'ለአንዲት ሴት ልጅ አጂነቢ የማይሆኗትና እነሱ ፊት ፊቷን መግለጥ የምትችልባቸው ወንዶች እነማን ናቸው?',



'አንዲት እናት በወሊድ ወቅት ብትሞት ሸሂድ ናት የሚል ሰምቼ ነበር እውነት ነውን?',


'ሀይድ ላይ ያለች ሴት መስጂድ ውስጥ የሚሰጡትን '
'ዳእዋዎችና ቂርአቶች ለማዳመጥ መስጂድ ውስጥ መግባት ይፈቀድላታልን?',


'አጂነቢ ሁና ነገር ግን ትልቅ ሴት የሆነች ማለትም አሮጊት ሴትን መጨበጥ እንዴት ይታያል ፣ ያው በሌላ ነገር ሊያስቧት ስለማይችሉ ብዬ ነው?',


'ለሴቶች ኢስላማዊ ሰላምታ ማለቴ (አሳላሙ አለይኩም ዋራህማቱላህ ወበራካቱህ)' 
'እንላቸዋለን ወይስ አንልም ካልን ደግሞ ለወንዶች እንዴምንናደረገው '
'ነው ወይስ የተለየ ነው ፣ የተለየ ከሆኔ እንዴት ነው ምንናደረገው?',


'ካፊር ሴት ፊት ፀጉርን መግለጥም ሆነ ሂጃብ አለመልበስ አይቻልም የሚባል ነገር ሰምቼ ነበር ፣ ይህ እንዴት ነው?',



'ያለፈው ረመዷን የተወሰኑ ቀናቶች ቀዷ ነበረብኝና ያንን ቀዷ ታምሜ ወይም '
'ሳይመቸኝ ቀርቶ ሳይሆን በስንፍና ሙሉውን ቀዷ ሳላወጣ ቀጣይ '
'ረመዷን መጣብኝ እና አንዳንዶች ሚስኪን ማብላት አለብሽ አሉኝ ምን ማድረግ ይጠበቅብኛል?',


'ጥርስን አስነቅሎ ሌላ አርቶፊሻል ጥርስ ማስተከል በሸሪዓችን እንዴት ይታያል ፣ ተፈጥሮን ከመቀየር ውስጥ ይገባልን?',



'የሴት ልጅ ጅለባብና ኒቃብ በጥቁር ከለር የተገደበ ነውን ፣ ጥቁር ከለር መሆኑስ ከሌሎች ከለሮች በላጭ ነውን?',


];