

List<String> texts2 = [

  'ይህ በሁለት 2 መልኩ ነው የሚመለሰው:—\n\n'

  '1 እዚህ በዓል ላይ የሚገኘው ይህ ድርጊት ቢድዓ መሆኑን ለመግለፅና ሌሎችንም መጥፎ ነገራቶችን'
  'ለማጥላላት ፣ ሀቁን ለማስተላለፍና ሰዎችን ወደ ሀቅ ለመመለስ ከሆነና ሀቁን ለማብራራት'
  'የሚያስችል ኢልምና_አቅም ያለው ከሆነ እንዲሁም ፈተና_እንደማያጋጥመው እርግጠኛ ከሆነ መሄድ ይችላል።\n\n'
  '2 እዚህ ቢድዓ በአል ላይ የሚገኘው ዝም ብሎ ለማየት ከሆነ ግን የተከለከለ ይሆናል።'
  'ምክንያቱም እዚህ ቦታ ላይ መገኘት መጥፎ ተግባራቸው ላይ መተባበር፣ ቁጥራቸውን ማብዛትና ቢድዓቸውን ማሰራጨት ይሆናልና።',


      'ለነብይ ውልደትም ይሁን ወልይን ለማላቅ የሚታረድ ስጋ'
'ከአላህ_ውጭ ላለ አካል እንደማረድ ስለሚሆን ሽርክ ነው! ከሱ'
'መብላትም አይፈቀድም‼️ምክንያቱም ነብዩ (ሶለሏሁ አለይሂ ወሰልም) እንዲህ ብለዋልና;—'
'\"ከአላህ ዉጭ ላለ አካል ያረደ በርግጥም (በአላህ) አጋርቷል።\"',




'በመጀመሪያ ደረጃ በእጅ ማድረጉ በላጭ ቢሆንም በሙስበሀም ይሁን ያንን በሚተካ '
'ነገር ተስቢህ ማድረጉ ግን ቢድዓ_አይደለም። ምክንያቱም በሸሪዓችን መሰረት ያለው ነገር ስለሆነ:— '
'እሱም ነብዩ (ሶለላሁ ዓለይሂ ወሰለም) አንድ ጊዜ የሙእሚኖች እናት ዓኢሻ ረዲየሏሁ ዓንሀ '
'በጠጠር ተስቢህ ስታደርግ አይተዋት አረጋግጠውላታል።አቡ ሁረይራም ረዲየሏሁ ዓንሁ በዚሁ ተስቢህ ሲያደርግ እንደነበረም ተዘግቧል። \n\n'
'በተጨማሪም ደግሞ መሰረት እንኳን የለውም ብንል ሰዎች ይህን ተስቢህ ብዛቱን ለማወቅና '
'ለመቁጠር እንጂ ራሱኑ ሙስበሀውንም ይሁን አፕሊኬሽኑን እንደዒባዳ አይጠቀሙበትም። '
'ምክንያቱም ቢድዓ ብሎ ማለት ዒባዳ ላይ የሚፈፀም ጭማሪ እንጂ ወደ ኢባዳ እንደመዳረሻ '
'የሚያገለግል ቢድዓ አይባልም። ልክ ማይክራፎንን ድምፅን ለማጉላት እንደምንጠቀመው ማለት ነው። \n\n'

'ነገር ግን ይህን ሙስበሀ ስንጠቀም የሚከተሉትን ነገራቶች መጠንቀቅ አለብን:— '
'ለጌጥ (አንገት ላይ በማንጠልጠል ወይም ጣት ላይ ማሰር) '
'ሁሌ ሙስበሀን በመጠቀም እጅን እርግፍ አርጎ መተው (ሙስበሀ የግድ አስፈላጊ ሲሆን እንጂ በላጩ በእጅ ስለሆነ) '
'እየቆጠሩ ሀሳብን ሌላ ቦታ አርጎ ለተስቢሁ ትኩረት አለመስጠትና መዘናጋት '
'እና ሌሎችንም ነገራቶች መጠንቀቅ ያስፈልጋል።',


'በመጀመሪያ ደረጃ ነሺዳ ብሎ ማለት ከቋንቋ አንፃር ግጥም ማለት ነው። '
'ስለዚህ በዚህ ትርጓሜ ከሄድን ግጥም በሸሪዓችን ሽርክያትና መጥፎ ነገሮች '
'እስካልተቀላቀሉበት ድረስ የተፈቀደ ነው። ለዚህም በነብዩ (ሶለሏሁ ዓለይሂ ወሰለም) '
'ዘመንም ሶሀቦች ስራ ሲሰሩ፣ ከስራ ሲያርፋ ለመነሳሳት ግጥም እየገጣጠሙ ይሉ '
'እንደነበር ዘገባዎች ያመለክታሉ፣ ታዲያ እነዚህን ግጥሞች በጀመዓ በአንድ ድምፅ '
'አልነበረም ሲሏቸው የነበረው፣ እንደውም ሳይዘጋጁበት እንደመጣላቸው ስለነበር '
'አስባይና_ተቀባይም አልነበረም፣ ታዲያ በዚህ መልኩ ማንም ሰው ግጥም መግጠም ይችላል። '
'ልክ እነ ኢብኑል_ቀይምና ሌሎችም ታላላቅ ኡለሞች በኪታቦቻቸው ግጥሞችን '
'እንደሚያስቀምጡት በግጥም መልኩ መልእክትን ማስተላለፍ የሚከለከል አይሆንም። \n\n'

'ነገር ግን ነሺዳ ሲባል የተፈለገው ጥያቄው ላይ እንደተጠቀሰው በዘመናችን ኢስላማዊ'
'ተብለው የሚጠሩትና በጀመዓ_በአንድ_ድምፅ የሚባለው ፣ አስባይና_ተቀባይ ያለው ፣ '
'እንዲሁም ፣ አዝማች ያለው አይነት ከሆነ በሸሪዓችን የነዚህ አይነት አይነት ነሺዳ መሰረት '
'የሌለውና ቢድዓ ነው። ‼️ኢስላማዊ‼️ ብሎም መጥራት አይቻልም። ምክንያቱም ኢስላም '
'ከንደዚህ አይነት ነገራቶች የጠራና ሸሪዓችንም በየትኛውም ሁኔታ በቁርአንም_በሀዲስም  ያልደነገገውና ሰለፎችም የማያውቁት በመሆኑ ነው። \n\n'

'እነዚህ ነሽዳዎች የሱፍዮች እና የሂዝብዮች (ቡድንተኞች) መገለጫ ናቸው። '
'በዚህም መልኩ ዳዕዋ ማድረግ ቢድዓና መሰረት የሌለው ነገር ነው። ማዳመጥም ሆነ ማሰራጨት አይፈቀድም‼',



'በዚህ ጉዳይ ላይ በዑለሞች መካከል ልዩነት ቢኖርም በላጩና አመዛኙ ንግግር ግን '
'ለሞተ ሰው አጅሩ እንዲደርሰው ብሎ ቁርአን መቅራትም ሆነ ሶላት መስገድ '
'በሸሪዓችን ማስረጃ የሌለው ቢድዓ ተግባር ነው። ዒባዳ ደግሞ ከማስረጃ ጋር '
'የተቆራኘ በመሆኑና ነብዩም (ሶለሏሁ ዓለይሂ ወሰለም) አንድም ቦታ ላይ ለሞተ ሰው '
'የቀሩበትም ሆነ ቅሩ ያሉበት ጥቅስ ስለሌለ ይህን ማድረግ ተገቢ አይደለም። አጅሩም ለሞተው ሰው አይደርሰውም። '
'ነገር ግን የሞተው ሰው የፆም ቀዷ ኑሮበት ሳያወጣው የሞተ ከሆነ የሱ ቅርብ '
'ዘመዶች ቀዷውን ሊያወጡለት ይችላሉ፣ አጅሩም ይደርሰዋል። ነገር ግን ይህንን ለሶላትና ለቂርኣት መቀየስ አይቻለም‼',



'ኮከብና ጨረቃ ከኢስላም ጋር ያላቸው ግኑኝነት የሶላት ፣ የፆምና የሌሎች ' 
'አምልኮዎችን የጊዜ ወቅትን ለማወቅ እንጂ ሌላ የለውም። የኢስላም ምልክት አርጎ '
 'መቁጠር የተሳሳተና መሰረት የሌለው ነገር ነው። ምክንያቱም በሶሀቦችም በሰለፎችም ዘመን በዚህ መልኩ ስላልተጠቀሙት። \n\n' 

'በየ መስጂዶች ሚናራ ላይ የምናያቸው ኮከብና ጨረቃዎችም በሸሪዓችን መሰረት የላቸውም። ' 
'እንደ አርማ መጠቀምም አይፈቀድም። ይህ የመጣው ቀደምት ሙስሊሞች የተለያዩ ሀገራትን ሲቆጣጠሩ ' 
'መስጂዶቻቸውን ከቤተ ክርስትያን ለመለየት ብለው ያመጡት ምልክት ነው። '

'ሙስሊሞች የሚገዙት አላህን ብቻ እንጂ ጨረቃና_ኮከብን እንዳላደለ ግልፅ ነው። ' 
'የሙስሊሞችም መለያ ምልክት ተደርገው መታሰብና መያዝ የለባቸውም።',




'ይህ "ጁሙዓ_ሙባረክ" የሚለው ቃል በሸሪዓችን መሰረት የሌለው ቢድዓ ነው። '
'ይህንን ማለትም ሆነ ማሰራጨት የተከለከለ ነው። ምክንያቱም ነብዩ(ሶለሏሁ ዓለይሂ ወሰለም) በሀዲሳቸው እንዲህ ብለዋልና:— '
'\"ያለ እኛ ትእዛዝ አንዲትንም ስራ የሰራ ስራው ተመላሽ ነው!\" '
'(ቡኻለሪና ሙስሊም ዘግበውታል)\n\n'

'ይህ ተግባር ተቀባይነት የሌለው መሆኑ ብቻ ሳይሆን ሁሊም ቢድዓ በሸሪዓችን '
'ጥመት መሆኑም ጭምር ወንጀለኛ ያረገዋል።ለዚህም ረሱላችን በሀዲሳቸው ይህን ብለዋል:— '
'\"አደራችሁን አዳዲስ መጤ ነገራቶችን ተጠንቀቁ ፣ ምክንያቱም ሁሉም (ዲን ላይ) '
'መጤ ነገር ቢድዓ ነው፣ ሁሉም ቢድዓ ደግሞ ጥመት ነው።"',







' በሸሪዓችን የተደነገገው በንግግርም ጊዜ ይሁን በፅሁፍ ሰላምታንም ይሁን ሶለዋትን አጅሩ '
'ሙሉ ይሆን ዘንድ ሙሉ ቃሉን መናገርና መፃፍ ግዴታ ነው። ልክ በንግግር እንዲህ '
'አሳጥሮ መናገር እንደማይቻለው ሁሉ በፅሁፍ እንዲሁ የተከለከለ ተግባር ይሆናል። '
'ከዚህም በተጨማሪ ከደጋግ ሰለፎች በዚህ መልኩ አሳጥሮ የተጠቀምም ይሁን የፃፈ '
'ስለሌለ ወደ ቢድዐ ሊያመራም ይችላል። እንዲሁም ነብዩ ሶለሏሁ ዓለይሂ ወሰለም በእኔ ላይ '
'ሶለዋት የማያወርድ ነው ስስታም እያሉ ያውም ሶለዋት አጅር ያለው ተግባር ሆኖ እያለ ቃሉን '
'ሙሉ በሙሉ ለመፃፍ እንዲህ መስነፍ ተገቢ አይደለም።ስለዚህ ፀሀፊዎች ሊጠነቀቁና ከዚህ ድርጊት ሊታቀቡ ይገባል።',


'በሸሪዓችን ጠባብ ፣ ሀፍረት ገላን የሚያሳይ አጭር ፣ ከካፊሮች ጋርና ከሴቶሽ ጋር '
'የሚያመሳስል ልብስ እስካልሆነ ድረስ ማንኛውንም ልብስ ሱሪን ጨምሮ መልብስ ይቻላል። '
'አንድ ልብስ ከካፊሮች ጋር ያመሳስላል የሚባለው ካፊሮች ብቻና ብቻ የሚለብሱት ወይም '
'የሚለዪበት ከሆነ ነው። ሱሪ ግን የሁሉም ማህበረሰብ የጋራ ልብስ ነው። የካፊሮች ብቻ ነው '
'ተብሎ መባል የሚችል ደረጃ ላይ አይደለም። ስለዚህ ከላይ የተቀመጡት መስፈርቶች እስካሟላ ድረስ የሚፈቀድ ይሆናል። ',


'እጅን ወደ ላይ ከፍ ማድረግ የሚወድደባቸው ሁኔታዎች ላይ የእጅ አነሳስ ሁኔታ የሚሆነው '
'እጅን ወደ ላይ በጣም ከፍ ሳያደርግ በልቡ ትክክል ማድረግና እጁን በመዘርጋት የመዳፋን '
'የውስጠኛ ክፍል ደግሞ ወደ ሰማይ አቅጣጫ በማድረግ ሁለት እጂችን ሳያራርቅ '
'በማጠጋጋት ነው ዱዓ የሚደረገው። በዚህ መልኩ ነው ሶሀቦች ሲተገብሩት የነበረው።',


'በሸሪዓችን አእምሮን መጀመሪያ ከነበረበት ሁኔታ ትንሽ እንኳን ቢሆን የሚቀይር ማንኛውም መጠጥና '
'ምግብ በሸሪዓችን በጥብቅ የተከለከለ ነው። ጫት ደግሞ በተለምዶ እንደሚታወቀውና '
'በላቦራቶሪ ህክምና ውጤትም እንደተረጋገጠው አእምሮን የሚቀይርና ጎጂ '
'ንጥረ_ነገር ስላለው በሸሪዓችን በሁለት 2 መልኩ የሚከለከል ይሆናል። \n'

'1 መጠኑና አይነቱ እንደየሰው ቢለያይም አእምሮን ካለበት ሁኔታ የሚቀይር መሆኑ ከአስካሪ ነገራቶች ያስገባዋል።\n'
'2 በጤንነት ፣ በገንዘብ ፣ በቤተሰብ እና በስነ_ልቦና ላይም ጉዳት ስላለው '
'በሸሪዓችን ውስጥ ደግሞ ራስን መጉዳት ሀራም ስለሆነ የሚከለከል ይሆናል።',



'በሸሪዓችን በመልካም ነገር ላይ መተባበር የተደነገገና የሚበረታታ ተግባር ነው። '
'ታዲያ ይህንን ምልካም ስራ ለመስራት እንደመዳረሻ ከሚያገለግሉ ነገራቶች መካከል አንዱ '
'ጀምዕያ (ማህበር) ነው። ለዚህም ኡሞች ይህ ተግባር ከቁርአኑ አንቀፅ ትርጓሜ ጋር ይገባል ብለዋል። '
'ይህ ማህበር ቁርአንና ሀዲስን በሰለፎች አረዳድ የሚከተል ፣ ቡድንተኝነት የሌለበት ፣ '
'በመልካም እንጂ በመጥፎ መተባበር የሌለበትና ሌሎች ነገራቶች እስከሌሉበት ድረስ የሚፈቀድ ተግባር ነው። \n\n'
'ያለ_ጀመዓ ነገራቶችን መፈፀም ይቻላል ተብሎ የሚገመት ከሆነ ግን አለማድረጉ በላጭ ነው። ከዛ ውጭ '
'በዚህ ርእስ ላይ ኡለሞች የኢጅቲሀድ ጉዳይ ስለሆነ አንዱ ሌላኛውን ሙብተዲዕ የሚባልበት ርእስ እንዳልሆነና '
'ጀምዕያ የሚባል የጥመት አንጃ እንደሌለ ጠቅሰው ሰዎች በዚህና በሌሎች ጥቃቅን ነገራቶች '
'ከመጨቃጨቅ እንዲቆጠቡም መልእክት አስተላልፈዋል።',



'ሰለፍ ማለት በቋንቋ አተረጓጎም ቀደምት ማለት ሲሆን በሸሪዓችን ደግሞ ሰለፍ ማለት '
 'ሶሀቦችን ይዞ እስከ ታቢእዬች ድረስ ያሉትን በመልካም የተከተሉ ቀደምት የዚህ ኡማ ሊቃውንት  ያጠቃልላል። '
'ሰለፍይ ማለት ደግሞ ቁርአን እና ሀዲስን ሶሀቦች እና እነሱን በመልካም የተከተሉ '
'ታቢዕዬችና የታቢእይ ታቢእዬች በተረጎሙትና በተረዱት መልኩ እንዲሁም በተገበሩት መልኩ የሚረዳና የሚተገብር ሁሉ ሰለፍይ ይባላል። '
'ይህን ስያሜ ከቀደምት ኡለሞች ጀምሮ ከትውልድ ትውልድ ሲቀባበሉት የመጣ '
'እና አህለሱናዎች የሚገለፁበት ሌላኛው ስያሜያቸው ነው። \n\n ነገር ግን ኡለሞች '
'የሚያወግዙት በዚህ ስም መነገድንና ሰለፍይ ሳይሆኑ ሰለፎችን በአቂዳም በመንሀጅም '
'ሳይከተሉ ራስን ወደ ሰለፍያ ማስጠጋትን ነው። ስለዚህ ይህን ስያሜ ከቡድንተኝነት በፀዳ '
'መልኩ እስለተጠቀሙበት ድረስ እንደማንኛውም የአህሉሱና ስያሜዎች የሚፈቀድና አንዳንዴም '
'በዚህ መጠራት በላጭ የሚሆንበት አጋጣሚዎች አሉ።',



'ተቃውሞ ሰልፍ ሃራም ነው፤ ከእስልምና ዕምነት አይደለም፤ ከከሃዲያን(ካፊሮች) ዕምነት እንጂ፤ '
'(ተቃውሞ ሰልፍ) ለቀውስ፣ ለብጥብጥ፣ ያለ ልክ ዕልቂት ምክኒያት ነው፡፡ '
'ተቃውሞ ሰልፍ በካፊር በህጉ ወይንም በመንግስቱ የተፈቀደ ቢሆንም ነገር ግን በኢስላም በጭራሽ የተፈቀደ አይደለም፡፡ '
'እኛ ሙስሊሞች ነን፤ ለአላህ ምስጋና ይገባው፤ በሃገሩ(ህግ) የተፈቀደ ቢሆንም '
'(ተቃውሞ ሰልፍ) ዲናችን(ዕምነታችን) ግን ይከለክላል፡፡ እኛ ሙስሊሞች ነን '
'ከአላህ_ኪታብ ነው እንጂ(መመሪያችን) የምንወስደው ከፍራንክ ህግ ወይንም ከሌላ አይደለም፡፡ '
'አላህን ፍሩ የአላህ በሮች..! በዚህ ጉዳይ ላይ አስቡበት..! ልጆቹን፣ ሚስቶቹን፣ '
'ሴት ልጆቻችሁን ከዚህ እርኩስ ማሽን(ኢንተርኔት) ከሚያዩትና ከሚያነቡት ነገር(እንዳይታለሉ) ምከሯቸው፡፡ \n\n'
'በአሁኑ ሰዐት በየሙስሊም ቤቱ ልክ እንደ ጣዖት ዕኩይን እያሰራጨ ፕሮፓጋንዳና አሉባልታን እየነዛ ሙስሊሞችን '
'ቤታቸው ውስጥ እንኳን በፍርሃት እንዲጨነቁ፤ እናም እነዚህ ቤቶች ላይ አለመረጋጋት እንዲመጣ እየመጣ ነው፡፡ '
'ስለዚህም አላህን ፍሩ የአላህ ባሪያዎች ሆይ፡: “ጠበኞችም በነበራችሁ ጊዜ በናንተ ላይ (የዋለውን) የአላህን ፀጋ አስታውሱ፤ '
'በልቦቻችሁም መካከል አስማማ፤ በፀጋውም ወንድማማቾች ሆናችሁ፤ በእሳት ጉድጓድ አፋፍም ላይ ነበራችሁ፤ ከእርስዋም አዳናችሁ\” '
'(ሱረቱል ዒምራን-103)\n\n'

'ዕወቁ ከንግግሮች ሁሉ በላጩ የአላህ መፅሀፍ(ቁርዓን) ነው፤ ከመመሪያዎች ሁሉ '
'በላጩ(ቅናቻ) መመሪያ የሙሀመድ ሰለላሁ ዐለይሂ ወሰለም መመሪያ(መንገድ) ነው፤ '
'ከመጥፎ ድርጊቶች ሁሉ መጥፎው አዲስ(ዲን ላይ) የተፈጠሩ ፈጠራዎች ናቸው፤ '
'ሁሉም ቢድዐ ጥመት ነው፤ ሁሉም ጥመት የእሳት ነው፡፡',



'ኢኽዋነል ሙስሊሚን ከአህለሱና ውጭ ለመሆናቸው የተረጋገጠ እና በዚህም ዙሪያ በጣም '
'በርካታ ኡለሞች ፈትዋ የሰጡበት ጉዳይ ነው። ለእነዚህ ኡለሞች መካከል የተወሰኑትን እንደሚከተሉት ይቀርባሉ\n\n '

'ሸይኽ ኢብኑ ባዝ ረሂመሁሏህ:—\n\n'

'ጠያቂ:  ያሸይኽ ተብሊግና ኢኽዋነል ሙስሊሚን ከሰባ ሁለቱ ጠማማ ቡድኖች ይገባሉን?\n'
'መልስ:  አዎ ከሰባ_ሁለቱ የጥመት ቡድኖች ውስጥ ይገባሉ። '
'(ከመሞታች ከሁለት አመት በፊት በዚህ ዙሪያ የሰጡት የመጨረሻ ፈትዋቸው ነው።)\n\n'

'በሌላም ጊዜ እንዲህ ብለዋል:—\n'
'\"ኢኽዋነል ሙስሊሚን ምርጥ ምርጥ ኡለሞች ያንቃሽሿታል ፣ '
'በተውሂድ ዳእዋ ላይ እና ቢድአን በማስጠንቀቅ ላይ ነሻጣ (መነሳሳት) የላቸውም።\"\n'

'ሸይኽ አልባኒ ረሂመሁሏህ:— \n'
'\"ኢኽዋነል ሙስሊሚም ከአህለሱና ናቸው ማለት ትክክል አይደለም፣ ምክንያቱም ሱናን ስለሚዋጉ ነው።\"\n\n'

'ሸይኽ ፈውዛን ሀፊዞሁሏህ:—\n'
'ጠያቂ:— ኢኽዋነል ሙስሊሚን ከሰባ ሁለቱ ቡድኖች ናቸውን?\n'
'መልስ:— \"አዎ ናቸው (እነዚህ ብቻ ሳየሆኑ) ማንኛውም በአቂዳ አህለሱናን የሚፃረር ሁሉ ከሰባሁለቱ ቡድኖች ውስጥ ይገባል።\"\n\n'

'በሌላም ጊዜ ከአህለሱና ናቸው ይላሉ ተብለው ሲጠየቁ እንዲህ ብለዋል:—'
'\" እኔ ከኢኽዋነል ሙስሊሚን አካሄድ የጠራሁ ነኝ። በዚህ ዙሪያ መልስ ሰጥቻለሁ። አካሄዳቸውንም በደንብ አብራርቻለሁ።\"\n'

'ሸይኽ ሷሊህ ሉሀይዳን ረሂመሁሏህ:— '
'\"ኢኽዋነል ሙስሊሚን በትክክለኛው የኢስላም አካሄድ ላይ አይደሉም።',



'በኒካህ ወይም በማጨት ወቅት ቀለበት ማድረግ ከካፊሮች የመጣ ተግባርና '
'እነሱ የሚታወቁበት ስለሆነ በሸሪዓችን በጣም ብናቀለው የተጠላ አለያ የተከለከለ ተግባር ነው። '
'በተለይ ይህ ቀለበት እስካልወለቀ ድረስ ፍቅርን ያጠነክራል ልዩነት አይኖርም ተብሎ የሚታሰብ ከሆነ ' 
'ደግሞ ሽርክ ነውና የሚሆነው ወደ ሽርክ ከሚያመሩ መንገዶችም አንዱ ሊሆን ይችላልና የተከለከለ ይሆናል።',



'ቢድዓ አስከፊና ከሰው ወደ ሰው የሚተላለፍ የልብ በሽታ ከመሆኑ የተነሳ ኡለሞች '
'ሙብተዲዕ ጋር መቀማመጥን እና የሱና ኡስታዞች እያሉ ከእርሱ እውቀት መማርን ይከለክላሉ። '
'የሱና ኡስታዞች ባይኖሩ እንኳን ወሳኝ የሆኑ የዲን እውቀቶችን ለምሳሌ አቂዳ ፣ ሀዲስ ፣ '
'ፊቅህ እና ሌሎች አንገብጋቢ የሚባሉትን መማር አይፈቀደም። '
'ነህውና፣ ሶርፍ እና ተጅዊድ እንኳን ሰውዬው ሲያስተምር ወደ ቢድዓው '
'የማይጣራ እና ኪታቡ ላይ ያለውን ብቻ የሚያስተምር ከሆነ እና ይህ እውቀት '
'ከእርሱ ውጭ በአካባቢው ከሌላ ሰው የማይገኝ ከሆነ ብቻ እንጅ አይፈቀድም።',



'የግድ ካልሆነ በስተቀር ማለትም ለመታወቂያ ፣ ለፓስፖርት ፣ ለመንጃፈቃድ እና ለሌሎች '
'አስገዳጅ ነገራቶች ካልሆነ በስተቀር ሩህ ያላቸውን አካላቶች (ሰው እና እንስሳትን) በእጅ '
'መሳልም ሆነ በካሜራ ማንሳትን እና ለማስታወሻነት ማስቀመጥ የተከለከለ ነው። '
'ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም በሀዲሳቸው እንዲህ ብለዋል:— '

'\"በዱንያ ላይ ስእልን የሳለ አኼራ ላይ አላህ (ሩህ መንፋት አቅሙ ባይኖረውም) እንዲነፋበት ያስገድደዋል። ነገር ግን አይችልም። '
'(ቡኻሪና ሙስሊም ዘግበውታል)\n\n'

'በሌላም ዘገባ:— \n\n'

'\"ሰዓሊ ሁሉ የእሳት ነው። በሳላቸው ስእሎች ልክ ነፍስ ተደርጎባቸው ጀሀነም ውስጥ ይቀጡታል።\"'
'(ቡኻሪና ሙስሊም ዘግበውታል) '
'ሶሀቢዩ ኢብኑ አባስም እንዲህ ብሏል:— \"ስዕል መሳልህ ካልቀረ ዛፍ እና ነፍስ የሌላቸውን ሳል።\"',



'ልብ_ወለድ ማለት ሰውዬው ሰዎችን ለማስደነቅ ፣ ለማስደሰት ፣ ለማስፈራራት ፣ '
'ብቻ ለማንኛውም አላማ ይሁን በራሱ ያለ ምንም ማስረጃ ታሪኮችን እየፈጣጠረ ማቅረብ ነው። '
'ይህ ውሸት ደግሞ በሸሪዓችን ፈፅሞ የተከለከለ ነው። እንደዚህ አይነት መፅሀፎችንም ማንበብም ሆነ '
'መሸጥ አይቻልም። ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል:— '

'\"ሰዎችን ለማሳቅ ብሎ እየቀጠፈ ወሬ የሚያወራ ሰው ወየውለት።\"'
'(አቡ ዳውድና ቲርሚዚ ዘግበውታል)',



'ደም መለገስ ከዚህ በታች የተዘረዘሩትን መስፈርቶች ካሟላ ችግር የለውም ፣ ይቻላል። እነሱም:—\n\n'

'1: ደሙን የሚለግሰው ሰው ደሙን በመለገሱ ምክንያት የሚጎዳ እና የሚታመም '
'አለመሆኑ መረጋገጥ አለበት። ምክንያቱም ራስን መጉዳት በሸሪዓችን ስለማይፈቀድ ፣\n\n '
'2: ደሙ የሚለገስለት አካል ህይወቱ ወይም ህመሙ በደሙ ላይ የተመረኮዘ '
'ከሆነና ይህን ደም ካልተጠቀመ የሚሞት ወይም የከፋ ጉዳት የሚያስከትልበት ከሆነ ፣ \n\n'
'3: ደሙን ከለጋሹ አካል የሚያወጣው ዶክተር ከተቻለ ሙስሊም ዶክተር ካልተቻለ '
'ደግሞ ካፊርም ቢሆን ብቻ ታማኝና ደሙን ለሌላ አላማ አይጠቀመውም ተብሎ የሚታሰብ ዶክተር ከሆነ ችግር የለውም። ይፈቀዳል።',



'ይህ ንግግር ምንም እንኳን ትርጉሙ ትክክል ቢሆንም በዚህ መልኩና ሁኔታ ቁርአን '
'እንደጨረሱ ይህን ቃል ማለት በቁርአንም በሀዲስም ያልተገኘ መሰረት የሌለው ቢድዓ ተግባር ነው።',



'የኢንሹራንስ ውል ማለት ኢንሹራንስ ሰጪ የሚባለው በአንድ ወይም በብዙ የተመደበውን '
'የኢንሹራንስ መግቢያ ዋጋ (ፕሬምዮም) ተቀብሎ በውሉ የተመለከተው አደጋ በደረሰ ጊዜ '
'ኢንሹራንስ ለገባው ሰው የተወሰነ ገንዘብ ለመክፈል ግዴታ የሚገባበት ውል ነው፡፡ '
'ታዲያ ይህ አይነቱ ውል በሸሪዓችን የተከለከለና የማይፈቀድ ውል ነው። ምክንያቱም በውስጡ '
'ወለድ ፣ ሰዎችን ማታለል ፣ የሰው ገንዘብን ያለ ሀቅ መብላት ፣ ቁማር እና የመሳሰሉ '
'ሙሀረማት ነገራቶች ስላለበት ሀራም የሆነ ውል ነው። እዚህ ውስጥ ሳያውቅ የገባ ሰውም '
'ቀጥታ ውሉን ማፍረስና ወአ አላህም ተመልሶ መፀፀት አለበት።',



'ይህ ሁሉ በሸሪዓችን ምንም መሰረት የሌለው_ቢድዓ የሆነ ተግባር ነው። ለሞተ ሰው ቤተሰቦቹም ይሁኑ ሌሎች '
'ጊዜና ወቅት ሳይገደብ በማንኛውም ቀን በእሱ ስም ሊሰድቁለት ይችላሉ። ይህም ለሱ '
'ይደርሰዋል ለዚህም ነብዪ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል:— '
'\"የሰው ልጅ ሲሞት ከሶስት ነገራቶች በስተቀር ስራው ይቋረጣል ፣ '
'እነሱም: ቀጠይነት ያለው ሶደቃ ፣ ሰዎች የሚጠቀሙበት የሆነ እውቀት ፣ ዱዓ የሚያደርግለት የሆነ መልካም ልጅ።\"'
'(ሙስሊም ዘግበውታል)',



'ለሱና ሶላቶች (የዱሀ ሶላት ፣ ተሀጁድ ፣ ተራዊህ ፣ ከፈርድ በፊትና በኃላ ያሉት ሱና ሶላቶች ፣ '
'ዊትር) አዛንም ሆነ ኢቃማ የላቸውም። ውዱእ ከተደረገ ቀጥታ መስገድ እንጂ '
'አዛንና ኢቃማ እንዳላቸው ማስረጀ አልመጣም። ነብዩም ሶለላሁ አለይሂ ወሰለም ሶሀቦቻቸውም አላደረጉትም።',


  'ማፏጨት አስገዳጅ ነገር ከሌለ በስተቀርና ሰዎች በዚህ ካልሆን መግባባት የማይችሉ  '
  'ከሆነና ከርቀት ያለን ሰው ለመጥራት የግድ ማፏጨት ካስፈለገ በስተቀር መፏጨት '
  'በኢስላም የሚጠላና ከመጥፎ ባህሪ የሚመደብ ተግባር ነው። አላህም ማፏጨት '
  'የጃሂልያዎች ተግባር መሆኑን በቁርአኑ እንዲህ ሲል አውስቶልናል። '
  '\" (የአላህ) ቤት ዘንድ ሶላታቸው ፋጨትና ጭብጨባ እንጂ ሌላ አይደለም።\" '
  '(ሱረቱል አንፋል ፣ 35)',



'ያለ ምንም ሸሪዓዊ ምክንያት ተከታታይ በሆነ መልኩ ሱብሂ  '
'ሶላት ላይ ቁኑት ማድረግ (ከሁለተኛው ሩኩዕ በኃላ ዱአ ማድረግ) '
'የሱና_ተቃራኒ የሆነ ተግባር ነው።ምክንያቱም ነብዩ ሶለሏሁ አለይሂ ወሰለም በዚህ መልኩ ቁኑት ሲያደርጉ አልነበረምና። '
' ነገር ግን ቁኑት የሚደረገው በሙስሊሞች ላይ ከባድ_ችግር ሲከሰት ብቻ ' 
'ሲሆን ቁኑቱም በሁሉም አምስት ወቅት ሶላቶች እንጂ የሱብሂ ሶላት ላይ የሚገደብ አይደለም።',



'ሱሪን ማስረዘም በሀዲስ በግልፅ እንደመጣው ሀራም ነው። ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል:— '
'\" ከቁርጭምጭሚት በታች የሆነ ሽርጥ የእሳት ነው።\" '
'ቡኻሪ ፣ 5787 '
 '\"ሽርጡን ለኩራት ብሎ ያስረዘመ ሰው አላህ የውመልቂያማ (በእዝነት) አይመለከተውም።\" '
 'ቡኻሪ ፣ 5788 '
'በተለይ የሚያስረዝመው ለኩራት ብሎ ከሆነ ደግሞ በኡለሞች ' 
'ስምምነት ከባኢር (ከከባባድ) ወንጀል ውስጥ ነው የሚገባው።',


'በመጀመሪያ ደረጃ ዳእዋ በእዝነት የተሞላ ሊሆን ይገባዋል። ታዲያ ይህን በተከተለ መልኩ '
'ዳዕዋ ተደርጎለትና ተመክሮ በዛው ላይ ለቀጠለ ግለሰብ ማኩረፉ እንዲሁ በደፈናው '
'የሚፈቀድ ወይም የሚከለከል ሳይሆን በዝርዝር መልኩ የሚታይ ነው። '
 'ይህም እሱን ማኩረፋ ካለበት ቢድዓ እና ወንጀል ይርቃል ወይም ' 
'ይቀንሳል ተብሎ የሚታሰብና ያለበት ጥመት መሆኑን እንዲነቃ የሚያደርገው ከሆነ የሚፈቀድና ፣ የሚበረታታም ተግባር ይሆናል። '

 'ነገር ግን እሱን ማኩረፋ ይበልጥ በሚሰራው ቢድዓ ላይ እንዲጨምርና በዛው ላይ '
'እንዲቀጥል የሚያደርገው ከሆነና በመኮረፋ ምንም የማይሰማው አይነት ከሆነ ማኩረፋ '
'ሌላ ጉዳት እንዲከተል ምክንያት መሆን ነውና የዚህን ጊዜ የሚከለከል ይሆናል።',




'መርሳት አላህ በቁርአኑ እንደጠቀሰው ከሸይጧን የሚመጣ ጉትጎታ ነውና አንድ ሰው የሆነ ነገርን '
'ለማስታወስ ሲቸገርና ሲረሳው ማድረግ ያለበት አላህን ማስታወስና አላህ ትዝ '
'እንዲያስብለው አላህን ዱዓ ማድረግ ነው።ለዚህም አላህ እንዲህ ይላል:— '
'\"በረሳህም ጊዜ ጌታህን አውሳ\" '
'ሱረቱል ከህፍ ፣ 24 '

'ነገር ግን በዚህ ፈንታ ሶላዋት [አሏሁመ_ሶሌ_አላ_ሙሀመዲን] ማለት በሸሪዓችን ' 
'መሰረት የሌለው ተግባር ነው። በዚህ ዙሪያ የመጣውም ሀዲስ በጣም ዶዒፍና ቅጥፈት ነው።',


'እግር ኳስ ጨዋታን ማየትና መከታተል የሚከተሉት መጥፎ ነገራቶች ስለሚገኙበት ብዙ '
'ኡለሞች የተከለከለ ነው ይላሉ ምክንያቱም ወደ መጥፎ ነገር የሚያዳርሰው ነገር ራሱ ሀራም ነውና። ከነዚህም መጥፎ ነገራቶች መካከል:— '

 'አብዛኛው ጨዋታ በቁማር የሚካሄድ መሆኑ ፣ '
 'የአብዛኞቹ ተጨዋቾች ሀፍረት ገላ የተገለጠና በጨዋታም ውስጥ የሚገለጥ መሆኑ ፣ '
 'በዳኝነትም ይሁን በተመልካችነት ወንድና ሴቶች የሚቀላቀሉበት መሆኑና፣ '
 'የሙዚቃ መሳሪያዎች ያለው መሆኑ ሀራም ያደርገዋል።',


 'ሎተሪ ብሎ ማለት የሆነ ሰው የተወሰነ ትንሽ ገንዘብ ከፍሎ እጣ ካወጣ በኃላ እጣው ከደረሰው '
'ትልቅ ገንዘብ የሚያገኝበት አሰራር ነው። ይህ ደግሞ ግልፅ የሆነ ቁማር ነውና በሸሪዓችን በቁርአንም '
'በሀደስም የተከለከለ ተግባር ነው። በዚህ መልኩ የተገኘን ገንዘብ መጠቀምም ሆነ ለደሀና ለሚስኪኖች '
'ማከፋፈልም ሀራም ነው። ለራሱ የተጠቀመው ሀራም አነሰና ለሚስኪኖች ሀራም ገንዘብ መስጠት ይበልጥ ወንጀሉን የከፋ ያደርገዋል።',


'የተለያዩ ሸቀጦችን በኮንትሮባንድ ከተለያዩ ሀገራትና ከተለያዩ ክልሎች ያለ '
'መንግስቱ ፈቃድ ማስገባት እና ኬላ ላይ ለሚጠብቁ ተቆጣጣሪዎች እንዲያሳልፉን ብር መስጠት እንዴት ይታያል⁉️ '

'ኮንትሮባንድ የሚለው የእንግሊዝኛ ቃል የአንድን ሀገር ህግ በሚቃረን መልኩ እቃዎችን '
'ማስወጣትና_ማስገባት እንዲሁም የተከለከሉ ነገሮችን ማምረትና ባለቤት መሆን ማለት ነው። '

 'ታዲያ ይህ ተግባር ማህበረሰቡን በቀጥታም ሆነ በተዘዋዋሪ የሚጎዳ ተግባር መሆኑ '
'እስከተረጋገጠ ድረስና ሰዎችን በማታለል የሚፈፀም በሆኑ እቃው ሀላል የሆነ ነገር ይሁን ' 
'ሀራም የተከለከለ ነው። ይህን ተግባር እየፈፀሙ ጭራሽ ከተቆጣጣሪዎች ለመዳን ብሎ ጉቦ መስጠት ደግሞ ሀራምነቱን የከፋ ያደርገዋል።',


'ማስተርቤሽን (ሴጋ) ወይም ራስን በራስ ማርካት በሸሪዓችን የተከለከለና የተወገዘ ተግባር '
'ለመሆኑ በርካታ ኡለሞች በየአጋጣሚው ይናገራሉ። ለዚህ አቋማቸውም ይህን የአላህ ንግግር እንደመረጃ ይጠቀማሉ ፣ '
'\" እነዚያ (ሙእሚኖች) ብልቶቻቸውን ጠባቂዎች የሆኑት ናቸው ፣ በሚስቶቻቸው ወይም '
'በባሪያዎቻቸው ላይ ሲቀር እነሱ የማይወቀሱ ናቸው። ከዚህ ውጭ ሌላን የፈለጉ ሰዎች እነዚያ ወሰን አላፊዎች ናቸው።\" '
' ሱረቱል ሙእሚኒን ፣ 5 - 7 '
'ይህ የቁርአን አንቀፅ ከሚስቶች ውጭ ባለ ነገር ስሜትን መወጣትና ራስን ማርካት የሙእሚኖች '
'ባህሪ እንዳልሆነና ይህንን የሚያደርግ ደግሞ የሚወቀስ መሆኑን ያመለክተናል። ከዚህም በተጨማሪም '
'በጤንነት እና በሰውነት አካል ላይ የጎንዬሽ ጉዳት እንዳለው የዘርፉ ባለሙያ የሆኑ ዶክተሮችም ይናገራሉ።',




'በመጀመሪያ ደረጃ ሸሪዓችን አሚን ማለትን ያልደነገገበት ሁኔታ ካልሆነ በስተቀር '
'በማንኛውም ዱአ ላይ አሚን ማለት የተደነገገ ነው። ከነዚህ ዱአዎች መካከል የጁሙአ '
'ኹጥባ ዱአ አንዱ ነው። በዚህ ወቅት ኸጢቡ ዱአ ሲያደርግ አሚን ማለት ይቻላል። '
'ምክንያቱም በዱአ ጉዜ አሚን በማለት ዙሪያ የመጡት ሀዲሶች ጥቅል መልእክት ያላቸው ናቸውና። '
'ነገር ግን እዚህ ዱአ ላይ ድምፅን ከፍ አድርጎ አሚን ማለትም ሆነ በጀመዓ '
'በአንድ ድምፅ አሚን ማለት እንዲሁም እጅን ከፍ ማድረግ አልተደነገገም። መሰረት የሌላቸው ተግባራት ናቸው። ',



'በሸሪዓችን አንድ ሰው ሲያዛጋውና ሲያፋሽግ ከቻለ አፉን ለመዝጋት ይሞክር ፣ '
'ካልቻለ ደግሞ እጁን አፉ ላይ ያስቀምጥ እንጅ አዑዙ_ቢላሂ_ሚነሸይጧኒ_ረጂም ይበል የሚል የለም። ' 
'ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም በሀዲሳቸው እንዲህ ብለዋል:— '
'\" አሏህ የሚያስነጥሱትን ይወዳል ፣ ማፋሸግን ይጠላል ፣ አንድ ሰው ሲያስነጥስ አላህን ያመስግን ፣ '
'የሰማውም ማንኛውም ሙስሊም ሊመልሰው ይገባል። ማፋሸግ ግን ከሸይጧን ነው። '
'በቻለው አቅም አፉን ለመመለስ (ለመዝጋት) ይሞክር ፣ ምክንያቱም ሸይጧን ሀ ሲል (አፋን ሲከፍት) ይስቃልና።\" '
 'ቡኻሪና (6223) ሙስሊም (2994) ዘግበውታል ',



 'እጅ ብዙ ጊዜ ከመቆሸሽ የማይወገድና በተለይ ስራ ላይ ከሆኑ በንፅህና ለመጠበቅ '
'አስቸጋሪ ስለሚሆን እጅ ላይ ቆሻሻ እስካለ ድረስ እጅን ከምግብ በፊት መታጠብ ተገቢ ነው። '
'ብዙ ኡለሞችም ይወደዳል ብለዋል። ነገር ግን ምንም ቆሻሻ የሌለው ከሆነና ንፁህ ከሆነ እጅን ዝም '
'ብሎ ምግብ ስለቀረበ ብቻ መታጠብ የሱና ተፃራሪ ተግባር ነው። በዚህ ዙሪያ የመጡ ሀዲሶችም ዲዒፎች ናቸው።',



'ቀብር ላይ አበባ ማስቀመጥም ሆነ ውሀ ማጠጣትም ይሁን ቀብርን ሲዘይሩ ቀብሩ ላይ '
'ቁርአን_መቅራት ይህ ሁሉ በሸሪዓችን መሰረት የሌላቸው ቢድዓዎች ናቸው። ከዚህም '
'በተጨማሪ ከካፊሮች ጋር መመሳሰልና ቀብሩንም ወደ ማላቅና ማካበድ ደረጃ የሚያዳርስ ተግባር ነው። '
'ከዚህ መጠንቀቅና ማስጠንቀቅ ይህን ባወቀ ሰው ሁሉ ላይ ግዴታ ነው።',



'በሸሪዓችን የሚስት ፍቃደኝነት እስካለ ድረስ በግኑኝነት ወቅት የዘር ፈሳሽን '
'ውጭ ላይ ማፍሰስም ሆነ ኮንዶም መጠቀም የሚጠላ ተግባር ከመሆኑ ጋር ግን ይፈቀዳል። '
'ለዚህም ጃቢር ኢብኑ አብደሏህ እንዲህ ይላሉ: '
'\"በነብዩ (ሶለሏሁ አለይሂ ወሰለም) ዘመን (የዘር ፈሳሽን) ውጭ ላይ እናፈስ '
'ነበርና ይህ ጉዳይ ነብዩን ደርሷቸው ነበር ነገር ግን አልከለከሉንም።\" '
'[ቡኻሪና (250) ሙስሊም (160) ዘግበውታል]\n\n '

 'ነገር ግን ከላይ እንደተጠቀሰው የሚጠላ ተግባር ለመሆኑ ደግሞ ነብዩ (ሶለሏሁ አለይሂ ወሰለም) '
'አንድ ጊዜ የዘር ፈሳሽን ውጭ ላይ ስለማፍሰስ ሲጠየቁ "ይህ ድብቁ ልጅን ከነ ህይወት መቅበር ነው።\" ብለዋል። '
'[ሙስሊም ዘግበውታል (1442)]\n '

'በላጩ ማንኛውም ሙስሊም ሚስቱ እርግዝናን ለመሸከም የሚያስቸግራት '
'አይነት በሽታ ካለባትና ብታረግዝ ትጎዳለች ተብሎ የሚታሰብ እስካልሆነ ድረስ ይህን ከማድረግ መቆጠብ ይኖርበታል። ',



'በሸሪዓችን ክልከላ የመጣባቸው የልብስ ቀለም አይነቶች ካለሆኑ በስተቀር ሁሉም '
'አይነት የልብስ ቀለም ይፈቀዳል። ለወንድ ልጅ የተከለከሉት የልብስ ቀለም አይነቶች ሶስት ሲሆኑ እነሱም '
'ቀይ ብርቱካናማ እና ቢጫ ቀለሞች ናቸው። ለእያንዳንዱም ሶሂህ የሆኑ ሀዲሳዊ ማስረጃ አላቸው። እነሱም: '

': ሌላ ቀለም ያልተቀላቀለበት ንፁህ ቀይ ልብስ:— ኢብኑ አባስ እንዲህ ይላሉ:\" ' 
'ቀይ ልብስ ፣ የወርቅ ቀለበት እና ሩኩዕ ላይ ሆኖ መቅራትን (በነብዩ ሶለሏሁ አለይሂ ወሰለም) ተከልክያለሁ።" [ነሳእይ ዘግበውታል (5171)]\n\n '

': ሌላ ቀለም ያልተቀላቀለበት ንፁህ ብርቱካናማ ልብስ:—  አብደሏህ ኢብኑ ዑመር ኢብኑል ዓስ እንዲህ ይላሉ: '
'\"ነብዪ (ሶለሏሁ አለይሂ ወሰለም) እኔ ላይ ሁለት ብርቱካናማ ልብሶችን አዩብኝና :"ይህኮ የኩፋሮች ልብስ ነውና '
'አትልበሳቸው" አሉኝ። [ሙስሊም ዘግበውታል (2077)]\n\n '

': ሌላ ቀለም ያልተቀላቀለበት ንፁህ ቢጫ ልብስ:— "ነብዩ (ሶለሏሁ አለይሂ ወሰለም) '
'አንድ ወንድ ቢጫ ልብስ መልበሱን ከልክለዋል።" [ቡኻሪና(5846) ሙስሊም (2101) ዘግበውታል]\n\n '

' እነዚህ ልብሶች ከሌላ ቀለም ጋር ተቀላቅለው ከተሰሩ ግን በኡለሞች መካከል ልዩነት ቢኖረውም '
'በላጩ ግን መልበሱ እንደሚፈቀድ ነው። ለሴት ልጅ ግን ለአጂነቢ ይፋ የምታደርገው እስካልሆነ '
'ድረስ የትኛውንም የልብስ ቀለም አይነት መልበስ ትችላለች።',



'ሩቃ (የታመመ ሰው ላይ ሲቀራ) የሚደረገው አንድ ሰው በግሉ የሚቀራው እንጅ '
'በጀመዓ በአንድ ድምፅ መቅራት በሸሪዓችን መሰረት የሌለው ተግባር ነው። '
'ነገር ግን አንድ ሰው ሲቀራ ከደከመው ሌላው ሰው ቢቀይረው ችግር የለውም። '
' የሴትና የወንድ መቀላቀል ለተባለው ደግሞ በሸሪዓችን አጂነቢ የሆኑ ወንድና ሴቶች '
'ያለ ምንም መጋረጃ መቀላቀላቸው ፈፅሞ የማይፈቀድና የተከለከለ ተግባር መሆኑ ግልፅ ነው። '
'ስለዚህ ሩቃ የሚቀራላት ልጅ ከመጋረጃ ጀርባ በሴቶች ተይዛ እንጅ በአጂነቢ ወንዶች መካከል ልትሆን አይገባም። '
'ነገር ግን ሴቶች እሷን መቋቋም የማይችሉበት ደረጃ ላይ ከደረሱ ከአቅማቸው በላይ ከሆነች ግን '
'ወንዶች ገብተው ማስተካከልና መያዝ ይችላሉ። ይህም ለህክምና ሲባል ከሚፈቀድባቸው ጉዳዬች መካከል ይገባል።',



'ቁርአንን በቤትም ይሁን በመኪናም ላይ ይሁን በየትኛውም አካባቢና ሁኔታ ላይ '
'ማንጠልጠልና መስቀል ከሚከተሉት ነጥቦች አንፃር ኡለሞች ዘንድ የተወገዘና የተከለከለ ተግባር ነው። \n\n'

'1 : ቁርአን የወረደበትን አላማ የሚያስት ተግባር መሆኑ ፣ ይህም ማለት ቁርአን የወረደው '
'ሰዎችን ወደ ቅኑ መንገድ ለመምራት ፣ ለመምከርና እርሱን በማንበብ ይጠቀሙ ዘንዳ እንጅ ለቤት ማስጌጫና ማስዋቢያነት አይደለምና። \n\n'
'2: በአብዛህኛው ይህን የሚያደርጉ ሰዎች ከማንጠልጠላቸው በረካንና_ፈውስን ፈልገውበት ነውና '
'የሚያደርጉት ይህ ደግሞ በሸሪዓችን መሰረት የሌለው ቢድዓ ተግባር ነው። ቁርአንን በማንበብና '
'በማስተንተን እንጅ በማንጠልጠል ፈውስና በረካ አይገኝም። ስለዚህ ወደ ሽርክ የሚያዳርስ ተግባር ነው። \n\n'

'3: ይህ ተግባር የሰለፎችን መንሀጅ የሚፃረር ነው። ለዚህም እንኳን ነብዩ (ሶለሏሁ አለይሂ ወሰለም) '
'እና ሶሀቦቻቸውን ይህን ሊያደርጉ ይቅርና ሰለፎችም በአጠቃላይ ይህን አለማድረጋቸው ተግባሩ መሰረት የሌለው መሆኑን ያመለክታል። \n\n'
'4: ይህ ጉዳይ ልክ እንደንግድ መያዙና የአሏህን ቃል ይባስ ብሎ በወርቅና በብር '
'በሌሎችም ነገራቶች በማሸብረቅና በመስራት ለሰዎች መሸጥ በቁርአን ከመብላት የሚከለክለውን ሀዲስ በግልፅ የሚፃረር ተግባር ነው።',



'በሸሪዓችን እጅ ጣቶች የሚደረጉ ማንኛውንም አዝካሮች ማድረግ በላጩ_በቀኝ እጅ ነው። '
'ለዚህም ቡኻሪና ሙስሊም በዘገቡት ሀዲስ እንደመጣው ነብዩ ቀኝ እጃቸውን ለጥሩ ነገር ይጠቀሙ '
'እንደነበርና ግራን ደግሞ ከዛ ውጭ ይጠቀሙ እንደነበር መዘገቡ በላጩ በቀኝ መሆኑን ያመለክታል። '
'ነገር ግን በግራ እጅም ማድረግ ሀራም ወይም ቢድዓ ደረጃ የሚያደርስ ተግባር አይደለም።',


'መጀመሪያ ማክበር ሲባል ግዴታ ፕሮግራም ማዘጋጀት ብቻ አይደለም። '
'ያንን ቀን በስጦታም ይሁን በማንኛውም ነገር በሌላ ቀን በማይደረግ ነገር ቀኑን መለየትና ትኩረት መስጠትም ጭምር ነው። '
'ታዲያ በሸሪአችን እንደሚታወቀው እንኳን ባለትዳሮች የተጋቡበትን ቀን '
'ይቅርና ከሰው ልጆች በአጠቃላይ በላጭ የሆኑት ነብያችን ሶለሏሁ አለይሂ '
'ወሰለም እንኳን ወደ ምድር የመጡበትን ቀን (መውሊድ) ማክበር የማይፈቀድና '
'በሸሪዓችን መሰረት የሌለው ቢድዓ ተግባር መሆኑ ግልፅ ነው። ይህ የባለትዳሮች '
'የተጋቡበትን ቀን ማስታወሺያ ፕሮግራም ደግሞ የከሀዲያን ተግባር ነውና ከነሱ ጋር መመሳሰል ስለሚሆን የሚከለከል ተግባር ነው።',



'ምንም ያክል ፎቶ_ሀራም ቢሆንም ማጨት የሚፈልግ ወንድም ሆነ ሴት የሚያጩትን ሰው '
'በአካል በማግኘት ፊቱንና_እጁን እንዲሁም ብዙ ጉዜ የሚታየውን የሰውነት አካል ማየት ይችላሉ። '
'ነገር ግን በአካል መገናኘት ባይችሉና መልካቸውን መተያየት አስፈላጊ ሆኖ ከተገኘና የሚከተሉት '
'መስፈርቶች ከተሟሉ ፎቶዋን መላክ ትችላለች ፣ እሱም እንደዛው: እነሱም: \n\n'
 
'1 የምትልክለት ሰው መልካን ካየ በኃላ ከተመቸቺው ለማግባት ቁርጠኛ የሆነ አቋም ያለው እንጅ ዝም ብሎ '
'ያቺንም_ያቺንም የሚያማርጥ መሆን የለበትም። ይህን ማረጋገጥ አለባት። እንዲሁ ለጠየቃት ሁሉ መስጠት የለባትም። '
 'እሷን ለማግባት ቁርጠኛ አቋም ያለው መሆን አለበት። \n\n'

'2 የምትልክለት ፎቶ ከፊቷና ከእጇ እንዲሁም በአብዛህኛው ግልፅ ከሚሆነው ሰውነት አካሏ '
'ውጭ ያለውን ሰውነታን የሚያሳይ ፎቶ መሆን የለበትም።\n\n '

'3 ሰውዬውም ታማኝ ሰው መሆን አለበት። አለበለዚያ ፎቶውን ከላከችለት በኃላ ለሌላ ሰው '
'ሊያሰራጨውና በሷ ፎቶ ስምም መጥፎ ነገር ሊሰራበት ይችላልና ለመጥፎ ነገር እንደማይጠቀመው እርግጠኛ መሆን ያስፈልጋል። \n\n'

'4 ፎቶውንም እሱ ብቻ እንጅ ሌላ አጂነቢ እንደማያየው መረጋገጥ አለበት። ካየው በኃላም '
'ሊያጠፋው ይገባል። እሱ ጋር መቀመጥ የለበትም። ምክንያቱም አንዲትን አጂነቢ ከአንድ ጊዜ '
'በላይ አስፈላጊ ከሆነም ከሁለት ጊዜ በላይ መመልከት ስለማይችል።ስለዚህ '
'እነዚህ ካለይ ያሉት መስፈርቶች ካልተሟሉ በስተቀር ፎቶን መላላክ አይፈቀድም።',




'በሸሪዓችን አንድ ሰው ዱአ ሲያደርግ ሌሎች በጀመዓ አሚን ማለታቸው የተደነገገና '
'የተፈቀደ እንዲሁም ዱዓው ተቀበይነት ይኖረው ዘንዳም ሰበብ የሚሆንበት ነው። '
'ሆኖም የተወሰኑ ሰዎች ዱዓውን ለማድረግ ብቻ ብለው የተሰባሰቡና ዱዓውንም '
'በአንድ_ድምፅ የሚያደርጉት ከሆነ ይህ በሸሪዓችን መሰረት የሌለው የሆነ ቢድዓ ተግባር ነው። '
' ነገር ግን ከዳዕዋዎች ፣ ከቂርዓቶችና ከመሳሰሉት ምክክሮች በኃላ አቅሪው ወይም '
'ዳዒው ዱዓ አድርጎ ተማሪውና አዳማጩ በጀመዓ አሚን ቢሉ በሸሪዓችን መሰረት ስላለው ቸግር የለውም። '
'ለዚህም ኢብኑ ዑመር በዘገቡት ሀዲስ ላይ እንዲህ ይላሉ: \" ነብዩ (ሶለሏሁ አለይሂ ወሰለም) (ለምክርና ለግሳፄ) '
'ተቀምጠው እነዚህን ዱዓዊች ለሶሀቦቻቸው ያላደረጉባቸው ቀናት አናሳ ናቸው።"  ብለው ዱዓውን ይዘረዝራሉ።\" '
'ቲርሙዚ ዘግበውታል ፣ 3502 '

'ባይሆን እዚህ አይነቱ ዱዓ ላይ እጅን_ማንሳት ለዳኢውም ይሁን ለአድማጩ '
'መሰረት የሌለውና ማስረጃ ያልመጣበት ነገር ነውና እጅን ማንሳት ተገቢ አይደለም።',


'በሸሪዓችን የተደነገገው የሞተን ሰው በተቻለ መጠን ለመቅበር መቻኮልና ብዙም አለማቆየት ነው። '
'ምክንየቱም ነብዩ ሶለላሁ አለይሂ ወሰለም እንዲህ ብለዋልና ፣ \"ጀናዛን አቻኩሉት (ቶሎ ቅበሩት) ፣ '
'(ምክንያቱም) ጀናዛው መልካም ከሆነ ወደ ጥሩ ነገር ስለምትወስዱት ነው ፣ '
'ከዛ ውጭ ከሆነ ደግሞ መጥፎ ነገርን ትከሻችሁ ላይ  አስቀኝጣችኋልና።\" '
'ቡኻሪ (1315) ፣ ሙስሊም (944) '
'ከዚህ ውጭ ግን በቅርብ የሚገኝ ዘመድ እንዲሳተፍ ዘንዳ ለሰአታት ማዘግየቱ የሚከለከል አይሆንም። '
'ነገር ግን ሩቅ ያለ ሰውም ቢሆን ቀብሩ ላይ መሳተፍ የማይችልበት ሁኔታ ላይ ከሆነ ችግር የለውም። ' 
'ከተቀበረም በኃላ ወደ ቀብሩ ሂዶ ቀብሩ ላይ መስገድ ይችላል። ይህም ከነብዩ ሶለላሁ አለይሂ ወሰለም ተግባር ተገኝቷል።',



'ጀማዓቱ ተብሊግ እ.ኢ.አ. በ1926 በህንድ ሀገር በሙሀመድ_ኢልያስ አልካንደህለዊይ '
'መስራችነት የተመሰረት ከዛም ቀስ በቀስ ወደ ፓኪስታንና ባንግላዲሽ ብሎም በአለም ላይ እየተስፋፋ '
'የሚገኝ ቢድን ነው። ታዲያ በዚህ ቡድን አካሄድና አቋም ዙሪያ ላይ በተለያዩ አጋጣሚዎች በርካታ '
'ኡለሞች ያላቸውን አቋም ግልፅ አድርገዋል። ያሉባቸውን የተለያዩ ነጥቦችን በማንሳት ከአህለሱና '
'ከወጡት ከጥመት ቡድኖች መሆናቸውንም ገልፀዋል። ከነዚህ ነጥቦች መካከል:— \n\n'

'1: የአህለሱና ወልጀመዓን አቂዳ አለማስተላለፋቸውና በዚህ ጉዳይ ላይ በጣም ደካሞች መሆናቸው ፣ '
'ምክንያቱም አሏህ እንዲህ ይላልና \"በርግጥም በሁሉም ህዝቦች ላይ አሏህን ተገዙ ፣ '
'ጣኦታትንም ራቁ ብለን መልእተኞችን የላክን ቢሆን እንጅ አላክንም\" '
' [ሱረቱ ነህል ፣ 36] \n\n '

'2: ሸሪዓዊ ለሆነው ኢልም (እውቀት) ትኩረት አለመስጠታቸውና በመስማት '
'ላይ ብቻ የተመረኮዘ ኢልም ይዘው ዳእዋ ያለ በቂ እውቀት ማድረጋቸው ፣ '
'ለዚህም አሏህ እንዲህ ይላል: \"በል : ይህች መንገዴ ናት ፣ ወደ አሏህ እጣራለሁ ፣ '
'እኔም እኔንም የተከተሉኝ በግልፅ ማስረጃ (ጥልቅ እውቀት) ላይ ነን ፣ ጥራትም ለአሏህ የተገባው ነው ፣ እኔም ከአጋሪዎች አይደለሁም።\" '
'[ሱረቱል ዩሱፍ ፣ 108]\n\n '

'3: የቁርአን አንቀፆችን ስሜታቸውንና ፍላጎታቸውን ባገናዘበ መልኩ ጠምዝዘው መተርጎማቸው ፣ '
'ከነዚህም መካከል ስለ ጂሀድ የሚያወሩ \"መውጣት\" የሚል ቃል ያለባቸውን አንቀፆች በሙሉ \"ለዳእዋ_መውጣት\" በሚል መተርጎማቸው ፣\n\n '

'4: የሚወጡባቸውን የዳዕዋ ወቅቶችን በቀናት ፣ በወራትና በአመታት ቁጥር መገደባቸውና '
'ለዚህም ገደባቸው ምንም ግኑኝነት የሌላቸው ስለ ሌላ ቁጥር የሚያወሩ የቁርአን አንቀፆችን ማስረጃ ማቅረባቸው ፣ \n\n'

'5: ዶዒፍ የሆኑና የተቀጠፋ ሀዲሶችን እንዲሁም መሰረተ_ቢስ የሆኑ እንቶፈንቶ '
'ወሬዎችን በዳዕዋቸው ላይ መጠቀማቸውና ከዚህ የጠሩ ዳእዋዎችን ደረቅ ዳእዋ ብለው ማለታቸው ፣\n\n '

'6: ከመጥፎ ነገራቶች አለመከልከላቸው ፣ በተለይ የሽርክና የቢድዓ ተግባራትን '
'በየመስጂዱ እያዩ ዝም ከማለትም ባለፈ በዳዕዋ ስም አብረው መተግበራቸውና መተባበራቸው ፣ '
'ለዚህም አሏህ እንዲህ ይላል ፣ \"ከናንተ መካከል ወደ መልካም የሚጣሩ ፣ በመልካም የሚያዙ ፣ '
'ከመጥፎ የሚከለክሉ ህዝቦች ይኑሩ ፣ እነዚህ እነሱ ናቸው የዳኑት።\" '
'[ሱረቱ አል ኢምራን ፣  104]\n\n '

'7: ለዳእዋ መውጣትን ከብዙ ዒባዳዎች ፣ ከጅሀድና እውቀትን ከመማር በላይ ማስበለጣቸው ፣ \n\n'

'8:  ለዳእዋ መውጣት በሚል የሚስትንና የልጆችን ሀቅ አለመጠበቃቸውና መበደላቸው ፣ '
'ይህም ለቤተሰብ የሚችለውን ያክል ሳያስቀርና ሀቃቸውን ሳይወጣ እንዲሁ ሰበብ ሳያደርስ '
'በተወኩልና በየቂን ብቻ ትቷቸው ዳእዋ እንዲወጣ ማነሳሳታቸው ፣ \n\n'

'በጥቅሉ እነዚህ ጀመዓዎችን በተቻለ አቅም ማስተማርና ወደ ትክክለኛው የአህለሱና ወልጀመአ '
'አካሄድ እንዲመጡ መጥራት እንጅ ከነሱ ጋር አብሮ መጓዝና መሄድ ከላይ ከተጠቀሱትና '
'ከሌሎችም ነጥቦች አንፃር የማይፈቀድ መሆኑን ኡለሞች ገልፀዋል።',



'የረጀብ ወር ምንም ያክል የተከበሩ አራት ወራት ተብለው በቁርአን ውስጥ ከተጠቀሱት '
'ውስጥ አንዱ ቢሆንም ነገር ግን ይህን ወር ሙሉውንም ሆነ ከፊሉን መፆምም ሆነ '
'በማንኛውም የኢባዳ አይነት ይህን ወር መለየት የተለየ ደረጃ እንዳለው የሚያመለክት '
'ትክክለኛ ሀዲስ አልተገኘም። በዚህ ዙሪያ የመጡት ሀዲሶች የተቀጠፋና በጣም ደካሞች ናቸው።',



'ፀጉሩን ማሳጠርም ሆነ መላጨት የሚፈልግ ማንኛውም ሙስሊም ፀጉሩን '
'ሲያሳጥርም ሆነ ሲላጭ እኩል_በኩል በሆነ መልኩ እንጅ ከፊሉን ከከፊሉ '
'አስበልጦ ማሳጠርም ሆነ መላጨት በሸሪዓችን የተከለከለ ነው። '

 'ለዚህም ኢብኑ ዑመር ረዲዬሏሁ ዓንሁ ከነብዩ ሶለላሁ አለይሂ ወሰለም ሰምቻለሁ '
'ብለው እንደተናገሩት \"ቀዘዕ ከሚባለው ከልክለዋል።\" ብለዋል። \n\nቀዘዕ የሚለውን '
'ቃል ይህን ሀዲስ ከዘገቡት ዘጋቢዎች መካከል የሆነው ናፊዕ እንደተናገረው '
'ቀዘዕ ማለት የህፃናትን ፀጉር ከፊሉን ላጭቶ ከፊሉን መተው ነው። '
'ቡኻሪና (5921)  ሙስሊም (2120) ዘግበውታል '

'በሌላም ሀዲስ ነብዪ ሶለሏሁ አለይሂ ወሰለም አንድን ህፃን ልጅ ፀጉሩ '
'ከፊሉ ተላጭቶ ከፊሉ ተትቶ ሲያዩ ጊዜ ከዚህ ከለከሉና እንዲህ አሉ: \"ወይ ሁሉንም ላጩት ፣ አለያ ሁሉንም ተውት።\" '
'ነሳእይ (5048) ፣ እና አቡዳውድ (4195) ዘግበውታል ፣ አልባኒም ሶሂህ ብለውታል።',



'የሶላተ ተራዊህ የረከአዎች ብዛት ላይ አንዳንድ አካላት ከሀዲሳዊ ማስረጃዎችና ከሰለፎች አረዳድ '
'ባፈነገጠ መልኩ ለሁለት ጫፍ የረገጡ ሀሳቦች ተከፍለዋል። አንደኛው አካል የተራዊህ ረከአ '
'ከአስራአንድ በላይ የጨመረን ቢድአ እንደፈጠረ በመቁጠር በሱ ላይ ሲያጥላሉ በአንፃሩ '
'ሌላኛው አካል ደግሞ በአስራአንድ ረከአ ላይ ብቻ የተገበደንና ከዛ በላይ ያልጨመረን '
'ሰው የኡለሞችን ኢጅማዕ ጥሷል በሚል ምክንያት ይህ አይነቱን ሰው ሲያጥላሉ ይታያል። '
'ሆኖም ሁለቱም ከማስረጃ አንፃር ተገቢ ያልሆኑ በመሆናቸው በዚህ ርእስ ከመጨቃጨቅና ከመነታረክ መቆጠብ ያስፈልጋል። \n\n'

'ይህ ርእስ ከሸሪዓዊ ጥቅሶችና ከሰለፎች አረዳድ አንፃር ሰፋ ያለ ጉዳይ ነው። ይህም '
'ማለት በተራዊህ ረከአ ብዛት ላይ ማንኛውም ሰው የፈለገውን ያክል ረከአ መስገድ ይችላል። '
'ለዚህም ኢብኑ ኡመር በዘገቡት ሀዲስ ላይ አንድ ሰው ነብዩን ሶለሏሁ አለይሂ ወሰለም ስለ '
'ሌሊት ሶላት ሲጠይቃቸው እንዲህ ብለዋል \"የሌሊት ሶላት ሁለት_ሁለት ነው ፣ ከእናንተ '
'አንድኛችሁ የሌሊቱን መንጋት ከፈራ የሰገደውን ሶላት ዊትር የምታደርግለትን አንዲት ረከአ ይስገድ።\" '
'[ቡኻሪ (946) እና ሙስሊም (749) ዘግበውታል]\n\n '

'ከዚህ ሀዲስ እንደምንረዳው የሌሊት ሶላት ሁለት ሁለት እያደረጉ መስገድ እንጅ የረከአው '
'ብዛ ልክ አለመጠቀሱ ገደብ የሌለው መሆኑን ያመለክታል። በሌላ ሀዲስ ላይ ነብዩ ሶለሏሁ '
'አለይሂ ወሰለም በረመዷንም ከረመዷን ውጭም  የሌሊት ሶላትን ሲሰግዱ ከአስራአንድ በላይ '
'አይጨምሩም ነበር የሚለው የአኢሻ ሀዲስ ተግባር እንጅ ንግግር '
'ስላልሆነ በኡሱል አል ፊቅህ መመሪያ መሰረት ተግባር ግዴታን አያመለክትም። \n\n'

'ከዚህም በተጨማሪም ታላላቅ የመዝሀብ ባለቤት የሆኑና አሉ የሚባሉ ታላላቅ የሰለፍ '
'ኡለሞችም ይህን ጉዳይ ላይ ሰፋ ባለ መልኩ ነው የተረዱት። ማለትም በሀነፍይ ፣ '
'በሻፊዕያ እና በሀንበሊ መዝሀብ እስከ 20 ረከአ ሲያሰርሱት ፣ በማሊኪ መዝሀብ ደግሞ '
'እስከ 36 እና 34 አድርሰውታል። ሌሎች በጣም በርካታ ኡለሞችና የማሊኪ ከፊል ተከታዬችም '
'11 ረከአ ላይ መገደብን መርጠዋል። ከዚህ የምንረዳው ጉዳዩ ሰፋ ያለና ማንም ሰው '
'በፈለገው የረከአ ብዛት ልክ መስገድ እንደሚችል ነው። ',



'ነሳእይ (2221) በዘገቡትና አልባኒም ሀሰን ነው ባሉት ሀዲስ ላይ እንደተገለፀው '
'በሸሪዓችን የሸዕባንን ወር ሙሉውን ባይሆንም አብዛኛውን ቀናት መፆም ወሩ መልካም '
'ስራዎች ወደ አለማቱ ጌታ ወደ አሏህ ከፍ የሚሉበት ወር በመሆኑ የተወደደ ተግባር ነው። '
'ለዚህም አቡዳውድ (2336) እና ኢብኑ ማጃህ በዘገቡት ሀዲስ ላይ ኡሙ ሰለማህ እንዲህ ብላለች: '
'\"ነብዩን ሶለሏሁ አለይሂ ወሰለም ሸዕባንን ከረመዷን ጋር ቀጥለው የፆሙ ቢሆን አንጅ ሁለት ወራትን በተከታታይ ሲፆሙ አላየሁም።\"\n\n '
'ሆኖም ምንም እንኳን ይህ ሀዲስና  አቡዳውድ ላይ የሰፈረው ንግግር ሸዕባንን ወሩን '
'ሙሉ ይፆሙ እንደነበር ቢያመለክትም ሙስሊም (1156) ላይ ከዓኢሻ ተይዞ በተዘገው '
'ሀዲስ ከሸእባን ትንሽ ሲቀር አብዛህኛውን ይፆሙ እንደነበር ያመለክታል። '

'ሙሉውን እንደፆሙ በሚያመለክተው ሀዲስ ላይ ከፊል ኡለሞች አንዳንድ አመታትን ሙሉውን '
'አንዳንድ አመታትን ደግሞ አብዛህኛውን መፆማቸውን ያመለክታል ሲሉ ሌሎች ደግሞ በአረቦች '
'የአነጋገር ዘይቤ ላይ አንድ ሰው አብዛህኛውን ከፆመ ሙሉውን እንደፆመ መነገሩ የተለመደ በመሆኑ  ነው ብለዋል።',




' ቁርአን የወረደው ተገንዝበነውና  አስተንትነነው እንድንሰራበት እንጅ ልክ እንደ አዛን '
'ሰዎችን ወደ መስጂድ መጥሪያነት እንድንጠቀመው አይደለም። ነብየም ሶለሏሁ አለይሂ '
'ወሰለም ሱናቸውን አጥብቀን ይዘን እሳቸውን ከመፃረርና በዲናቸው ላይ አዲስን ነገር ከመፍጠር እንድንቆጠብ አዘውናል።\n'
'- በሀገራችን በበርካታ መስጂዶች እንደሚስተዋለው ጁሙአ ቀን በማይክራፎን ቁርአን '
'መክፈት በሸሪዓችን መሰረት የሌለውና ነብዩም ሶለሏሁ አለይሂ ወሰለም ያላዘዙት ፣ '
'ሰለፎችም የማያውቁት ቢድአ የሆነ ተግባር ነው። በዚህ መልኩ የጁሙአ ቀን ሁሉም ሙስሊም '
'በግሉ ቢቀራቸው የሚወደዱ የቁርአን ምእራፎችን እንጅ መስጂድ ላይ ቁርአን '
'መክፈት የተወደደ መሆኑን የሚያመለክት ሸሪዓዊ ማስረጃ የለም።\n\n'
'- ሰዎችን ወደ መስጂድ ለመጥራት ታስቦበትም ከሆነ በጁሙአ '
'አዛን እንጅ በቁርአን መጥራት አልተደነገገም። የጁሙአ ቀን ስለሆነ ተብሎም ከሆነ በዚህ '
'መልኩ ጁሙአ ቀንን በሸሪዓችን ባልተደነገገው መልኩ መለየትም አይፈቀድም።',



'በሸሪዓችን ልብስን በተመለከተ ሸሪዓው ክልክል ካደረጋቸው ልብሶች በስተቀር ማንኛውም '
'ልበስ መልበስ የተፈቀደ ነው። ማለትም ልብሱ በሸሪዓችን የተከለከሉ ነገራቶች እስከሌሉበት እና '
'ከካፊሮችና ለወንዶች ደግሞ ከሴቶች ጋር መመሳሰል እስከሌለበት ድረስ ችግር የለውም። '

'ከዚህ ጋር ተያይዞ ከረባትን በተመለከተም አመጣጡ ከአውሮፓውያን እንደሆነ ቢነገርም '
'በአሁኑ ወቅት እንደአመጣጡ ካፈሮች ብቻ የሚለዩበት ልበስ ሳይሆን ሙስሊሞችም ጭምር '
'የሚጋሩት ልብስ ሆኗል። ስለዚህ አንድ ነገር ከካፊሮች ጋር መመሳሰል አለበት የሚባለው እነሱ '
'ብቻ የሚለዩበት ሲሆን በመሆኑ ከረባትን መልበስ ሌላ መጥፎ ኒያ እስካልታከለበት ድረስ የሚፈቀድ እንጅ የሚከለከል አይሆንም።',




];


List<String> appTitless2 = [

  'መውሊድ 1',
  'መውሊድ 2',
  'ተስቢህ',
  'ነሺዳ',
  'ለሞተ ሰው ቁርዐን መቅራት',
  'ኮከብ እና ጨረቃን ለመስጅድ ሚናራ መጠቀም',
  'ጁምዐ ሙባረክ ማለት',
  'ሰ.ዐ.ወ / a.w.w ',
  'ሱሪ መልበስ(ለወንድ)',
  'ለዱዐ እጅ አነሳስ',
  'ጫት',
  'ጀምዕያ ማቋቋም',
  'ሰለፍ ነኝ ማለት',
  'ተቃውሞ ሰልፍ',
  'ኢኽዋነል መስሊሚን',
  'የቀለበት ዝግጅት',
  'ሙብተዲዕ ጋር ቁርዐን መቅራት',
  'ፎቶ መነሳት',
  'ልብወለድ',
  'ደም መለገስ',
  'ሶደቀላሁል ዒዚም ማለት',
  'ኢንሹራንስ',
  'የሰባቱ ሶደቃ ለሞተ ሰው',
  'የተሀጁድ አዛን',
  'ፋጨት',
  'የሱብሂ ቁኑት',
  'ሱሪን ማስረዘም',
  'ሙብትዲዕን ማኩርፍ',
  'መርሳት',
  'ኳስ ጨዋታ ማየት',
  'ሎተሪ መግዛት',
  'ኮንትሮባንድ በኢስላም',
  'ማስተርቤሽን(ሴጋ)',
  'የኹጥባ ዱዐ',
  'ማፋሸግ',
  'ከምግብ በፊት እጅን መታጠብ',
  'ቀብር ላይ አበባ',
  'ኮንደም መጠቀም',
  'ቢጫ ልብስ መልበስ',
  'ሩቃ በጀምዐ መቅራት',
  'ቁርዐን መስቀል',
  'በግራ እጅ ተስቢህ',
  'የሰርግ ማስታወሻ ዝግጅት',
  'ፎቶ መላላክ',
  'ዳዕዋን በዱዐ መዝጋት',
  'ጀናዛ ማዘግየት',
  'ተብሊግ',
  'ረጀብን መጾም',
  'የጽጉር አቆራርጥ',
  'የተራዊህ ረከአ',
  'ሻዕባንን መጾም',
  'ቁርዐን በማይክ መክፈት',
  'ከረባት መልበስ',

];



List<String> sources2 = [

  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ',

  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ',

  'ሸይኹል ኢስላም ኢብኑ_ተይሚያ፣\n'
  'ሸይኽ ኢብኑ_ኡሰይሚን እና\n'
  'ሸይኽ ኢብኑ_ባዝ ረሂመሁሙሏህ',

  'ኢብኑ ባዝ ፣\n'
  'ኢብኑ ዑሰይሚን፣\n'
  'ሸይኹል አልባኒ፣\n'
  'ሸይኽ ፈውዛን ፣ እና ሌሎችም በርካታ ዑለሞች',

  'ኢብኑ ባዝ ረሂመሁሏህ ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',

  'ሸይኽ ሙሀመድ ሷሊህ አልሙነጂድ፣ ፈትዋ/1528',

  'ሸይኽ ኢብኑ ባዝ ፣ \n'
  'ሸይኽ ኢብኑ ዑሰይሚን ፣\n'
  'ሸይኽ ሷሊህ አል ፈውዛን— መጅሙዑል ፈታዊ ',

  'ሸይኽ አልባኒ ፣ ሲልሲቱል ሁዳ ወኑር ፣ 165 ፣\n '
  'ኢብኑ ዑሰይሚን ፣ ሲልሲለቱ ሊቃዕ አልመፍቱህ ፣ 185 ፣\n'
  'ኢብኑ ሶላህ ፣ ኪታብ ኡሉሙል ሀዲስ ',


  'ኢብኑ ኡሰይሚን ፣ ፈትዋ ኑሩን አለደርብ ፣ 114',


  'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 4',


  'ኢብኑ ባዝ ፣ ሸይኽ ፈውዛን ፣ \n'
  'ሸይኽ ሙቅቢልና ከሌሎች ኡለሞች የድምፅ ፈይል የተወሰደ',


  'ሸይኹል አልባኒ ፣ ሲልሲለቱል ሁዳ ወኑር / 371 ፣\n'
  'ሸይኽ ረቢዕ አልመድኸሊ ፣ ኪታብ ጀመዐቱን ዋሂዳ ላ ጀመዓት\n'
  'ኢብኑ ባዝ ፣ መጅሙኡል ፈታዊ ፣ 2/374,376 ፣ \n'
  'ኢብኑ ኡሰይሚን ፣ መጅሙኡል ፈታዊ፣ 16/39 ፣ \n'
  'የሳኡዲ የኢልምና የፈትዋ ቋሚ ኮሚቴ ፣ ፈትዋ ቁጥር 6364 ',


  'ኢብኑ ተይሚያ ፣ መጅሙኡል ፈታዊ ፣ 20/164 ፣\n'
  'ኢብኑ ኡሰይሚን ፣ ሸርሁ ነወዊይ ፣ 309 ፣ \n'
  'ሸርሁ አቂደቱል ዋሲጢያ ፣ 21 ፣ \n'
  'ኢብኑ ባዝ ፣ መጅሙኡል ፈታዊ ፣ \n'
  'ሸይኹል አልባኒ ፣ ሲልሲለቱ ኑሩን አለደርብ ',


  'ከሸይኽ ሷሊህ ቢን ፈውዛን አል ፈውዛን የድምፅ ፋይል የተወሰደ ፣\n'
  'እና ሌሎችም ብዙ ኡለሞች በዚህ ጉዳይ በመከልከል ፈትዋ ሰጥተውበታል።',


  'እነዚህና ሌሎችም የድምፅና የኪታብ ምንጮች የተገኘ',

  'ኢብኑ ኡሰይሚን ፣ ሊቃኡል ሸይርይ ፣ 1/46 ፣\n' 
  'መጅሙኡል ፈታዊ ፣ 18/112',


  'ኢብኑ ተይሚያ ፣ መጅሙኡል ፈታዊ ፣ 28/212 ፣\n '
  'ኢማሙ ሻጢቢይ ፣ ኪታቡል ኢዕቲሷም ፣ 1/202',


  'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 1/456,457 ፣\n'
  'ኢብኑ ኡሰይሚን ፣ ፈታዊ መናሩል ኢስላም ፣ 3/759 ፣ \n'
  'ሸርሁል ሙምቲዕ ፣ 2/197',

  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 28/436',


  'ሸይኽ ሙሀመድ ኢብኑ ኢብራሂም ፣ መጅሙዑል ፈታዊ ፣\n'
  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',

  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 7/333 ፣\n '
  'ኢብኑ ዑሰይሚን ፣ ኑሩን አለደርብ የሬድዬ የፈትዋ ፕሮግራም',


  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 19/314',


  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',

  'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',

  'ኢብኑ ተይሚያ ፣ መጅሙዑል ፈታዊ ፣ 3/427 ፣\n'
  'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 26/390 ፣\n'
  'ኢብኑ ኡሰይሚን ፣ ሊቃእ መፍቱህ ፣ 4/119\n ',


  'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 1/449 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ መጅሙኡል ፈታዊ ፣ 14/107',


'ኢማሙ ሻፊዕይ ፣ ኪታቡል መጅሙእ ፣ 3/177 ፣\n '
'ኢማሙ ነወዊይ ፣ ሸርሁል ሙስሊም ፣ 14/62 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ መጅሙኡል ፈታዊ ፣ 12/380',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ',



'ተፍሲሩል ቁርጡቢ ፣ 10/386 ፣ \n'
'ኢብኑል ጀውዚይ ፣ ኪታብ ዛዱል ሙየሰር ፣ 5/128 ፣\n '
'ኢብኑ ኡሰይሚን ፣ ፈትዋ ኑሩን አለደርብ ',


'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 15/238 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ ፈታዊል ኢስላሚያህ ፣ 4/431',



'ኢብኑ ባዝ ፣ ፈታዊል ኢስላሚያህ ፣ 4/442 ‏፣\n'
'ኢብኑ ኡሰይሚን ፣ ፈታዊል ኢስላሚያህ ፣ 4/441 ',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 7151',


'ኢብኑ ተይሚያ ፣ መጅሙዑል ፈታዊ ፣ 34/229 ፣\n' 
'ሸይኹል አልባኒ ፣ ተማሙል ሚንናህ ፣ 420 ፣ \n'
'ሸይኽ ሙሀመድ አማን አሽሸንቂጢይ ፣ አድወኡል በያን ፣ 5/525',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 17384 ፣\n'
'ኢብኑ ኡሰይሚን ፣ 16/321 ፣ \n'
'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 10/24',


'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 6/383',


'ኢማሙል ቁርጡቢይ ፣ ተፍሲሩል ቁርጡቢይ ፣ 7/194 ፣ \n'
'ኢብኑል ቀዩም ፣ ሀሺያህ ፣ 10/167 ፣ \n'
'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 8/121',


'የሳዑዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ ፈታዊ ኢስላሚያህ ፣ 1/20',


'ኢብኑ ተይሚያ ፣ ፊቅሁል ኡስራ ፣ 634 ፣ \n'
'ኢማሙ ነወዊይ ፣ አልመውሱዐቱል ፊቅህያ ፣ 30/82',


'ኢብኑል ቀዩም ፣ ዛዱል መዓድ ፣ 1/137 ፣ \n'
'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙዕ ፣ 4/337 ፣ \n'
'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 2/218 ፣',



'ኢብኑ ኡሰይሚን ፣ ፈታዊ ኑሩን አለደርብ ፣ 371',



'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 43/124',


'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 7 / 105 – 107 ‏፣ \n'
'ኢብኑ ዑሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 13 / 243 ‏',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 5/176',

'ኢብኑ ኡሰይሚን ፣ ፈታዊል ኢስላሚያህ ፣ 3 / 128',


'ብክር ኢብኑ አቡ ዝይድ ፡ ተስቢሁ ዱዐዕ ፡ 134 , 135 \n'
'ኢብኑ ባዝ ፣ ፈትዋ ኑሩን አለደርብ ፣ 610',

'ኢብኑ ዑሰይሚን ፣ ሊቃኡል ባቡል መፍቱህ ፣ 13 /20',


'ኢብኑ ዑሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 2 /939 - 944 ፣ \n'
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 8 / 331 ‏፣\n'
'ሸይኽ አልባኒ ፣ ፈትዋ ኢማራት ፣ 3 / 73 ፣\n'
'ሸይኽ ሷሉህ አል ፈውዛን ፣ ኪታብ ኢቲሀፉል ቃሪእ ፣ 2 /229 - 232 ‏፣\n' 
'ሸርሁ ኡሱሉ ሱና ፣ 53 - 54 ፣ \n'
'ሸይኽ ሙሀመድ ኢብራሂም አሉ ሸይኽ ፣ ኪታብ አልቀውሉል በሊግ ፣ 289 ፣ ',



'ኢብኑ ተይሚያ ፣ መጅሙዑል ፈታዊ ፣ 25/290 ፣ \n'
'ኢብኑል ቀዪም ፣ አልመናሩል ሙኒፍ ፣ ገፅ 96 ፣ \n'
'ኢብኑ ዑሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 20/440',


'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 5/176 ',


'ኢብኑ ኡሰይሚን ፣ ሸርሁል ሙምቲዕ ፣ 4/73 - 74 ፣ \n'
'ኢብኑ ተይሚያ ፣ ኪታቡል ኢኽቲያራት ፣ 64 ፣ \n'
'ኢማሙ ሲዩጢይ ፣ መውሱዓቱል ፊቅህያ ፣ 27/142–145 ፣\n' 
'ኢብኑ ቁዳማ ፣ ኪታቡል ሙግኒ ፣ 1/457 ፣ ኢማሙ ነወውይ ፣ ኪታቡል መጅሙዕ ፣ 4/31',


'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 15/416',



'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 16/128 ፣\n'
'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 4/40 ',


'የሳዑዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 24/40',



];


List<String> questions2 = [

  'መውሊድ_ሀራም መሆኑን እያወቁ የሚከበርበት ቦታ መገኘት እንዴት ይታያል?',

  'የመውሊድን ስጋ መብላት ይቻላልን?',

  'ተስቢህ በእጅ እንጂ በሙስበሀ ወይም በሌላ ነገር እንደማይቻልና ቢድዓ እንደሆነ '
'አቃለሁ ግን በእጄ ስቆጥር ብዙ ጊዜ የቆጠርኩት ተስቢህ ብዛቱ ስለሚያምታታኝ '
'እሳሳታለሁ ስለዚህ ልክ እንደ ሰዓት መቁጠሪያ አይነት የተዘጋጀውን '
'ተስቢህ_መቁጠሪያ ማሽን ወይም አፕሊኬሽን ብጠቀም እንዴት ይታያል?',


'በዘመናችን የምናያቸው ኢስላማዊ ነሽዳዎች ይፈቀዳሉን? እነዚህን ማዳመጡስ?',


'ለሞተ ሰው ቁርኣን መቅራት እንዴት ይታያል፣ አጅሩስ ይደርሰዋልን?',


'ኮከብና_ጨረቃ ብዙ ጊዜ የኢስላም ምልክት ይደረጋሉ፣ በየ መስጂዶቹም' 
'ሚናራ ላይ እንደ ምልክት ያገለግላሉ፣ ከኢስላም ጋር ያላቸው ግኑኝነት ምንድን ነው?',


'በየ ጁሙዓው በማህበራዊ ገፆችና በተለያዩ አጋጣሚዎች ሰዎች ሲገናኙ ጁሙዓ_ሙባረክ መባባላቸውና '
'እንደዚህ አይነት መልእክት መላላካቸው እንዴት ይታያል?',


'ብዙ ሰዎች ሜሴጅ ላይም ይሁን ማህበራዊ ሚዲያዎች ላይ ለሰላምታ '
'aww ወይም as_wr_wb እና ለሶለዋት ደግሞ ሶ_ዐ_ወ ብለው ይፅፋሉ እንዴት ይታያል?',


'አንዳንዶች ጀለብያ ግዴታ ነው ፣ ሱሪ ሀራም ነው ከካፊሮች ጋር መመሳሰል ነው ይላሉ ፣ እንዴት ይታያል?',


'ዱአ በሚደረግበት ሰአት እጃችንን ፊትለፊት ሳይሆን በተቃራኒው '
'ገልብጠን ነው ማድረግ ያለብን ሲባል ሰምቸ ነበር ይሄ ነገር እንደት ነው?',


'ጫት መቃም ብዙ ጊዜ ሀራም ነው ይባላል ፣ አንዳንዶች ደግሞ የሚፈቀድ ነው ይላሉ እና የተሻለው የትኛው ነው?',


' ብዞ ሰዎች በጀምዕያ ጉዳይ ሲጣሉ ይታያል፣ አንዳንዶች ቢድዓ ናት ይላሉ እና ማህበራትን '
'መመስረት እንዴት ይታያል ፣ ጀምዕያ የሚባልስ ቡድን አለን?',



'በአሁኑ ሰአት እኔ ሰለፍይ ነኝ የሚሉ በዝተዋልና ይሄ እንዴት ነው ፣ ሙስሊም ከሚለው ስያሜ ውጭ ይቻላልንዴ?',



'ተቃውሞ ሰልፍ በኢስላም እንዴት ነው ይፈቀዳልን?',


'ስለ ኡኽዋነል ሙስሊሚን ከሱና ውስጥ ናቸው ወይስ ውጭ የሚለውን ኡለሞች የሰጡትን የመጨረሻ ፈትዋ ቢብራራልን?',


'ቀለበት በኢስላም እንዴት ነው ኒካህ ሲደረግ ቀለበት ማድረግ ሱና ነው? '  
'በየትኛው እጅ ነው ሚደረገው ለወንድና ለሴት ልዩነት አለው?',


'ከሰለፎች መንገድ ውጭ (ሙብተዲዕ) በሆና ሰው እውቀት መማር እንዴት ይታያል?',


'ፎቶ መነሳትና ማንሳት በሸሪዓችን እንዴት ይታያል?',


'ልብወለድ መፅሀፍ ማንበብ በሸሪዓችን እንዴት ይታያል ፣ መፃፍስ?',


'ደም መለገስ በኢስላም እንዴት ይታያል?',


'ቁርዐን አንብበው ከጨረሱ ቡሀላ ሰደቀላሁ_አዚም ማለት ይቻላል?',


'ለመኪና ፣ ለሂወት እና ለንብረት ኢንሹራንስ መግባትና መስማማት በኢስላም እንዴት ይታያል?',


'በአካባቢያችን እንደሚታየው ሟች በሞተ በ7ተኛው እና በ4ተኛው ቀን ፣ በአራት ወሩ ፣ '
'እና በየአመቱ የሚወጣው ሲደቃ በሸሪዐችን እንዴት ይታያል?',


'ለተሀጁድ ሶላት አብዛኛው መሥጊድ አዛን ይደረጋል አንዳንድ መስጊድ አይደረግም ለምንድን ነው የትኛውሥ የተሻለ ነው?',


'ፉጨት (ማፏጨት) በሸሪዓችን ይቻላልን?',



 'አንዳንድ መስጂዶች ሱብሂ ሁሌ ቁኑት (ከሁለተኛው ሩኩእ በኃላ ዱዓ) ያደርጋሉ ፣ '
'እና ይህ እንዴት ነው⁉️ አንዳንዶች አይቻልም ይላሉ ቢብራራልን?',


'ሱሪን ከቁርጭምጭሚት በታች ማስረዘም ሀራም ነው ወይስ የሚጠላ?',


'ሙስሊም ሆኖ ቢድዐ ሚስራ ሰው ከሶስት ቀን በላይ ባኮርፈው እንዴት ይታያል?',


'ብዙ ጊዜ ሰዎች እቃም ይሁን የሆነ ነገር ሲጠፋቸው ለማስታወስና ትዝ እንዲላቸው ብለው ' 
'\"አሏሁመ_ሶሌ_አላ_ሙሀመድ" ይላሉ ለዚህም ደግሞ ሀዲስ አለ ይላሉ ይህ እንዴት ነው?',


'ኳስ ጨዋታ በTv መከታተል  እንደ ሸርዓ እንዴት ይታያል?',


'ሎተሪ መቁረጥና እጣው ከደረሰውም ገንዘቡን መውሰድ በሸሪዓችን እንዴት ይታያል?',


'የተለያዩ ሸቀጦችን በኮንትሮባንድ ከተለያዩ ሀገራትና ከተለያዩ ክልሎች ያለ '
'መንግስቱ ፈቃድ ማስገባት እና ኬላ ላይ ለሚጠብቁ ተቆጣጣሪዎች እንዲያሳልፉን ብር መስጠት እንዴት ይታያል?',


'ራስን በራስ ማርካት (ሴጋ) የሚበላው ነገር እንዴት ይታያል በሸሪዓችን?',


'ብዙ መስጂዶች ላይ ኢማሙ ኹጥባ እያደረገ እያለ ዱአ ሲያደርግ '
'ታዳሚው እየጮኸ አሚን ይላሉ ይህ እንዴት ይታያል ፣ ቢድዓስ ይሆናልን?',


'ሲያዛጋንና ስናፋሽግ ምንድን ነው ማለት ያለብን ፣ አንዳንድ ሰዎች አኡዙቢላህ ይላሉ ፣ ይህ እንዴት ነው?',


'አንዳንድ ሰዎች ከምግብ በፊት እጅን መታጠብ የካፊር_ሱና ነው ይላሉ ይህ እንዴት ነው?',


'ብዙ ሰዎች ቀብር ላይ አበባ ያስቀምጣሉ ፣ ቀብሩንም ውሀ ያጠጡታል ፣ ይህ እንዴት ይታያል?',


'ሙስሊም ሆኖ የሀላል ሚስቱን በኮንዶም መገናኘት ይችለልን?',


'በሸሪዓችን ቢጫ ልብስ መልበስ እንዴት ይታያል? ሌላስ የሚከለከል የልብስ ከለር አይነት አለንዴ?',


' በእኛ አካባቢ የታመሙ ሰዎች ላይ ሩቃ የሚቀሩ አሉ ፣ እና የሚቀሩት በጀመዓ ነው ፣ '
'እንዲሁም ሴትም ብትሆን በመካከል መጋረጃ ሳይኖር እንዲሁ እየተያዩ ነው የሚቀሩት ፣ ይህ እንዴት ይታያል?',



'ቁርእንንም ሆነ ሀዲስን ብዙ ቤቶች ላይ ለቤት ማስጌጫነት '
'በመጠቀም ያንጠለጥላሉ ፣ ይሰቅላሉ ፣ ይህ እንዴት ይታያል?',


'ከሶላት በኃላ ተስቢህ ሲደረግ በቀኝ እጅ ነው ወይስ በሁለቱም እጆች ይቻላል?',


' የተጋቡበትን ቀን ለማስታወስ በየአመቱ ያችን ቀን እንደ በአል በማክበር ሳይሆን ስጦታ '
'በመሰጣጣት ቢያስታውሱት ችግር አለውን?',


'ለመተጫጨት ተብሎ መልካቸውን ቀድሞ ለመተያየት ሲባል በአካል መገናኘት ካልቻሉ '
'በፌስቡክም ሆነ በዋትሳብ ፎቷቸውን ቢላላኩ እንዴት ይታያል?',


'University ላይ እሁድና ሀሙስ የደአዋ ፕሮግራም ነበረን እና የተወሰነ ደአዋ '
'ከተደረግ በሗላ በዱአ ብዙውን ጊዜ ይጠቀማሉ ዱአውም አደራርጉ በጣም በመጮህና '
'በጀመአ ነው የሚደረገው እና ይቻላል አይቻልም በሚል ፊርቃ ስላመጣብን ይሄ ነገር '
'ከሸሪአ አንፃር እንዴት ይታያል ከቁርአንና ከሀዲስ ማብራሪያ ቢሰጠን?',



' ኣንድ ሰው ከሞተ በሁላ ኣንድ ቀን ወይም ሁለት ቀን ያቆዩታል ፣ ዘመድ ምናምን '
'አስኪመጣ እያሉ እና ኣንድ ሰው ከሞተ በኋላ  ምን ያህለ ጊዜ ነው መቆየት ያለብት ሃዲስም ካለ በደንብ ቢብራራልን?',


'ተብሊጎች ኹሩጅ(ዳዕዋ) እያሉ የሚወጡት ተግባር  በእስልምና የተፈቀደ ነው ወይስ የተከለከለ? '
 'በጥቅሉ ስላለባቸው ችግሮች በደንብ ቢብራራልን?',


 'የረጀብ ወርን በዒባዳ መለየት በሸሪአ እንዴት ይታያል ፣ በተለይ ሰሞኑን በዚህ ወር የሚፆሙ ስላሉ ነው ይህ እንዴት ይታያል?',


 'ብዙ ወጣቶች ፀጉራቸውን ባላቶሊ (ከፊሉን ትቶ ከፊሉን መቆረጥ) ይቆረጣሉ ፣ እና ይህ በሸሪዓችን እንዴት ይታያል',


'የሶላተ ተራዊህ ረከአ ብዛቱ ስንት ነው ፣ ከአስራ_አንድ በላይ መጨመር ቢድአ ነውን ፣ እስከማስረጃው ቢብራራልን?',


'የሸዕባንን ወር ሙሉውን መፆም ይቻላልን?',


'በእኛ አካባቢ ዘወትር ጁሙአ ጁሙአ አብዛህኛው መስጂድ ውስጥ በማይክራፎን '
'ቁርአን ይከፈታል ፣ ይህን የሚያደርጉት ሰውን ወደ መስጂድ ለመጥራት '
'ወይም ጁሙአ ቀን ስለሆነ ብለው ነው። ይህ በሸሪዓችን እንዴት ይታያል?',


'ለምርቃንም ይሁን ለሰርግም ይሁን ለሌላ ነገር ከረባት መልበስ እንዴት ይታያል ከካፈሮች ጋር መመሳሰል አይሆንምን?',

];