

List<String> texts4 = [


  'የኢስላማዊው አስተራረድ መስፈርቶች የሚከተሉት ናቸው:—\n\n'

'1: የሚያርደው ግለሰብ ለማረድ ብቃት ያለው መሆን አለበት፡፡ እሱም '
   'ሙስሊም ወይም የመጽሐፍት ባለቤቶችን፣ ክርስቲያንና አይሁዳውያንን የሚያካትት '
   'ሲሆን እርዱን መምረጥ የሚችልና ስለ እርድ የሚያውቅ መሆን አለበት፡፡\n\n'

'2: የሚያርድበት መሳሪያ እንደ ቢላዋ ያለ የሚቆርጥ፣ ደም የሚያፈስና ለማረድ ብቃት '
   'ያለው መሆን አለበት፡፡ እንሰሳቱን በክብደቱ በሚጫን መሳሪያ፣ ወይም '
  'የእንሰሳቱን ጭንቅላት በመግጨት ወይም በኤሌክትሪክ ንዝረት በማቃጠል መግደል የተከለከለ ነው፤ አይፈቀድም፡፡\n\n'

'3: ለማረድ በሚያንቀሳቅ ጊዜ ‹‹ቢስሚላህ›› በማለት የአላህን ስም ማውሳት፡፡\n\n'

'4: በእርድ ላይ መቆረጥ ያለባቸውን ክፍሎች መቁረጥ፡፡ እነርሱም የአየር ቧንቧ፣ '
   'ጉሮሮና ሁለቱ የደም ጋኖች ናቸው፡፡ እነኚህ፣ በአንገት ግራና ቀኝ '
   'ያሉ የደም ስሮች ናቸው፡፡ ከነኚህ አራት አካላት መካከል ሦስቱን ቢቆርጥ በቂ ነው፡፡\n\n'

'እነኚህ ጉዳዮች ከተሟሉ እርዱን መብላት ይበቃል፡፡ ነገር ግን ከእነኚህ መስፈርቶች መካከል አንዱ ከተጓደለ እርሱን መብላት አይፈቀድም፡፡',



'የዒድ ሌሊት ከገባ ጀምሮ(ማለትም ከመግሪብ ወቅት አንስቶ) ሶላቱ ተሰግዶ እስኪያልቅ ድረስ ተክቢራ ማድረግ። '
'የዒደልአድሃ ጊዜ ከሆነ ደግሞ በተገደበ መልኩ ከዙልሒጃ 9 ሱብሒ ሶላት '
'ጀምሮ እስከ ሶስቱ አያመተሽሪቅ ቀናቶች ድረስ ከእያንዳንዱ ሶላት በኋላ ተክቢራ ማድረግ። '
'በልቁ ደግሞ ከዙልሒጃ 1 ጀምሮ እስከ 3ቱ የተሽሪቅ ቀናቶች ድረስ ተክቢራ ማድረግ።\n\n'

'አሏሁ - ተዓላ - እንዲህ ይላል ፦\n\n'
'{... ﻭَﻟِﺘُﻜْﻤِﻠُﻮﺍ ﺍﻟْﻌِﺪَّﺓَ ﻭَﻟِﺘُﻜَﺒِّﺮُﻭﺍ ﺍﻟﻠَّﻪَ ﻋَﻠَﻰٰ ﻣَﺎ ﻫَﺪَﺍﻛُﻢْ ﻭَﻟَﻌَﻠَّﻜُﻢْ ﺗَﺸْﻜُﺮُﻭﻥَ }\n'
'[ ቁጥሮችንም ልትሞሉ አላህንም ቅኑን መንገድ ስለመራችሁ ታከብሩትና ታመሰግኑት ዘንድ (ይህን ደነገግንላችሁ)፡፡ ] (በቀራ ፥ 185)\n\n'

'ከሶሓቦቹ የተገኘው የተክቢራ አይነት:\n\n'

'አሏሁ አክበር አሏሁ አክበር አሏሁ አክበር ከቢራ\n'
'አሏሁ አክበር አሏሁ አክበር ላኢላሃኢለሏህ አሏሁ አክበር ወሊላሂልሐምድ\n'
'አሏሁ አክበር ከቢራ አሏሁ አክበር ከቢራ አሏሁ አክበር ወአጀል አሏሁ አክበር ወሊላሂልሐምድ\n'
'አሏሁ አክበር ከቢራ ወልሐምዱሊላሂ ከሲራ ወሱብሓነሏሂ ቡክረተን ወአሲላ ናቸው።\n'
'ከዚህ ውጭ በተለያዩ መስጂዶች ላይ ሲባሉ የምንሰማቸው ተክቢራዎች ትክክል አይደሉም።\n\n'

'✅ ለሶላተል ዒድ ሰውነትን መታጠብ ፣ ጥሩ ልብስ መልበስ እና ሽቶን መቀባት(ለወንዶች ብቻ)\n'
'✅ ለዒደልፊጥር ሶላት ወደመስገጃ ስፍራ ከመሄድ በፊት ዊትር የሆኑ ቴምሮችን መብላት ወይም ሌላ' 
   'ነገሮችን ቀምሶ መውጣት። ለዒደልአድሃ ከሆነ ግን ሳይበሉ በመውጣት ከተመለሱ በኋላ ከኡድሂያው መብላት።\n'
'✅ ወደ መስገጃ ስፍራ በአንድ መንገድ ሂዶ በሌላ ቦታ መመለስ። ከቻሉ በእግር መሄድ።\n'
'✅ በምንሄድ ሰአት ተክቢራን በከፍታ ድምፅ ማሰማት።\n'

'✅ ሜዳማ ስፍራ ላይ መስገድ። በችግር ምክንያት ካልተቻለና መስጂድ ላይ ከተሰገደ ችግር የለውም።\n'
'✅ በሶሒህ ቡኻሪ እና ሙስሊም ላይ እንደመጣው ሴቶችን እና ህፃናት ልጆችን እንደዚሁም ሀይድ እና\n'
   'በጫጉላ ላይ ሴቶችን እንኳን ሳይቀር ወደመስገጃ ስፍራ እንዲመጡ መገፋፋት።'
'✅ የዒድን ሶላት መስገድ\n'
'✅ ከሶላት በኋላ ያለውን የዒድኹጥባ ማዳመጥ\n'

'✅ በዒድ ቀን የደስታ መግለጫ መለዋወጥ። ጁበይር ኢብኑ ኑፈይር የረሱል - ﷺ -'
   'ሶሓባዎች ከፊሉ ከለፊላቸው ተቀበለ-ሏሁ ሚና ወሚንኩም ይባባሉ እንደነበር ተናግሯል። '
   'ኢብኑሐጀር ሰነዱ ሶሒህ ነው ብለዋል። አልባኒም ሶሒህ መሆኑን ተናግረዋል።\n'
'✅ በዒድ ቀን ሸሪዓው በሚፈቅደው መልኩ መደሰት መዝናናት እንዲሁም ደስታን በይፋ መግለፅ።\n'
'✅ ዘመዶችን ፣ ጓደኛዎችን ፣ ድሆችን ፣ የቲሞችን መጠየቅ እና መዘየር።\n\n'

'በዒድ_ቀን_ላይ_የሚስተዋሉ_ቢድዓዎች:\n\n'

'❌ ከላይ ከተጠቀሰው የተክቢራ አባባል ውጭ ተጨማሪ ነገር ማለት።\n'
'❌ አንዱ እያስባለ ሌሎቹ ተክተለው በጀመዓ በአንድ ድምፅ ተክቢራ ማለት። ተገቢው ሁሉም ሰው ለየራሱ ተክቢራ ማድረግ ነው ያለበት።\n'
'❌ የዒድ ቀንን ነጥሎ ቀብርን መዘየር።\n\n'

'በዒድ_ቀን_ከሚስተዋሉ_ወንጀሎች\n\n'
'❌ወንዶች ለውበት በሚል ፂማቸውን መላጨት\n'
'❌ሴት እና ወንድ እርስበእርስ መቀላቀል(ኢኽቲላጥ)\n'
'❌ሴቶች የሰውነታቸውን ክፍል የሚያሳይ (ለብሶ ራቁት) አይነትን ልብስን በጥቅሉ ሸሪዓዊ መስፈርቶችን ያላሟላ ልብስን መልበስ።\n'
'❌ገንዘብን በጣም ውድ ውድ ለሆኑ እና ምንም ለማይጠቅሙ ጨዋታዎች እና ዛዛታዎች ላይ በማዋል ማባከን።\n'
'❌ቁማር እና መሰል ሀራም ነገሮችን መፈፀም።\n',



'ሶሀቦች እርስበራሳቸው ሲገናኙ ከፊሉ ለከፊሉ ተቀበለሏሁ_ሚና_ወሚንኩም ይባባሉ እንደነበር ተዘግቧል። '
'ከዚህም በተጨማሪ በውስጣቸው መጥፎ ትርጓሜ እስከሌላቸው ድረስ ሰዎች ዘንድ የተለመዱ አባባሎችም የማይከከሉ ናቸው።'

'ሸይኹል ኢስላም ኢብኑ_ተይሚያ በአንድ ወቅት በዚህ ዙሪያ ተጠይቀው እንዲህ ብለዋል:\n'
'\"ሰዎች ከፊል ከፊሉን ተቀበለሏሁ አለይኩም ፣ አሏህ ይመላልስልህ እና የመሳሰሉትን የዒድ '
'የደስታ መግለጫዎችን ቢለዋወጥ ይህ ከሶሀቦችም ተገኝቷል ፣ ከታላላቅ ዑለሞችም የተግራራ ነገር ነው። '
'ከዚህ በመነሳት ኢማሙ አህመድ መጀመሪያ መጀመርን ቢጠሉም መጀመሪያም መጀመርም ሆነ ሲባሉ መመለስ ችግር የለውም።'
'[ፈታዊል ኩብራ (2/228)]\n\n'

'የዒድ የደስታ መግለጫዎች ልዩ የሆነ አባባል ይኖረው እንደሆነ የተጠየቁት ሸይኽ ኢብኑ '
'ዑሰይሚንም እንዲህ ብለዋል: \"በዒድ የደስታ መግለጫዎችን መለዋወጥ ይበቃል ፣ '
'ለዚህም ልዩ የሆነ አባባል የለውም ፣ በውስጡ ወንጀል አስከሌለው ድረስ ሰዎች ዘንድ የተለመደ ነገር ይበቃል።\"'
'[መጅሙዑል ፈታዊ (16/208–210)]',



'በሀዲስ እንደመጣው ለሸሪዓዊ ምክንያት ካልሆነ በስተቀር የዒድ ሶላትን ሜዳ ላይ እንጅ '
'መስጂድ ውሰጥ መስገድ ይጠላል። ነብዩ ሶለሏሁ አለይሂ ወሰለምም በሳቸው መስጂድ '
'መስገድ ከአንድ ሺ ሶላት በላይ ብልጫ እንዳለው ከመናገራቸው ጋረወ የዒድን ሶላት '
'ለመሰገድ ግን ወደ ሜዳ ይሄዱ ነበር። ይህ የሞያመለክተው በሜዳ ላይ ሊሰገድ '
'እንደሚገባውና ይህን ሱና መሆኑን ነው። ሆኖም የአካባቢው ሁኔታ አስቸገሪ መሆን ፣ '
'ቦታ አለማግኘት እና የመሳሰሉት ምክንያቶች ካሉ ግን በመስጀድ መስገድ አይከለከልም።',



'በመሰረቱ በዒድ ወቅት ተክቢራ ማድረግ በጥቅስ በመጣው ላይ #ብቻ ልንገደብበት ከሚገባቸው '
'በሸሪዓችን ከመጡ ዒባዳዎች መካከል ነው። ከሰለፎች የተገኘው የተክበራ አባባል በተመለከተ የሚከለው ነው:—\n\n'

'\"ﺍﻟﻠﻪ ﺃﻛﺒﺮ ، ﺍﻟﻠﻪ ﺃﻛﺒﺮ ﺍﻟﻠﻪ ﺃﻛﺒﺮ ﻻ ﺇﻟﻪ ﺇﻻ ﺍﻟﻠﻪ ، ﻭﺍﻟﻠﻪ ﺃﻛﺒﺮ ﺍﻟﻠﻪ ﺃﻛﺒﺮ ﻭﻟﻠﻪ ﺍﻟﺤﻤﺪ\"\n\n'

'\"አሏሁ አክበር አሏሁ አክበር ፣ ላኢላሀኢለልሏህ ፣ አሏሁ አክበር አሏሁ አክበር ፣ ወሊላሂል ሀምድ"\n\n'

'ከዚህም በተጨማሪ "አሏ  አክበር ከቢራ ወልሀምዱ ሊላሂ ከሲራ '
'ወሱብሀነሏሂ ቡክረተን ወአሲላ" የሚለውንም በርካታ የቀደምት '
'ኡለሞች ዘንድ የታወቀና የሚፈቀድ መሆኑን ገልፀዋል።\n\n'

'ሌላው ይህን ተክቢራ በአንድ ድምፅ ማለት ፣ አንድ የሚያስብል ሰው ተመድቦ '
'ሌላው ህዝብ እሱን እየተጠባበቁ ተቀባይ መሆን ይህ በሸሪዓችን መሰረት የሌለው ቢድዓ ነው። '
'ስለዚህ መደረግ ያለበት ሁሉም ሰው የየራሱን ተክቢራ ማንም ማንንም ሳይጠባበቅና አንድ '
'ድምፅ ለለመሆም ብሎ አውቆ ሳይቃረን በጥቅሉ ሰዎች ልክ ሁሉም ድምፁን ከፍ አድርገው '
'መስጂድ ውስጥ በየግሉ ልክ እንደሚቀሩት ተክቢራውንም በየግል እየጮሁ መቅራት ነው። ከዚህም '
'በተጨማሪ ካለይ ከተጠቀሱት የተክቢራ አባባል አይነቶች ውጭ ሌሎች በርካታ ቃላትን '
'ብዙ ሰዎች ይጨምራሉ ይህም መሰረት የሌለው ቢድዓ በሆናቸው መጠንቀቅና ማስጠንቀቅ ያስፈልጋል።',


'ይህ \"ጁሙዓ_ሙባረክ\" የሚለው ቃል በሸሪዓችን መሰረት የሌለው ቢድዓ ነው። '
'ይህንን ማለትም ሆነ ማሰራጨት የተከለከለ ነው። ምክንያቱም ነብዩ(ሶለሏሁ ዓለይሂ ወሰለም) በሀዲሳቸው እንዲህ ብለዋልና:—'

'\"ያለ እኛ ትእዛዝ አንዲትንም ስራ የሰራ ስራው ተመላሽ ነው\" '
'[ቡኻለሪና ሙስሊም ዘግበውታል]\n\n '

'ይህ ተግባር ተቀባይነት የሌለው መሆኑ ብቻ ሳይሆን ሁሊም ቢድዓ በሸሪዓችን '
'ጥመት መሆኑም ጭምር ወንጀለኛ ያረገዋል። ለዚህም ረሱላችን በሀዲሳቸው ይህን ብለዋል:—\n\n'

'\"አደራችሁን አዳዲስ መጤ ነገራቶችን ተጠንቀቁ ፣ ምክንያቱም ሁሉም (ዲን ላይ) '
'መጤ ነገር ቢድዓ ነው፣ ሁሉም ቢድዓ ደግሞ ጥመት ነው።\"'
'[አቡ ዳውድ ፣ 4067]',



'ተሂየተል መስጂድ (መስጂድ እንደገቡ የሚሰገድ ሱና ሶላት) እንጂ '
'እንደሌላው ዝሁር ሶላት ከጁሙዓ ሶላት በፊት የሚሰገድ ቀብልያ ሱና ሶላት የለም '
'እንደውም አንዳንድ ኡለሞች ይህ ቢድዓ ነው ይላሉ። ምክንያቱም ይህ በሸሪዓችን አልመጣም። '
'ሰውዬው ኢማሙ ሚንበር ላይ ከመውጣቱ በፊት የፈለገውን ሱና ሶላት መስገድ ይችላል። '
'ከዛ ውጭ ከጁሙዓ ሶላት ጋር የተቆራኘ ቁጭ ብሎ የነበረ ሰው ተነስቶ የሚሰግደው ሶላት የለም።',


'በመሰረቱ በዱዓ ወቅት እጅን በደረት ትክክል ወደ ላይ ከፍ ማድረግ የተደነገገና ዱዓውም '
'ተቀባይነት ይኖረው ዘንዳ ሰበብ ከሆኑ ነገራቶች መካከል አንዱ ነው። ለዚህም ነብዪ - ﷺ - እንዲህ ብለዋል ፣ '
'\"አሏህ የሚያፍርና ቸር ነው ፣ ባሪያው እጁን ወደ እርሱ ከፍ ሲያደርግ ባዷቸውን እንዳይመልስበት ያፍራል።\" [አቡ ዳውድ (3556)]\n\n'

'ሆኖም እጅን ማንሳት በቀጥታም ይሁን በተዘዋዋሪ ያልተደነገገበት ሁኔታ ላይ እጅን '
'ማንሳት የተከለከለና ቢድዓ ይሆናል። ከነዚህ ከተከለከሉ ሁኔታዎች መካከል በሶላት '
'መጀመሪያ ላይ የሚገኘው የመክፈቻ ዱዓ ላይ ፣ በሁለት ሱጁዶች መካከል ፣ '
'በተሸሁድ ዱዓ ላይ እና በጁሙዓ ኹጥባ ላይ (ለኢማሙም ለመእሙሙም) ናቸው።'

'በተለይ የጁሙዓ ኹጥባውን በተመለከተ ነብዩ - ﷺ - በኹጥባቸው ላይ በጠቋሚ '
'ጣታቸው ከመጠቆም ውጭ እጃቸውን አንስተዋልም ሆነ አዳማጩም እጁን እንዲያነሳ አዘዋል የሚል የለም። '
'ሶሀቦችም ይህን በሚያደርጉ አካላት ላይ አውግዘዋል።',



'ለጁሙዓ ሶላት አዛን ከተባለ በኃላ የጁሙዓ ሶላት ግዴታ የሚሆንበት '
'ሰው ጉዞ መውጣት ይከለከላል። ምክንያቱም አሏህ እንዲህ ይላልና:— \n\n'
'\"እናንተ ያመናችሁ ሆይ! በጁሙዓ ቀን ለስግደት ጥሪ በተደረገ ጊዜ ወደ አሏህ ማውሳት ሂዱ ፣ '
'መሸጥንም ተዉ ፣ ይሃችሁየምታውቁ ብትሆኑ ለእናንተ የተሻለ ነው።\" '
'[ሱረቱል ጁሙዓህ ፣ 9] '

'ከዚህ አንቀፅ እንደምንገነዘበው አሏህ ለጁመዓ ሶላት እንድንሄድና መሸጥንም እንድንተው አዟል። '
'ልክ እንዲሁ ጉዞም ይከለከላል ምክንያቱም ግብይት ሶላት ለመሳተፍ እንደሚከለክለው ሁሉ ጉዞም ይከለክላልና ነው። \n\n'
'ከአዛን በፊት ግን አንዳንድ ኡለሞች የጀሙዓው አጅር እንዳያለምጠው '
'በሚል ይጠላል ቢሉም ለዚህም ግልፅ የሆነ ቁርአናዊም ይሁን ሀዲሳዊ ስለሌለ የተፈቀደ ነው። '
'ነገር ግን የአውሮፕላን ትኬት ቆርጦ ከነበረና ፕሌኑም የሚበረው አዛን ካለ በኃላ ከሆነ እንደየጉዳዩ '
'አንገብጋቢነት ይታያል። ማለትም መሄዱን ትቶ ጁሙዓን ቢሰግድ የሚያልፈው ነገር ከሌለና '
'አስገዳጅ ነገር ካላጋጠመው እንዲሁም ከሶላቱ በኃላ ወደሚፈልገው አካባቢ የሚበር ፕሌን '
'የሚያገኝ ከሆነ መዘግየት አለበት። ነገር ግን አስገዳጅ ነገር ካጋጠመውና ሌላ ፕሌን ከሌለ የዚህን ጊዜ ምክንያታዊ ነውና መጓዝ ይችላል።',




'የጁሙዓን ሶላት ለማግኘት አንድ ረከዓ ማግኘት ግዴታ ነው። አንድ ረከዓ '
'የሚገኘው ደግሞ ኢማሙ ከሩኩዕ ቀጥ ከማለቱ በፊት ነው። ለዚህም ነብዩ ሶለሏሁ አለይሂ ወሰለም እንዲህ ብለዋል:—\n\n'

'\"ከሶላቱ ውስጥ (ቢያንስ) አንድ ረከዓ ያገኘ ሶላቱን አግኝቷል።\" '
'[ቡኻሪና ሙስሊም ዘግበውታል]'

'ስለዚህ ጁሙዓ ሶላት ላይ ኢማሙ ተሸሁድ ላይ እያለ ከደረሰ የጀሙዓ ሶላት አምልጦታልና '
'መስገድ ያለበት አራት ረከዓ ነው። ከአቅሙ በላይ በሆነ ችግር ከሆነ የዘገየው ጁሙዓ ስላለፈው ወንጀለኛ አይሆንም።',



'በመጀመሪያ ደረጃ ሸሪዓችን አሚን ማለትን ያልደነገገበት ሁኔታ ካልሆነ በስተቀር '
'በማንኛውም ዱአ ላይ አሚን ማለት የተደነገገ ነው። ከነዚህ ዱአዎች መካከል '
'የጁሙአ ኹጥባ ዱአ አንዱ ነው። በዚህ ወቅት ኸጢቡ ዱአ ሲያደርግ አሚን ማለት ይቻላል።'

'ምክንያቱም በዱአ ጉዜ አሚን በማለት ዙሪያ የመጡት ሀዲሶች ጥቅል መልእክት '
'ያላቸው ናቸውና። ነገር ግን እዚህ ዱአ ላይ ድምፅን ከፍ አድርጎ አሚን ማለትም '
'ሆነ በጀመዓ በአንድ ድምፅ አሚን ማለት እንዲሁም እጅን ከፍ ማድረግ አልተደነገገም። መሰረት የሌላቸው ተግባራት ናቸው።',



'በዚህ ዙሪያ ኡለሞች የአቋም ልዩነት ቢኖርም የተሻለውና በላጩ አቋም ግን '
'ኹጥባን በአረበኛ ማድረግ በላጭ ቢሆንም ኹጥባውን የሚያዳምጡት '
'ሰጋጆች የአፍ ቋንቋቸው ከአረበኛ ውጭ ከሆነና አረበኛም አብዛኛዎቹ መረዳት '
'የማይችሉ ከሆነ በራሳቸው ቋንቋ ተርጉሞ ኹጥባ ማድረግ ይቻላል። '
'ምክንያቱም ኹጥባ ዋናው አላማው መምከርና ማስተማር ስለሆነ ልክ '
'እንደማንኛውም ዳእዋ በማንኛውም ቋንቋ ንግግር አድርጎ አዳማጮቹ ከኹጥባው ተጠቃሚ መሆን ስላለባቸው ነው።',




'ቁርአን የወረደው ተገንዝበነውና  አስተንትነነው እንድንሰራበት እንጅ ልክ እንደ '
'አዛን ሰዎችን ወደ መስጂድ መጥሪያነት እንድንጠቀመው አይደለም። '
'ነብየም ሶለሏሁ አለይሂ ወሰለም ሱናቸውን አጥብቀን ይዘን እሳቸውን '
'ከመፃረርና በዲናቸው ላይ አዲስን ነገር ከመፍጠር እንድንቆጠብ አዘውናል።\n\n '

'በሀገራችን በበርካታ መስጂዶች እንደሚስተዋለው ጁሙአ ቀን በማይክራፎን ቁርአን '
'መክፈት በሸሪዓችን መሰረት የሌለውና ነብዩም ሶለሏሁ አለይሂ ወሰለም ያላዘዙት ፣ '
'ሰለፎችም የማያውቁት ቢድአ የሆነ ተግባር ነው። በዚህ መልኩ የጁሙአ ቀን ሁሉም '
'ሙስሊም በግሉ ቢቀራቸው የሚወደዱ የቁርአን ምእራፎችን እንጅ መስጂድ ላይ '
'ቁርአን መክፈት የተወደደ መሆኑን የሚያመለክት ሸሪዓዊ ማስረጃ የለም።\n\n'

'ሰዎችን ወደ መስጂድ ለመጥራት ታስቦበትም ከሆነ በጁሙአ አዛን '
'እንጅ በቁርአን መጥራት አልተደነገገም። የጁሙአ ቀን ስለሆነ ተብሎም ከሆነ '
'በዚህ መልኩ ጁሙአ ቀንን በሸሪዓችን ባልተደነገገው መልኩ መለየትም አይፈቀድም።',




'አንድ ሰው የጀናባም የጁሙዓንም ትጥበት ከተሰባሰበበት ለሁለቱም አንዴ ብቻ መታጠብ ይበቃዋል። '
'ባይሆን የጀናባንና የጁሙዓን ትጥበት እንደሚታጠብ ቀድሞ መነየት (ማሰብ) ይገባዋል። ለዚህም ነብዩ እንዲህ ብለዋል: \n'
'\"ስራዎች ሁሉ በኒያ (በማሰብ) ነው። ለእያንዳንዱ ግለሰብ የነየተው '
'(ያሰበው) አለው።\" ቡኻሪ (1) እና ሙስሊም (1907) ዘግበውታል።',



'በርግጥ ነብዩ - ﷺ - የጁሙዓ ቀን ሁለት ኹጥባዎችን እንደሚያደርጉና በመካከልም '
'ሚንበሩ ላይ ትንሽ አረፍ በማለት በሁለቱ ኹጥባዎች መካከል መለያ ያደርጉ እንደነበር '
'በሶሂህ ሀዲስ ተዘግቧል። ነገር ግን በዚች በኹጥባው መካከል ላይ ኹጥባ ለሚያደርገውም '
'ይሁን ለአዳማጩም የሚባል የሆነ ልዩ ዱዓ ወይም አዝካር አልተዘገበም። ባይሆን በርካታ '
'ኡለሞች እንደሚሉት በዚች ወቅት ላይ ሌሎችን እንዳይረብሹ ድምፅን ዝቅ አድርጎ ዱዓ ማድረግ የተወደደ ነው።',


'በርግጥም አጠቃላይ የሙስሊሞች ስምምነት እንደሚያመለክተው ከነብዩ ﷺ ጀምሮ በአቡበክርና '
'በዑመር የአስተዳደር ዘመን ለጁሙዓ ሶላት ሲደረግ የነበረው አዛን አንድ መሆኑን ነው። '
'ነገር ግን የዑስማን ዘመን በመጣ ጊዜ ሰዎች በተበራከቱና ቤቶችም ለጁሙዓ '
'ተሰባስበው ሲሰግዱበት ከነበረው ብቸኛው መስጂድ (መስጂደ ነበዊይ) በራቁ '
'ጊዜ ከያሉበት ቦታ በጊዜ ወደ መስጂድ ለመምጣት እንዲዘጋጁና የጁሙዓ ሶላትም '
'እየቀረበ መሆኑን ለማመከላከት ሲባል ወቅቱ ከመግባቱ በፊት አንድ አዛን '
'ቢጨመር የተሻለ ነው ብለው ዑስማን ረዲዬሏሁ በማመን በዚህ መልኩ እንዲደረግ አዘዙ።'
'ሆኖም ይህንን አዛን ከሶሀቦች መካከል ኡብኑ_ዑመርና ከአትባዑ ታቢዒን መካከል ደግሞ '
'ሱፍያኑ_ሰውሪ ሙሉ በሙሉ ይህን የዑስማን ጭማሪ አዛን አውግዘውታል። በአንፃሩ '
'አብዛህኛው ዑለሞች ደግሞ ቤቶችም ቢቀራረቡና ጁሙዓ መስገጃ ቦታዎች ቢበዙም'
'ዑስማን ረዲዬሏሁ አንሁ ሱናቸውን እንድንከተላቸው ከታዘዝናቸው 4 ኹለፋኡ_ራሺዲን '
'መካከል አንዱ ነውና ይቻላል ብለዋል።\n\n'


'ሌሎች ደግሞ መካከለኛ የሆነ አቋም ይዘዋል። እሱም ዑስማን ይህን አዛን የጨመረበትን '
'ምክንያት ከግምት በማስገባት እሱ የጨመረበት ምክንያት ከተገኘ ማለትም ቤቶች ጁሙዓ ተሰብስበው '
'ከሚሰገድበት ከመስጂድ የራቁና የበዙ  ከሆኑ ሁለት አዛን መጠቀም ይቻላል ካልሆነ ደግሞ አይቻልም ብለዋል። '
'የተሻለውና በላጩ አቋምም ይሄው ነው። ምክንያቱም በአሁኑ ሰዓት የአዛንን ድምፅ ከፍ '
'ማድረጊያ (ማይክራፎን) እና ሚናራ በመኖሩና ቤቶችም የፈለገ ቢበዙ ጁሙዓ የሚሰገድባቸው '
'መስጂዶች ግን በየአካባቢው በአቅራቢያ በብዛት ስለሚገኙ ዑስማን ይህን የተገበሩበት ሰበብ '
'በአሁኑ ወቅት የለም ማለት ይቻላልና። ከዛም በተጨማሪ ይህ አዛን ግዴታ ነው ያለ አንድም '
'አሊም ባለመኖሩና በጥርጣሬ ሀራም ላይ ከመውደቅም ሱናን መተው የተሻለ ስለሆነ መተው በላጭ ነው። \n\n'
'ሆኖም ይህን የዑስማን አዛን የሚቀበሉ ሰዎች ላይ በሙብተዲዕነት ማጥላላትና ከሱና '
'ማስወጣትና በዚህ ጉዳይ መጨቃጨቅ ከየትኛውም የሱና ሊቃውንት ያልተገኘ በመሆኑ አይፈቀድም።\n\n'
'ሆኖም ይህ አዛን የሚቀበሉ ሰዎችም ይህ አዛን የአንድ ሶሀቢይ ኢጅትሀድ እንደሆነ እንጂ ልክ ራሱን '
'የቻለ የሸሪዓ ድንጋጌ አድርጎ መቁጠር የለባቸውም። በተጨማሪም አላማውን እንዳይስት ዘንዳ የመጀመሪያውን '
'አዛን የዝሁር ወቅት ከመግባቱ በፊት ማድረግና በዚህና በሁለተኛው አዛን '
'መካከልም ሰፋ ያለ (ቢያንስ የ30 ደቂቃ ያክል) ክፍተት ማድረግ ይገባቸዋል።',


'ከዶዒፍ_ሀዲሶች_መካከል!\n\n'

 '1\n\n'

'إن الله لا ينظر إلى صف الأعوج.!\n'
'\"አላህ ወደ ጠማማ ሶፍ አይመለከትም\" \n\n'

'መሰረት የሌለው ሀዲስ ነው‼️',



'ከዶዒፍ_ሀዲሶች_መካከል! \n\n'

'2\n\n'

'\"ﻣﻦ ﻟﻢ ﻳﻬﺘﻢ ﺑﺄﻣﺮ ﺍﻟﻤﺴﻠﻤﻴﻦ ﻓﻠﻴﺲ ﻣﻨﻬﻢ.\" \n'
'\"በሙስሊሞች ጉዳይ የማይጨነቅ ከኛ አይደለም።\"\n\n'

'መሰረት የሌለው ሀዲስ ነው‼️',





'ይህ ሀዲስ መሰረት የሌለው የተቀጠፈ ሀዲስ ነው። በየትኛውም የሀዲስ ኪታብ ላይ '
'የሌለ በመሆኑ ይህን ሀዲስ መሰራጨትም ሆነ ማስተላለፍ አይቻልም‼️',



'በጁሙዓ ኹጥባ ላይ ኹጥባ አድራጊውም ይሁን አዳማጩ በዱዓው '
'ጊዜ እጃቸውን ከፍ ማድረግ አይቻልላቸውም። ለዚህም ነብዩ( ሶለሏሁ ዓለይሂ ወሰለም) '
'እጃቸውን በኹጥባ ሰዓት አለማንሳታቸውና እንዲነሳም አለማዘዛቸው ይህ የማይፈቀድ '
'መሆኑን ያመለክታል። ምክንያቱም ማንኛውም ዒባዳ ከማስረጃ ጋር አብሮ የተቆራኘ ነውና።'
'ከዱዓም በኃላ ፊትን_ማበስ እንዲሁ ከአዳዲስ ፈጠራዎች(ቢድዓዎች) መካለል ነው። '
'ምክንያቱም በቁርአንም ሶሂህ በሆነ ሀዲስም እጅን ፊት ላይ ወደ ማበስ የሚያመለክት '
'አንድም ጥቅስ የለመ። በዚህ ዙሪያ የመጡት ሀዲሶችም ዲዒፍ ናቸው። ሰለዚህ መደረግ '
'ያለበት ዱዓ አድርጎ እጅን ቀጥታ ወደ ታች ማውረድ ነው።',



'ጥያቄው ላይ የተጠቀሰው በሸረሪቷ ዙሪያ የመጣው ሀዲስ_ዶዒፍ ነው። በዚህ ሀዲስ ማስረጃ ማድረግ አይቻልም! '
'ነገር ግን ሸረሪትም ብቻ ሳይሆን ማንኛውም እንስሳ ካስቸገረ ማስወገድ ይቻላል። '
'ባይሆን ሳይገድሉ በሌላ መንገድ ጉዳቱን መከላከል የሚቻልበት መንገድ ካለ በላጩ አለመግደሉ ነው።',



'በዚህ ጉዳይ ላይ ዑለሞች መካከል ልዩነት ቢኖርም አመዛኙና_በላጩ ግን ሀይድም '
'ላይ ይሁን ኒፋሳ (የወሊድ ደም) ላይ ያለች ሴት እንደማንኛውም ሰው ቁርአን '
'መንካት ባይፈቀድላትም ቁርአን በቃሏ መቅራት ትችላለች። ቁርአን መቅራት '
'እንደሌለባት የሚያመለክተው ሀዲስ በጣም ዶዒፍ ነው። '
'የጀነበ ሰው በቃሉም ቢሆን መቅራት መከልከሉ የሚቆይበት ጊዜና ለመታጠብ '
'የሚቆየው ወቅት አጭር ስለሆነ ነው፣ ሀይድና ኒፋሳ ግን ብዙ ጊዜ ስለሚቆይ ያን '
'ሁሉ ጊዜ በቃል እንኳን ከቁርአን እንድትርቅ ማድረግ ይሆናልና በጀናባ ቂያስ አድርጎ ማመሳሰል አይቻልም።',



'ምንም ያክል በደል እንኳን ወንድ በሴት ላይ ይቅርና ለማንም የሚወገዝና ሸሪዓችንም '
'የሚከለክለው ተግባር ቢሆንም ይህ ንግግር ግን ከዐለይ በጭራሽ አልተገኘም። '
'ብዙ ጊዜ ይህ ሀዲስ ሲነገር የሚሰማው ከሺዓዎች በኩል ነው። እነሱ ደግሞ አልይ '
'ላይ ያልቀጠፋት ነገር የለም። ስለዚህ በሀዲስ ኪታቦች ምንም ያልተገኘ መሰረት '
'የሌለው ቅጥፈት ነውና ይህን ንግግር ማሰራጨትም ሆነ ማስተላለፍ አይፈቀድም።',



'መርሳት አላህ በቁርአኑ እንደጠቀሰው ከሸይጧን የሚመጣ ጉትጎታ ነውና አንድ ሰው '
'የሆነ ነገርን ለማስታወስ ሲቸገርና ሲረሳው ማድረግ ያለበት አላህን ማስታወስና '
'አላህ ትዝ እንዲያስብለው አላህን ዱዓ ማድረግ ነው።ለዚህም አላህ እንዲህ ይላል:—\n'
'\"በረሳህም ጊዜ ጌታህን አውሳ\" '
'[ሱረቱል ከህፍ ፣ 24]\n\n'

'ነገር ግን በዚህ ፈንታ ሶላዋት [አሏሁመ_ሶሌ_አላ_ሙሀመዲን] ማለት በሸሪዓችን መሰረት '
'የሌለው ተግባር ነው። በዚህ ዙሪያ የመጣውም ሀዲስ በጣም ዶዒፍና ቅጥፈት ነው።',



'ይህ ሀዲስ በየትኛውን የሀዲስ ኪታብ ላይ በጭራሽ ሊገኝ ይቅርና በተቀጠፋ ሀዲሶች '
'መዝገብ ውስጥ እንኳን የማይገኝ በነብዩ ሶለሏሁ አለይሂ ወሰለም ላይ የተቀጠፈ ሀዲስ ነው። '
'ይህን ሀዲስ በየትኛውም መልኩ ማሰራጨትም ሆነ ማስተላለፍ የተከለከለ ነው።'



];



List<String> appTitless4 = [

  'የበግ አስተራረድ ሁኔታ',

  'የዒድ ቀን ሱናዎች እና ስርአቶች',

  'ዒድ ሙባረክ መባባል',

  'ዒድን መስጂድ ውስጥ መስገድ',

  'የዒድ ተክቢራን በጀመዓ ማለት',

  'ጁሙዓ ሙባረክ',


  'ከጁሙዓ ሶላት በፊት ሱና መስገድ',


  'የኹጥባ ዱዓ ላይ እጅን ማንሳት',



  'ጁሙዓ ቀን ጉዞ መውጣት',


  'ጁሙዓ ሶላት ተሸሁድ ላይ መድረስ',


  'ኹጥባ ላይ አሚን ማለት',


  'የጁሙዓን ኹጥባ በአማረኛ ማድረግ',



  'የጁሙዓ ቀን ቁርአን መክፈት',


  'የጁሙዓና የጀናባ ትጥበት',



  'በኹጥባ መካከል የሚባለው',

  'የጁሙዓ 1ኛው አዛን ቢድዓ',


  'ከዶዒፍ ሀዲሶች መካከል‼️',

  'ከዶዒፍ ሀዲሶች መካከል‼️',


  'ከዶዒፍ ሀዲሶች መካከል‼️',

  'ከዱዓ በኃላ ፊትን በእጅ ማበስ',


  'ለምን ሸረሪት መግደል አይቻልም',


  'ሀይድ ላይ ያለች ሴት ቁርአን መቅራቷ',


  'ከዶዒፍ ሀዲሶች መካከል‼️',


  'የሆነ ነገር ሲረሳ ለማስታወስ ተብሎ አሏሁመሶሌ\n            አላ ሙሀመድ ማለት',


  'ረመዷን መች ነው....'




];



List<String> sources4 = [

  'https://binbaz.org.sa/fatwas/......\n'
 'https://fatwa.islamweb.net/fatwa/.....',


'አቡልዓባስ አሕመድ ኢብን ያሕያ @ Ibn yahya Ahmed\n'
'ሰኔ 7 /2010 ላይ የተፃፈ',


'ፈታዊል ኩብራ (2/228) ፣\n' 
'መጅሙዑል ፈታዊ (16/208–210)',


'መጅሙዑል ፈታዊ ለኢብኑ ዑሰይሚን ፣ '
'16ኛው ሙጀለድ ፣ ኪታብ ሶላቱል ዒደይኒ',


'የሳዑዶ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 8/310 ፣\n '
'መጅሙዑል ፈታዊ ለኢብኑ ባዝ ፣ 20/13–23 ',


'ሸይኽ ኢብኑ ባዝ ፣ ሸይኽ ኢብኑ ዑሰይሚን ፣\n' 
'ሸይኽ ሷሊህ አል ፈውዛን— መጅሙዑል ፈታዊ',


'ኢብኑ ተይሚያ፣ ፈታዊል ኩብራ ፣ \n'
'ኢብኑ ኡሰይሚን ፣ ኑሩን ዓለደርብ ፣ \n'
'ኢብኑል ሀጂ አልማሊኪይ ፣ ኪታብ መድኸል',


'ፈታዊ አርካኒል ኢስላም ለኢብኑ ዑሰይሚን ገፅ 392',


'መጅሙዑል ፈታዊ ለኢብኑ ዑሰይሚን ፣ 16ኛው ሙጀለድ ፣ ኪታቡ ሶላቱል ጁሙዓ ፣ \n'
'ኪታቢል መጅሙዕ ለኢማሙ ነወዊይ ፣ 4/500 ፣ \n'
'ሊቃኡል መፍቱህ ለኢብኑ ዑሰይሚን ፣ 3/104',



'ኢማሙ ነወዊይ ፣ ኪታቡል መጅሙዕ ፣ 4/558',



'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 17384 ፣ '
'ኢብኑ ኡሰይሚን ፣ 16/321 ፣ \n'
'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 10/243',



'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 8/253 ፣\n' 
'ኢብኑ ባዝ ፣ መጅሙዑል ፈታዊ ፣ 12/372',


'ኢብኑ ኡሰይሚን ፣ መጅሙዑል ፈታዊ ፣ 16/128 ፣\n'
'የሳኡዲ የኢልም ጥናትና የፈትዋ ቋሚ ኮሚቴ ፣ 4/40',



'አልመጅሙዕ ለኢማሙ ነወዉይ ፣  1/368\n'
'መጅሙዑል ፈታዊ ለኢብኑ ባዝ ፣ 12/406\n'
'መጅሙዑል ፈታዊ ለኢብኑ ዑሰይሚን ፣ 16/137',



'https://binbaz.org.sa/fatwas/21592/ما-المشروع-قوله-بين-خطبتي-الجمع\n'
'መጀለቱል መናር ፣ 6/792 \n'
'ሙግኒል ሙህታጅ ፣ 1/557',



'አል አጅዊበቱ አንናፊዓህ ፣ ለሸይኹል አልባኒ ፣ ገፅ 20 \n'
'መጅሙዑል ፈታዊ ፣ ለኢብኑ ዑሰይሚን ፣ 16/127 \n'
'https://www.alfawzan.af.org.sa/ar/node/11249\n'
'https://binbaz.org.sa/fatwas/8255/حكم-الاذان-الاول-والثاني-للجمعة',



'ሸይኹል አልባኒ : ሲልሲለቲ አድዶዒፋ',


'ሸይኹል አልባኒ : ሲልሲለቲ አድዶዒፋ፣ 1/480',


'የሳኡዲ የዒልም ጥናትና የፈትዋ ቋሚ ኮሚቴ እና \n'
'ኢብን ኡሰይሚን ረሂመሁሏህ\n',



'ሸይኽ ኢብን ባዝ፣ ሸይኽ ፈውዛን',



'ኢብኑ ባዝ ረሂመሁሏህ ፣ መጅሙዑል ፈታዊ',



'ኢብኑ ባዝ ረሂመሁሏህ ፣ ኑሩን ዓለደርብ በሬድዬ የፈትዋ ፕሮግራም',


'አልባኒ ፣ ሲልሲለቲ ዶዒፋህ ፣ 845',


'ተፍሲሩል ቁርጡቢ ፣ 10/386 ፣\n '
'ኢብኑል ጀውዚይ ፣ ኪታብ ዛዱል ሙየሰር ፣ 5/128 ፣\n '
'ኢብኑ ኡሰይሚን ፣ ፈትዋ ኑሩን አለደርብ ',


'ኢማሙ ሲዩጢይ ፣ ተድሪቡ ራዊ'


];



List<String> questions4 = [

  'በሸሪዓችን በግ ወይም ከብት ስናርድ በምን መልኩ ነው ፣ ስለ አስተራረዱ በሰፊው ቢብራራልን?',

  '',

  'የዒድ ቀን ኢድ ሙባረክ ፣ ተቀበለሏሁ ሚማ ወሚንኩምና የመሳሰሉትን የደስታ መገለጫዎች መባባል እንዴት ይታያ',


  'ኢድ የሚሰገደው ሜዳ ላይ ነው መስጀድ አይቻልመወ የሚባል ነገር ሰምቼ ነው ፣ ' 
'እኛ ጋር ደግሞ መሰጂድ ነው የሚሰገደው ይህ እንዴት ነው?',

'ብዙ ቦታዎች ላይ ወደ ዒድ መስገጃ ቦታ ሲኬድ ተክቢያ በጀመኣ በአንድ ድምፅ ይባላል ፣ '
'አስባይና ተቀባይም ይኖራልና ይህ እንዴት ይታያል ፣ ትክክለኛው የተክቢራ አባባል የትኛው ነው?',


'በየ ጁሙዓው በማህበራዊ ገፆችና በተለያዩ አጋጣሚዎች ሰዎች ሲገናኙ ጁሙዓ_ሙባረክ '
'መባባላቸውና እንደዚህ አይነት መልእክት መላላካቸው እንዴት ይታያል?',



'አንዳንድ ሰዎች ጁሙዓ ወቅት ላይ መስጊድ ውስጥ ቁጭ ብለው እያለ አዛን '
'ሲደረግ ሱና ሶላት ለመስገድ ይነሳሉ እና ይህ እንዴት ይታያል?',


'የጁሙዓ ኹጥባ ላይ በሚደረገው ዱኣ ላይ እጅን ማንሳት እንዴት ይታያል?',


'ብዙ ሰዎች ጁሙዓ ቀን ጉዞ መውጣት አይቻልም ይላሉ ፣ ትክክል ነውን?',


'አንድ ሰው ጁሙዓ ሶላትን ኢማሙ ተሸሁድ ላይ እያለ ከደረሰ ምንድን ነው የሚያደርገው? '
'ጁሙዓን ያገኛል ማለት   ሁለት ረከአ ነው የሚሰግደው ወይስ እንደ ዝሁር አራት ነው?',


'ብዙ መስጂዶች ላይ ኢማሙ ኹጥባ እያደረገ እያለ ዱአ ሲያደርግ ታዳሚው '
'እየጮኸ አሚን ይላሉ ይህ እንዴት ይታያል ፣ ቢድዓስ ይሆናልን?',



'አሁን አሁን በአንዳንድ አካባቢዎች አንዳንድ ኢማሞች '
'የጁሙዓውን ኹጥባ በአካባቢው ቋንቋ ተርጉመው ያደርጋሉ ፣ ይህ እንዴት ነው?',



'በእኛ አካባቢ ዘወትር ጁሙአ ጁሙአ አብዛህኛው መስጂድ ውስጥ '
'በማይክራፎን ቁርአን ይከፈታል ፣ ይህን የሚያደርጉት ሰውን ወደ '
'መስጂድ ለመጥራት ወይም ጁሙአ ቀን ስለሆነ ብለው ነው። ይህ በሸሪዓችን እንዴት ይታያል?',



'አንድ ሰው የጀናባ ትጥበት እያለበት የጁሙዓንም ትጥብት መታጠብ ቢፈልግ '
'ኒያውን በምን መልኩ ነው ፣ የትጥበቱስ ብዛት ፣ ለሁለቱም የተለያየ ትጥበት ነው ወይስ በአንድ ትጥበት ይበቃል?',



'ኢማሙ በሁለቱ ኹጥባዎች መካከል አረፍ በሚልበት ወቅት የምናደርገው ልዩ የሆነ ዱዓ ወይም አዝካር አለን?',


'የጁሙዓ 1ኛው አዛን ቢድዓ ነውን? አንዳንድ ሰዎች ቢድዓ ነው ይላሉ ፣ ሌሎች ደግሞ '
'ሱና ነው ይላሉ ፣ በላጩ የቱ ነው? ኡስማንንስ በጨመረው ነገር መከተል እንችላለን?',

'       ',


'       ',



'"ነብዩ ሶለሏሁ አለይሂ ወሰልም አንድ ግዜ ለአሊይ እንዲህ አሉት:—\n\n'
'አንተ አልይ ሆይ ከመተኛትህ በፊት እነዚህን አምስት ነገሮች ተግብር ፡፡ \n'
'1, ስትተኛ አራት ሺህ ድናር ሰደቃ ስጥ  \n'
'2, ሙሉ ቁርአን አኽትም \n'
'3, ለጀነት ዋጋዋን ክፈል \n'
'4, ሁለት ሰወች አስታርቅ \n'
'5, ከዚያም አንድ ጌዜ ሀጅ አድርገህ ተኛ አሉ ፡\n\n '
'ዐልይ ረ.ዐ አሉ ያረሱለላህ እሄን በአንድ ለሌት እንዴት ማድረግ ይቻላል ?\n'
 'እንዴት ነው ማድረግ  የምንችለው ? ከዚያም ረሱል ሰ.ዐ.ወ የሚከተለው ተናገሩ\n\n'
'1) 4ጌዜ ሱረቱል ፋቲሓ አልሐምዱሊላሂ የሚለውን የቀራ ከ4000 ድናር ሰደቃ ጋር እኩል ነው \n'
'2) ሶስት ጌዜ ሱረቱል ኢኽላስ  የቀራ ሙሉ ቁርአን እንዳከተመ ይቆጠርለታል \n'
'3) ላሃውላወላቁወተ ኢላ ቢላህ አልዪል አዚምን ሶስት ጌዜ ያለ ጀነት ዋጋውን ከፍሏል \n'
'4) አስር ጌዜ አስግፉርላህ ያለ ሰው ሁለት ሰዎችን እንደማስታረቅ \n'
'5) አራት ጌዜ ሸሀዳ የደረገ ሰው አንድ ጌዜ ሀጅ እንዳደረገ ነው፡፡ ከዛም ዐልይ ረ.ዐ ከአልጋ መሄድ በፊት አደርገዋለሁ አሉ።\"'

'ይህ ሀዲስ ትክክለኛነቱ እንዴት ነው?',


'በጁሙዓ ኹጥባ ላይ ያለው ዱዓ ላይ እጅን ከፍ አድርጎ አሚን ማለትና ከዱዓ በኃላ ፊትን በእጅ ማበስ እንዴት ይታያል?',


'ሸረሪት አትገደልም ፣ ለነቢዩ ሰ.ዐ.ወ  ሊገድሉ  የመጡ ሰወች  እንዳይታዩ  አድርጋ ስለሸፈነች  እስዋን መግደል አይቻልም ይላሉ። '
'እንዴት ነው ቤት  ደሞ ታበላሻለች  የራስዋ  ቤት እየሰራች  ቤት  ይበላሻል እና  እንዴት ነው?',



'ሀይድ ላይ ያለች ሴት ቁርአን መቅራት ትችላለችን?',


'በወንድ ልጅ በደል ምክኒያት የሴት ልጅ አይን ካነባች/ካለቀሰች በሚራመደው እርምጃ ልክ '
'መላኢኮች ይረግሙታል! [ዐሊይ ኢብኑ አቡ ጣሊብ] ይህ ሀዲስ ትክክለኛነቱ እንዴት ነው?',


'ብዙ ጊዜ ሰዎች እቃም ይሁን የሆነ ነገር ሲጠፋቸው ለማስታወስና ትዝ እንዲላቸው '
'ብለው \"አሏሁመ_ሶሌ_አላ_ሙሀመድ\" ይላሉ ለዚህም ደግሞ ሀዲስ አለ ይላሉ ይህ እንዴት ነው?',



'ብዙ ጊዜ በየማህበራዊ ሚዲያው የሚተላለፍ አንድ ሀዲስ አለ ፣ '
'እሱም ረመዷን መች እንደሆነ ለመጀመሪያ ጊዜ ለወንድሙ የተናገረ '
'እሳት ከሱ ሀራም ትሆንበታለች ይላልና ይህ ሀዲስ ትክክለኛነቱ እንዴት ነው?'



];